[
    {
        "index": 1,
        "title": "Distributed microservices in the real world",
        "url": "https://www.youtube.com/watch?v=Lvw3Lp3KrTM",
        "video_id": "Lvw3Lp3KrTM",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 3460,
        "view_count": 464,
        "like_count": 8,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "ImraanParker"
        ],
        "categories": [
            "Education"
        ],
        "description": "Imraan Parker\n\nhttps://2018.za.pycon.org/talks/2-distributed-microservices-in-the-real-world/\n\nThis talk is intended for anyone interested in deploying microservices in their environment. It examines what is involved in developing, deploying and maintaining a distributed microservices architecture. Moving from a monolithic architecture to a services oriented architecture has many benefits and tradeoffs that need to be addressed.\r\n\r\nOne has to consider whether to go with an off the shelf solution or build your own. When does it make sense to do the latter? Tasks like monitoring and debugging is more difficult with the added complexity that is inherent with a distributed system.\r\n\r\nThis first part of the talk reviews what needs to be considered when deciding to build applications on a distributed microservices architecture. Topics that will be covered include:\r\n‹ul›\r\n    ‹li›Why choose a microservices architecture, and when not to?‹/li›\r\n    ‹li›Objectives of a distributed services architecture‹/li›\r\n    ‹ul›\r\n        ‹li›Service presence‹/li›\r\n        ‹li›Heartbeating‹/li›\r\n        ‹li›Logging‹/li›\r\n        ‹li›Security‹/li›\r\n        ‹li›Reliability‹/›\r\n        ‹li›Performance and Scalability‹/li›\r\n        ‹li›Monitoring‹/li›\r\n        ‹li›Troubleshooting‹/li›\r\n        ‹li›Message contracts‹/li›\r\n    ‹/ul›\r\n‹/ul›\r\n\r\nThe second part of the talk delves into the micorservices framework built and used by CareerJunction. It is an in house framework written in Python 3 (3.5+) which uses asyncio for nonblocking I/O and ZeroMQ as a concurrency networking library.\r\n\r\nIn simple terms, the framework implements a reliable service-oriented request-reply dialog between a set of client applications, a set of brokers and a set of worker applications. \r\n\r\nThe features of the framework include those discussed in the first part of the talk and will be showcased by coding and deploying a service. Above and beyond that, the following topics will be covered:\r\n‹ul›\r\n    ‹li›Conceptual architecture‹/li›\r\n    ‹li›Architecture goals‹/li›\r\n    ‹li›Coding a service‹/li›\r\n        ‹ul›\r\n            ‹li›Creating and running a service‹/li›\r\n            ‹li›Message contract parameters‹/li›\r\n            ‹li›Exposing services via HTTP‹/li›\r\n            ‹li›Scheduled Jobs‹/li›\r\n        ‹/ul›\r\n‹/ul›\r\n\r\nThe last part of the talk examines the lessons learnt over the past few years, what to avoid and the benefits it brought not only to the IT team, but to the business as a whole.\r\nTopics that will be covered include:\r\n‹ul›\r\n    ‹li›IT benefits‹/li›\r\n    ‹li›Business benefits‹/li›\r\n    ‹li›What to avoid?‹/li›\r\n‹/ul›\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/Lvw3Lp3KrTM/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Lvw3Lp3KrTM",
        "original_url": "https://www.youtube.com/watch?v=Lvw3Lp3KrTM"
    },
    {
        "index": 2,
        "title": "Python as a tool for e-health systems",
        "url": "https://www.youtube.com/watch?v=CmVK87fkh2U",
        "video_id": "CmVK87fkh2U",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2094,
        "view_count": 1642,
        "like_count": 28,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "DianaPholo"
        ],
        "categories": [
            "Education"
        ],
        "description": "Diana Pholo\n\nhttps://2018.za.pycon.org/talks/45-python-as-a-tool-for-e-health-systems/\n\nE-health has proven to have many benefits including reduced errors in medical diagnosis.\nA number of machine learning (ML) techniques have been applied in medical diagnosis, each\nhaving its benefits and disadvantages.\nWith its powerful pre-built libraries, Python is great for implementing machine learning in the medical field, where many people do not have an Artificial Intelligence background.\n\nThis talk will focus on applying ML on medical datasets using Scikit-learn, a Python module that comes packed with various machine learning algorithms. It will be structured as follows:\n\n‹ul›\n    ‹li›An introduction to e-health.‹/li›\n    ‹li›Types of medical data.‹/li›\n    ‹li›Some Benchmark algorithms used in medical diagnosis: Decision trees, K-Nearest Neighbours, Naive Bayes and Support Vector Machines.‹/li›\n    ‹li›How to implement benchmark algorithms using Scikit-learn.‹/li›\n    ‹li›Performance evaluation metrics used in e-health.‹/li›\n‹/ul›\n\nThis talk is aimed at people interested in real-life applications of machine learning using Python. Although centered around ML in medicine, the acquired skills can be extended to other fields.\n\nAbout the speaker: Diana Pholo is a PhD student and lecturer  in the department of Computer Systems Engineering, at the Tshwane University of Technology.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/CmVK87fkh2U/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=CmVK87fkh2U",
        "original_url": "https://www.youtube.com/watch?v=CmVK87fkh2U"
    },
    {
        "index": 3,
        "title": "Playing with Python's internals",
        "url": "https://www.youtube.com/watch?v=Wm47491S-Fo",
        "video_id": "Wm47491S-Fo",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2462,
        "view_count": 1275,
        "like_count": 24,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "AlexHall"
        ],
        "categories": [
            "Education"
        ],
        "description": "Alex Hall\n\nhttps://2018.za.pycon.org/talks/33-playing-with-pythons-internals/\n\nThis talk will look at two of my libraries which stretch the limits of what's possible with Python:\n\n1. [birdseye](https://github.com/alexmojaki/birdseye), a debugger that records the value of every expression for easy viewing, and\n2. [sorcery](https://github.com/alexmojaki/sorcery), a framework for writing magical functions which know the context in which they are called.\n\nThey work by inspecting and manipulating Python's inner workings: execution frames, code objects, and most importantly the Abstract Syntax Tree (AST). I will give an overview of these concepts and explain how some parts of the libraries work.\n\nThis is for people interested in peeking under the hood of Python from within Python, i.e. no C and no messing with the interpreter.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/Wm47491S-Fo/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Wm47491S-Fo",
        "original_url": "https://www.youtube.com/watch?v=Wm47491S-Fo"
    },
    {
        "index": 4,
        "title": "Elementary, my dear Python",
        "url": "https://www.youtube.com/watch?v=rk3k4s7Ec6Q",
        "video_id": "rk3k4s7Ec6Q",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 1983,
        "view_count": 240,
        "like_count": 2,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "ErinVersfeld"
        ],
        "categories": [
            "Education"
        ],
        "description": "Erin Versfeld\n\nhttps://2018.za.pycon.org/talks/72-elementary-my-dear-python/\n\nSherlock is a diagnostics framework used to assess fleet health within Oracle Public Cloud. It is developed in Python, and operates within a restricted Python environment, but has been designed to overcome the challenges of our enterprise environment.\n\nThis talk will provide an overview of the restricted Python environment in which Sherlock operates and discuss how Sherlock has leveraged features of Python to maintain its independence. It will highlight the design challenges that were faced to ensure that the framework could be robust and lightweight. As part of the talk, I will showcase how we've utilised Python's strengths to provide a framework which easily allows developers from vastly different teams to write diagnostic scripts to easily asses service health across a global fleet.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/rk3k4s7Ec6Q/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=rk3k4s7Ec6Q",
        "original_url": "https://www.youtube.com/watch?v=rk3k4s7Ec6Q"
    },
    {
        "index": 5,
        "title": "Reproducible Data Science with Docker",
        "url": "https://www.youtube.com/watch?v=lfGGQQyy8ec",
        "video_id": "lfGGQQyy8ec",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 2126,
        "view_count": 300,
        "like_count": 7,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "RichardAckon"
        ],
        "categories": [
            "Education"
        ],
        "description": "Richard Ackon\n\nhttps://2018.za.pycon.org/talks/48-reproducible-data-science-with-docker/\n\nCollaboration is a major part of doing Data Science. This means Data Scientists are always sharing their work with their colleagues whether to continue in the Data Science process or for review. One problem that is mostly faced in this process is the \"It works on my machine\" problem. \n\nDocker is a tool that is used to package and run applications with all their dependencies in an isolated environment. \n\nIn this talk, I'll use Python to analyse some data in jupyter notebooks and show how Docker can be used to ensure reproducibility of that analysis in a different environment.\n\nThis talk will cover:\n‹ul›\n    ‹li›The basics of the data science workflow‹/li›\n    ‹li›The basics of Docker‹/li›\n    ‹li›A demonstration of sharing and reproducing data analysis work in a jupyter notebook.‹/li›\n‹/ul›\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/lfGGQQyy8ec/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=lfGGQQyy8ec",
        "original_url": "https://www.youtube.com/watch?v=lfGGQQyy8ec"
    },
    {
        "index": 6,
        "title": "The Developer's Guide to Data Science",
        "url": "https://www.youtube.com/watch?v=Krgp7A21-Y4",
        "video_id": "Krgp7A21-Y4",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2402,
        "view_count": 174,
        "like_count": 1,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "HelgeReikeras"
        ],
        "categories": [
            "Education"
        ],
        "description": "Helge Reikeras\n\nhttps://2018.za.pycon.org/talks/30-the-developers-guide-to-data-science/\n\nThe myth of data science holds that you need an army of machine learning PHDs to be able to implement anything impactful with data science. In this talk I will attempt to dispel this myth and show how software developers can skip getting the machine learning PHD and start building awesome software with Data Science and Machine Learning today.\n\nI believe developers are well situated to implement data science projects as they possess the understanding of how the product works, how users like to interact with the product and their opinions are already valued within the business.\n\nTo help developers level up their data science skills, I’ll discuss the core concepts behind the most prevalent methods in data science, how the data science process works, how to think like a data scientist, which frameworks and programming languages to choose (surprise Python!) and how to measure and communicate the value-add of data science projects to the business.\n\n‹em›About the speaker: Helge Reikeras is a Data Scientist at Offerzen with over 6 years experience in practical data science and has also worked as a software developer at various points in his career.\n‹/em›\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/Krgp7A21-Y4/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Krgp7A21-Y4",
        "original_url": "https://www.youtube.com/watch?v=Krgp7A21-Y4"
    },
    {
        "index": 7,
        "title": "Bring Django Girls Workshop to Mozambique.",
        "url": "https://www.youtube.com/watch?v=q7wzAZlpdnM",
        "video_id": "q7wzAZlpdnM",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2299,
        "view_count": 225,
        "like_count": 7,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "CeciliaTivir",
            "CarinaMatimbe"
        ],
        "categories": [
            "Education"
        ],
        "description": "Cecilia Tivir, Carina Matimbe\n\nhttps://2018.za.pycon.org/talks/35-bring-django-girls-workshop-to-mozambique/\n\nIn Mozambique, as well as in other African countries, ICT is still seen as being exclusively for boys. Social norms do not teach women to choose coding or others ICT areas.\r\n\r\nBringing Django Girls Workshop to Maputo was meant to teach girls more than how to code and create amazing blogs, we also wanted to use it as a platform to create opportunities that would empower them and promoting the diversity in technology.\r\n\r\nToday we have started to hold small and informal meetings to teach girls and boys how to program in python. Some of the girls who have participated in Django Girls Maputo workshops have continued to learn more  and develop their skills. We hope to have more girls learn how to code in python so they can also share their experiences.\r\n\r\nOur talk will cover the importance of how bringing Django Girls community to our girls in Mozambique  and how powerful  it was, is and it will be to bring them to demonstrate their abilities, skills and belief in their capabilities.\r\n\r\nThe message we intend to cover to the audience is that Django Girls is not only for a some women, but it's for all women that we can reach, so that we can encouraging more women to strive for programming careers benefits the tech community at large and also is a way to give them tools and show them the way that they can empower themselves and  contribute in technological development, so that better the societies they are situated in.\r\n\r\nOne of the most amazing feedbacks that we got was: \"In this event it is possible to realize that anyone is capable of developing technological tools. Django Girls has come to say that women are capable of programming, coding and creating technological solutions\".\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/q7wzAZlpdnM/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=q7wzAZlpdnM",
        "original_url": "https://www.youtube.com/watch?v=q7wzAZlpdnM"
    },
    {
        "index": 8,
        "title": "From Idea to Product: Customer Profiling in Apache Zeppelin with PySpark",
        "url": "https://www.youtube.com/watch?v=K2ZMU2VV9OM",
        "video_id": "K2ZMU2VV9OM",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2165,
        "view_count": 4575,
        "like_count": 74,
        "comment_count": 2,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "SarahSprich"
        ],
        "categories": [
            "Education"
        ],
        "description": "Sarah Sprich\n\nhttps://2018.za.pycon.org/talks/61-from-idea-to-product-customer-profiling-in-apache-zeppelin-with-pyspark/\n\nZeppelin is a web based notebook which enables interactive data analytics on big data.  Data can easily be ingested from a variety of databases and analysis can be performed in Python and Pyspark.  Visualisations can be built and displayed together with the code, using Zeppelin’s built in tool Helium, or Python specific tools such as Matplotlib and Bokeh.  The web based interface facilitates easy sharing of results, and collaboration on projects.\r\n \r\nDeveloping in Zeppelin has changed the way we approach model development.  We are able to take a project from an idea to a product all within one tool using the following process:\r\n‹ol›\r\n    ‹li›Come up with an idea. Write some notes in a Zeppelin notebook describing how we would like the idea implemented.‹/li›\r\n    ‹li›Slowly start fleshing out the idea, with real code, until the solution is built.  This is great to demo, as the code is in bite size chunks, and visualisations can be added directly in.‹/li› \r\n    ‹li›Take the code into production.  It can be scheduled it to run directly in Zeppelin with a cron scheduler, or from a tool such as Nifi.  Interactive visualisations can be embedded in a web-based frontend.‹/li›\r\n‹/ol›\r\n \r\nThis talk is aimed at data scientists, particularly those working with big data.  We will demonstrate how we have built a catalogue of subscriber attributes based on customer mobile usage and purchase behavior using Zeppelin and Pyspark.  These attributes can be used to profile subscribers, and are the starting point for indivisualised customer engagement.  Anyone who attends this talk will get an introduction to Zeppelin and Pyspark and an overview of what can be achieved with these tools.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/K2ZMU2VV9OM/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=K2ZMU2VV9OM",
        "original_url": "https://www.youtube.com/watch?v=K2ZMU2VV9OM"
    },
    {
        "index": 9,
        "title": "An introduction to concurrent programming with asyncio",
        "url": "https://www.youtube.com/watch?v=x1RXHcE3oVI",
        "video_id": "x1RXHcE3oVI",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2084,
        "view_count": 234,
        "like_count": 4,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "BruceMerry"
        ],
        "categories": [
            "Education"
        ],
        "description": "Bruce Merry\n\nhttps://2018.za.pycon.org/talks/27-an-introduction-to-concurrent-programming-with-asyncio/\n\nConcurrent programming is useful any time one needs to deal with multiple concurrent tasks: a server answering requests from multiple clients, a client scraping data from multiple servers, a workflow manager running external processes in a pipeline, and more.\r\n\r\nWhile there are many concurrent programming frameworks for Python, there is one that is included out of the box: asyncio. I will introduce the framework and explain the syntax and APIs. Perhaps more importantly, I will offer practical tips on development with asyncio, such as exception handling, testing, debugging, and integration with existing code.\r\n\r\nAttendees will come away with an understanding of why they will want to use asyncio instead of multi-threading, an understanding of the basic concepts, and knowledge of some additional libraries that will help them be productive with asyncio.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/x1RXHcE3oVI/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=x1RXHcE3oVI",
        "original_url": "https://www.youtube.com/watch?v=x1RXHcE3oVI"
    },
    {
        "index": 10,
        "title": "A Brief Introduction to PyGame Zero",
        "url": "https://www.youtube.com/watch?v=Qd35oQXwkf0",
        "video_id": "Qd35oQXwkf0",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 1701,
        "view_count": 4846,
        "like_count": 51,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "NeilMuller"
        ],
        "categories": [
            "Education"
        ],
        "description": "Neil Muller\n\nhttps://2018.za.pycon.org/talks/76-a-brief-introduction-to-pygame-zero/\n\nPyGame Zero is designed to be a boilerplate free wrapper around PyGame, avoiding the need to manage the PyGame event loop and simplifying the API significantly.\r\n\r\nPyGame Zero is designed as an educational tool, but it does not compromise on the ability to create complex games and so it also serves as a nice general purpose introduction to writing graphical games in python.\r\n\r\nIn this talk, I will give a brief introduction to PyGame Zero, demonstrating it's core functionality and delve into some of the more advanced features it provides.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/Qd35oQXwkf0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Qd35oQXwkf0",
        "original_url": "https://www.youtube.com/watch?v=Qd35oQXwkf0"
    },
    {
        "index": 11,
        "title": "Jupyter Notebooks for Data Science",
        "url": "https://www.youtube.com/watch?v=VDeuikb9S3c",
        "video_id": "VDeuikb9S3c",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2310,
        "view_count": 402,
        "like_count": 3,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "AriRamkilowan"
        ],
        "categories": [
            "Education"
        ],
        "description": "Ari Ramkilowan\n\nhttps://2018.za.pycon.org/talks/12-jupyter-notebooks-for-data-science/\n\nThis talk is intended for beginner and intermediate data scientists/ analysts/ engineers, although I hope that even experienced data scientists can gain something from the talk. \r\n\r\nThe talk will focus on using Jupyter notebooks in data science applications. I will discuss the basics of how to get it up and running and the common features like using markup and code in the same notebook, I will highlight the advantages of working in a notebook rather than a traditional IDE. I will also discuss other features like using code snippets, autocomplete, linting and creating a table of contents. Inserting images and videos into a notebook along side your code can be a handy way of learning something new. I will end the talk with a look into jupyterlab.\r\n\r\nAttendees of this course will gain an understanding and appreciation of the quick prototyping that is afforded to you when using Jupyter notebooks in your data science pipeline. Especially when it comes to exploratory data analysis. I want to be able to showcase all the common features of Jupyter notebooks but also some less known ones, so that there everyone attending the talk will learn something.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/VDeuikb9S3c/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=VDeuikb9S3c",
        "original_url": "https://www.youtube.com/watch?v=VDeuikb9S3c"
    },
    {
        "index": 12,
        "title": "Deploying and Managing Python with Kubernetes",
        "url": "https://www.youtube.com/watch?v=N0-_Pt6Q52Y",
        "video_id": "N0-_Pt6Q52Y",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 2130,
        "view_count": 500,
        "like_count": 9,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "JoannahNanjekye"
        ],
        "categories": [
            "Education"
        ],
        "description": "Joannah Nanjekye\n\nhttps://2018.za.pycon.org/talks/32-deploying-and-managing-python-with-kubernetes/\n\nBecause of the benefits of containers, python applications have been containerized recently. Containers have magically changed the way we deploy and manage python applications allowing us to build, develop, test, and even deploy python applications on a single system with no upgrade downtimes. \r\n\r\nKubernetes is the missing layer that gives us the ability to manage many containers by providing features that enable containers to scale, talk to each other and work in harmony. \r\n\r\nThis talk will focus on how python developers can leverage Kubernetes to manage any sort of python application on Kubernetes from simple to complex applications.\r\n\r\nThe talk will cover:\r\n\r\n- The basics of Kubernetes.\r\n- The basics of containerizing python applications.\r\n- How to run and deploy simple, web and deep learning python pipelines on Kubernetes.\r\n- How to manage or work with Kubernetes using the Kubernetes python client.\r\n\r\nThis talk will cover in summary the topics I talk about in my upcoming book \"Deploying and Managing Python with Kubernetes\" published by Apress sometime this year.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/N0-_Pt6Q52Y/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=N0-_Pt6Q52Y",
        "original_url": "https://www.youtube.com/watch?v=N0-_Pt6Q52Y"
    },
    {
        "index": 13,
        "title": "Testing in the wild",
        "url": "https://www.youtube.com/watch?v=VUyyr52aEm0",
        "video_id": "VUyyr52aEm0",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 1607,
        "view_count": 103,
        "like_count": 2,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "HeatherWilliams"
        ],
        "categories": [
            "Education"
        ],
        "description": "Heather Williams\n\nhttps://2018.za.pycon.org/talks/47-testing-in-the-wild/\n\n‹strong›Introduction‹/strong›\r\n\r\nThis talk is aimed at anyone interested in testing real code with real deadlines. In this talk Test Driven Development (TDD) will be explored along with alternatives to TDD. By the end of this talk participants will have a greater understanding of how to apply one of the tools of testing in the real world and how to ensure they have time in the development cycle to test their code.\r\n\r\n‹strong›Questions covered‹/strong›\r\n\r\nAlmost everyone talks about TDD these days. TDD is taken as the thing to aim for and the one thing you must do as a developer. But does TDD actually work when you are out of the classroom context and in the real world? Are there alternatives to TDD that are better to use? How do you begin to test legacy code so that you can change it safely? What about that new feature that marketing wants ASAP and you have to quickly pull a rabbit out the hat for? How should one ensure that this new code is added rapidly but with good tests? These and many other questions will be briefly explored in this talk.\r\n\r\n‹strong›Tools used‹/strong›\r\n\r\nThis talk will focus on unit testing and will use ‹a href=\"https://pypi.org/project/nose/\"›Python nose‹/a› as the test runner. Python nose extends ‹a href=\"https://docs.python.org/2/library/unittest.html\"›unittest‹/a› and makes it easier to setup, discover and run tests with Python. Some brief examples of tests will be shown using Python 2.7 but the broader concepts apply equally well to Python 3.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/VUyyr52aEm0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=VUyyr52aEm0",
        "original_url": "https://www.youtube.com/watch?v=VUyyr52aEm0"
    },
    {
        "index": 14,
        "title": "Teach kids (7-17) to code with python & CoderDojo",
        "url": "https://www.youtube.com/watch?v=VeBZUbMVt9A",
        "video_id": "VeBZUbMVt9A",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 2597,
        "view_count": 15894,
        "like_count": 234,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "DavidCampey"
        ],
        "categories": [
            "Education"
        ],
        "description": "David Campey\n\nhttps://2018.za.pycon.org/talks/78-teach-kids-7-17-to-code-with-python-coderdojo/\n\nFor the last 6 years (since pycon 2012) David's had a weekly class teaching kids to code. See what the first steps look like, get involved in a dojo!\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/VeBZUbMVt9A/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=VeBZUbMVt9A",
        "original_url": "https://www.youtube.com/watch?v=VeBZUbMVt9A"
    },
    {
        "index": 15,
        "title": "How to deploy your Python Web App on Google Cloud Platform",
        "url": "https://www.youtube.com/watch?v=2ISt6k14qQ4",
        "video_id": "2ISt6k14qQ4",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2472,
        "view_count": 13916,
        "like_count": 118,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "JamesMwai"
        ],
        "categories": [
            "Education"
        ],
        "description": "James Mwai\n\nhttps://2018.za.pycon.org/talks/34-how-to-deploy-your-python-web-app-on-google-cloud-platform/\n\nThe goal of this talk is to give a basic understanding of how you can configure and deploy your Python web app on various Google Cloud Platform services. \r\n\r\nWe will start by demonstrating how to setup and deploy a Python web app on both Standard and Flexible Google App Engine platforms. After that, we will show how to provision a Linux VM on Google Cloud to run a python web app. We will then explore how to package our Python web app into a docker image and deploy the same on Google Kubernetes Engine (GKE). Finally, we will explore Google Cloud Functions and how to write a serverless app in Python. \r\n\r\nThe audience for this talk is generally Python web developers and devops engineers.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/2ISt6k14qQ4/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=2ISt6k14qQ4",
        "original_url": "https://www.youtube.com/watch?v=2ISt6k14qQ4"
    },
    {
        "index": 16,
        "title": "Test your Docker images with Python",
        "url": "https://www.youtube.com/watch?v=NY---NXXHjQ",
        "video_id": "NY---NXXHjQ",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 2035,
        "view_count": 1069,
        "like_count": 13,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "JamieHewland"
        ],
        "categories": [
            "Education"
        ],
        "description": "Jamie Hewland\n\nhttps://2018.za.pycon.org/talks/31-test-your-docker-images-with-python/\n\nAs more and more software is packaged in Docker images, it has become increasingly important that the Dockerfiles and scripts that these images are built from are correct. If Docker images are built and deployed as part of an automated pipeline, it is also important that they continue to work as expected when changes are made upstream.\r\n\r\nStart testing your Docker images without relying on Bash scripts! We’ll cover why we decided to write a testing library and how to use it. We’ll also talk about some of the test fixtures we developed for common infrastructure such as RabbitMQ and PostgreSQL. Finally, we’ll explore some of the limitations and workarounds of creating a test environment of Docker containers.\r\n\r\nSome of the best tools for working with Docker are already written in Python, for example, docker-compose. Bringing together the Python ecosystems around Docker and test frameworks, we created a new Python library called Seaworthy. Seaworthy can be used to verify that a Docker image works as expected in an isolated environment. It provides rich tools for asserting on processes, logs, and HTTP requests.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/NY---NXXHjQ/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=NY---NXXHjQ",
        "original_url": "https://www.youtube.com/watch?v=NY---NXXHjQ"
    },
    {
        "index": 17,
        "title": "Thursday Lightning Talks",
        "url": "https://www.youtube.com/watch?v=l8nxlGE3KYg",
        "video_id": "l8nxlGE3KYg",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 1119,
        "view_count": 35,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "AdriannaPińska"
        ],
        "categories": [
            "Education"
        ],
        "description": "Adrianna Pińska\n\nhttps://2018.za.pycon.org/news/thursday-lightning-talks/\n\nThursday Lightning Talks\r\n========================\r\n\r\n* Bruce Merry: \"The amazing disappearing import\"\r\n* Neil Muller: \"The Python Events Calendar\"\r\n* Johan Zietsman \"Cython - Writing C integrations to Python\"\r\n* Simon Cross: \"What do you get if ...\"\r\n* Gordon Inggs: \"Time series prediction with Facebook Prophet\"\r\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/l8nxlGE3KYg/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=l8nxlGE3KYg",
        "original_url": "https://www.youtube.com/watch?v=l8nxlGE3KYg"
    },
    {
        "index": 18,
        "title": "Python on Azure",
        "url": "https://www.youtube.com/watch?v=OGRrSVwqX9c",
        "video_id": "OGRrSVwqX9c",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2797,
        "view_count": 489,
        "like_count": 1,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "TorosGökkurt"
        ],
        "categories": [
            "Education"
        ],
        "description": "Toros Gökkurt\n\nhttps://2018.za.pycon.org/talks/66-python-on-azure/\n\nPython is a general purpose programming language which has broad usage areas from web applications to data science. Microsoft Azure is an ever-expanding set of cloud services to help your organization meet your business challenges. It’s the freedom to build, manage, and deploy applications on a massive, global network using your favorite tools and frameworks. In this session you will learn about Azure tools and services for Python developers and data scientists and learn how to build and deploy Python apps in Azure, with a range of apps and data services.\r\n\r\nThis talk will provide a high level introduction to the wide range of Azure tools, app and data services for Python developers and data scientist, and will conclude with a demonstration of end to end application lifecycle management of a Python app using Azure services and open source Microsoft tools.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/OGRrSVwqX9c/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=OGRrSVwqX9c",
        "original_url": "https://www.youtube.com/watch?v=OGRrSVwqX9c"
    },
    {
        "index": 19,
        "title": "So What's the Story?",
        "url": "https://www.youtube.com/watch?v=zUy7eeEiH6Y",
        "video_id": "zUy7eeEiH6Y",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 2253,
        "view_count": 152,
        "like_count": 3,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "KerrynGammie"
        ],
        "categories": [
            "Education"
        ],
        "description": "Kerryn Gammie\n\nhttps://2018.za.pycon.org/talks/64-so-whats-the-story/\n\n‹h2›As the world's data grows, so does its aptitude for AI.‹/h2› \r\nIn the context of business, however, translating black-box-magic into something more accessible for business-users to engage with is tricky. While this speaks to a larger problem of upskilling and making education more accessible, one method of translation is through story telling. \r\n\r\nI learn best when an ‹strong›idea is relatable, simple, and colourful‹/strong›. This talk is going to look at how to convey complex ideas simply.  I'm going to be covering two sections: \r\n\r\n‹ul›\r\n    ‹li›1. That's So Random (Forests)!‹/li›\r\n    ‹li›2. You Gotta (Neural) Network to Get Work‹/li›\r\n‹/ul›\r\n\r\nI'll run through the high level concepts and methodologies, and then show the work/code that was done to create a random forest, and a neural network. Note: this will cover how I built the RF, and NN using Python via Jupyter Notebook.\r\n\r\nThis session is for anyone who uses/wants to use ML to solve problems but struggles with translating the black-box-magic. \r\nIt's going to be an engaging, and slightly animated, talk with the intention of reinforcing concepts and showcasing different ways of explaining them.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/zUy7eeEiH6Y/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=zUy7eeEiH6Y",
        "original_url": "https://www.youtube.com/watch?v=zUy7eeEiH6Y"
    },
    {
        "index": 20,
        "title": "Batteries Included",
        "url": "https://www.youtube.com/watch?v=ZfgnizIG3Bg",
        "video_id": "ZfgnizIG3Bg",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2627,
        "view_count": 449,
        "like_count": 9,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "JonatasBaldin"
        ],
        "categories": [
            "Education"
        ],
        "description": "Jonatas Baldin\n\nhttps://2018.za.pycon.org/talks/58-batteries-included/\n\nPython is a “batteries included” language, but how many batteries are you using today? It’s so easy to install and import a third-party package that we end up forgetting how vast and valuable the Python Standard Library is. In this talk I’ll be exploring the default Python ecosystem, the one that does not need a pip install to be used. From collections to bisect, everyone from with any Python knowledge is welcome to have some fun and learn about the tools you already have in your toolbelt.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/ZfgnizIG3Bg/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=ZfgnizIG3Bg",
        "original_url": "https://www.youtube.com/watch?v=ZfgnizIG3Bg"
    },
    {
        "index": 21,
        "title": "Python Community Development in East Africa",
        "url": "https://www.youtube.com/watch?v=C344MCBpa3Q",
        "video_id": "C344MCBpa3Q",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2167,
        "view_count": 242,
        "like_count": 4,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "LinusWamanya",
            "KatoJoshua",
            "BuwemboMurshid"
        ],
        "categories": [
            "Education"
        ],
        "description": "Linus Wamanya, Kato Joshua, Buwembo Murshid\n\nhttps://2018.za.pycon.org/talks/74-python-community-development-in-east-africa/\n\nThe talk is about the growth of the python user community in East Africa, streamlining the role Afrodjango initiative is playing in building and empowering people with Python software development skills in the region.\r\n \r\nOur audience is python community developers and accelerators of python programs.\r\nwe want the above mentioned participants to learn about our activities and how we are helping expand the python user community across the region.\r\nwe will be covering the growth and expansion of the python community in East Africa.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/C344MCBpa3Q/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=C344MCBpa3Q",
        "original_url": "https://www.youtube.com/watch?v=C344MCBpa3Q"
    },
    {
        "index": 22,
        "title": "Dimensionality reduction - squeezing out the good stuff with PCA",
        "url": "https://www.youtube.com/watch?v=OXzk7u5u_Ts",
        "video_id": "OXzk7u5u_Ts",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 2380,
        "view_count": 509,
        "like_count": 9,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "AabirAbubakerKar"
        ],
        "categories": [
            "Education"
        ],
        "description": "Aabir Abubaker Kar\n\nhttps://2018.za.pycon.org/talks/28-dimensionality-reduction-squeezing-out-the-good-stuff-with-pca/\n\nData is often high-dimensional - millions of pixels, frequencies, categories. A lot of this detail is unnecessary for data analysis - but how much exactly? This talk will discuss the ideas and techniques of dimensionality reduction, provide useful mathematical intuition about how it's done, and show you how Netflix uses it to lead you from binge to binge.\r\n\r\nIn this session, we'll start by remembering what data really is and what it stands for. Data is a structured set of numbers, and these numbers typically (hopefully!) hold some information. This will lead us naturally to the concept of a *high-dimensional dataspace*, the mystical realm in which data lives. It turns out that data in this space displays an extremely useful 'selection bias' - ***a datapoint can be known by the company it keeps***. This is one of the basic ideas behind **k-means clustering**, which we will briefly discuss.\r\n\r\nWe'll then talk about the *informative-ness* of certain dimensions of the data space over others. This lays the mathematical foundation for the technique of **Principal Component Analysis** (PCA), which we will run on the Netflix movie dataset using *scikit-learn*.\r\n\r\nWe will also touch upon **tSNE**, another popular dimensionality-reduction algorithms.\r\n\r\nI will be using *scikit-learn* for processing and *matplotlib* for visualization. The purpose of this session is to introduce dimensionality-reduction to those who do not know it, and to provide useful guiding intuitions to those who do. We'll also discuss some seminal use-cases, with tips and warnings for your own applications.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/OXzk7u5u_Ts/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=OXzk7u5u_Ts",
        "original_url": "https://www.youtube.com/watch?v=OXzk7u5u_Ts"
    },
    {
        "index": 23,
        "title": "From Zero to kind of a hero: Getting your Python side project ready for deployment",
        "url": "https://www.youtube.com/watch?v=0fP-Fjij97A",
        "video_id": "0fP-Fjij97A",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2349,
        "view_count": 208,
        "like_count": 8,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "SewagodimoMatlapeng"
        ],
        "categories": [
            "Education"
        ],
        "description": "Sewagodimo Matlapeng\n\nhttps://2018.za.pycon.org/talks/41-from-zero-to-kind-of-a-hero-getting-your-python-side-project-ready-for-deployment/\n\nOne evening, my little sister asked me for help with her homework at 9pm. She had already asked her classmates on a WhatsApp group, but nobody was able to help as all her peers had the same limited resources available to them. This gave me the idea for Buza (Zulu for “ask”), a platform for high school learners to ask questions that could be answered by volunteer university students in their free time.\r\n\r\nBuza is the first side project of mine that I’ve ever truly wanted to deploy. After months of coding and adding loads of features, I finally reached out to a senior developer to help me deploy my truck of features. The first thing she said was “A lot of this code will have to be replaced with production-ready code”. These are words you never want to hear.\r\n\r\nUniversity Computer Science equipped me with the ability to write code to solve problems, but in industry extra skills were required to build production-ready software. This talk will share the valuable lessons I learned from getting this Django web app production-ready. This will start with how to c‹strong›hoose the right tools, framework, environment for your project‹/strong›. I will also cover how to set up ‹strong›testing and continuous integration for your project‹/strong›.\r\n\r\n‹em›What I will cover (Zero to Hero):‹/em›\r\n‹ul›\r\n    ‹li›No code is the best code‹/li›\r\n    ‹li›Framework: DJango‹/li› \r\n    ‹li›Environment: Pipenv‹/li›\r\n    ‹li›Static Tests: Flake8, Mypy (checks types), isort(sorts imports)‹/li›\r\n    ‹li›Test Driven Development‹/li›\r\n    ‹li›Automated testing: Tox and Travis‹/li›\r\n    ‹li›Code Coverage‹/li›\r\n‹/ul›\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/0fP-Fjij97A/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=0fP-Fjij97A",
        "original_url": "https://www.youtube.com/watch?v=0fP-Fjij97A"
    },
    {
        "index": 24,
        "title": "Guide to choose right deep Learning framework for your AI project",
        "url": "https://www.youtube.com/watch?v=ZuWAaMCfL-k",
        "video_id": "ZuWAaMCfL-k",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 2585,
        "view_count": 699,
        "like_count": 13,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "Rishikesh"
        ],
        "categories": [
            "Education"
        ],
        "description": "Rishikesh\n\nhttps://2018.za.pycon.org/talks/68-guide-to-choose-right-deep-learning-framework-for-your-ai-project/\n\nAs world rolling around Artificial Intelligence (AI), demand for the AI-based product seen exponential growth, so the AI research. Deep learning algorithms and techniques are widely used for research and development of these products. Good news is that year by year Deep Learning has seen its glory in the release of many open source frameworks which ease the pain to develop and implement these algorithms.\r\n\r\nAs there are many deep learning frameworks out there and it can lead to confusion as to which one is better for your task. And choosing a deep learning framework for an AI project is as important as choosing a programming language to code product, Data science project coupled with the right deep learning framework has truly amplified the overall productivity.\r\n\r\nIn this talk, I will discuss the common points which help developers to understand which framework will be the perfect fit for solving given business challenges. Also, we will look into some of the most widely used frameworks and comparing with standard benchmarks.\r\n\r\nFollowing deep learning/machine learning frameworks will be discussed: ‹br/›\r\n1. **Tensorflow**‹br/›\r\n2. **PyTorch**‹br/›\r\n3. **Chainer** and/or **MXNET**‹br/›\r\n\r\nKey Highlight of this talk:\r\n\r\n* define key points to judge any deep learning framework.\r\n\r\n* hardware dependencies.\r\n\r\n* anatomy of widely used open source frameworks.\r\n\r\n* comparison of above-mentioned frameworks as per defined key points. \r\n\r\n\r\n**Who is the audience?**\r\n\r\nAnyone who inspired to code deep learning algorithms.\r\n\r\n**Audience Level**: Beginner to Intermediate\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/ZuWAaMCfL-k/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=ZuWAaMCfL-k",
        "original_url": "https://www.youtube.com/watch?v=ZuWAaMCfL-k"
    },
    {
        "index": 25,
        "title": "Developing good ORMs is HARD!",
        "url": "https://www.youtube.com/watch?v=MHPimjGY2As",
        "video_id": "MHPimjGY2As",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 2556,
        "view_count": 1194,
        "like_count": 28,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "NickolasGrigoriadis"
        ],
        "categories": [
            "Education"
        ],
        "description": "Nickolas Grigoriadis\n\nhttps://2018.za.pycon.org/talks/24-developing-good-orms-is-hard/\n\nAs with many people, I was looking for an ORM for `asyncio` Python.\r\n\r\nWhilst `asyncio` is a great framework for I/O bound applications, there isn't any mature, recommendable ORMs for it.  \r\nMany attempts to wrap an existing sync Python ORM (such as peewee or sqlAlchemy) by having them run in a separate thread, and then dealing with synchronising between the event loop and threads got abandoned, due to a myriad of problems, including performance, correctness and blocking.  \r\nOther ORMs were abandoned before they worked, or had so many layers of abstraction that I feared to touch it.\r\n\r\nThen I came across [Tortoise ORM](http://tortoise-orm.readthedocs.io/)  \r\nIt had a simple design. (Inspired by the Django ORM syntax)  \r\nIt actually worked when I tried it out.\r\n\r\nSo I decided to jump in, and help with development.\r\n\r\nIn this talk I'll talk about my experience of being on a development team on an ORM.  \r\nThere is a reason there are so few successful ORM projects out there.\r\n\r\nDeveloping good ORMs are **HARD**\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/MHPimjGY2As/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=MHPimjGY2As",
        "original_url": "https://www.youtube.com/watch?v=MHPimjGY2As"
    },
    {
        "index": 26,
        "title": "Two approaches to python web services",
        "url": "https://www.youtube.com/watch?v=Kdqej1C4KrI",
        "video_id": "Kdqej1C4KrI",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2584,
        "view_count": 147,
        "like_count": 2,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "KennethGoldswain",
            "MatthewFrench"
        ],
        "categories": [
            "Education"
        ],
        "description": "Kenneth Goldswain, Matthew French\n\nhttps://2018.za.pycon.org/talks/70-two-approaches-to-python-web-services/\n\nWe discuss two different approaches to building web services using Python. The first and more traditional approach uses Flask to build a web service, while the second approach builds a web service using only native Python 2.7 libraries without dependencies on any additional software.\r\n\r\nThe talk starts by discussing web services in general before moving onto the different environments our services run in, and what they will be used for. We will briefly cover the code used, but the focus will be on the reason why we need two different approaches and we will compare the risks and benefits of using these two contrasting methods. \r\n\r\nWe hope the talk will inspire people to experiment even further with web services, or at least give them insight into new ways they could use web services.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/Kdqej1C4KrI/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Kdqej1C4KrI",
        "original_url": "https://www.youtube.com/watch?v=Kdqej1C4KrI"
    },
    {
        "index": 27,
        "title": "Bayesian Analysis in Python: A Starter Kit",
        "url": "https://www.youtube.com/watch?v=-8VTcuCJF1s",
        "video_id": "-8VTcuCJF1s",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2692,
        "view_count": 7159,
        "like_count": 135,
        "comment_count": 3,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "AndrewCollier"
        ],
        "categories": [
            "Education"
        ],
        "description": "Andrew Collier\n\nhttps://2018.za.pycon.org/talks/5-bayesian-analysis-in-python-a-starter-kit/\n\nBayesian techniques present a compelling alternative to the frequentist view of statistics, providing a flexible approach to extracting a swathe of meaningful information from your data. The learning curve is somewhat steep, but the benefits of adding Bayesian techniques to your tool suite are enormous!\r\n\r\nWhat are the bare essentials that you need to know to start applying Bayesian techniques? This talk will provide an entry level discussion covering the following topics:\r\n\r\n‹ul›\r\n    ‹li›What can Bayes do for me? (A brief introduction to Bayesian methods)‹/li›\r\n    ‹li›Understanding Markov Chain Monte Carlo. (MCMC is what happens behind the scenes)‹/li›\r\n    ‹li›What is Stan? (Writing models in Stan)‹/li›\r\n    ‹li›Using Stan in Python. (The PyStan package)‹/li›\r\n‹/ul›\r\n\r\nThe talk will be peppered with useful tips for dealing with the initial challenges of using Stan with Python.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/-8VTcuCJF1s/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=-8VTcuCJF1s",
        "original_url": "https://www.youtube.com/watch?v=-8VTcuCJF1s"
    },
    {
        "index": 28,
        "title": "Sanic: Async Python (uvloop) with a familiar flask like feel.",
        "url": "https://www.youtube.com/watch?v=QtXUwEQS2pg",
        "video_id": "QtXUwEQS2pg",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2470,
        "view_count": 2995,
        "like_count": 26,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "ChristoGoosen"
        ],
        "categories": [
            "Education"
        ],
        "description": "Christo Goosen\n\nhttps://2018.za.pycon.org/talks/1-sanic-async-python-uvloop-with-a-familiar-flask-like-feel/\n\nSanic is born from an article https://magic.io/blog/uvloop-blazing-fast-python-networking/ and the premise that async/await syntax should be combined with a familiar flask like feel.\r\n\r\nThe blazing speed of uvloop is combined with a familiar flask-like API to create a framework with less blocking code and faster response times. \r\n\r\nThis talk will cover the specifics of Sanic as well as my real world exercise of building a insurance API with expensive blocking network calls to legacy (and slow) insurance APIs and services. \r\n\r\nAlso I might have forgotten to mention the web framework has a mascot from the meme for sanic:\r\n\r\n‹pre›\r\n   Sanic go.......................fast\r\n                    ▄▄▄▄▄\r\n           ▀▀▀██████▄▄▄       _______________\r\n         ▄▄▄▄▄  █████████▄  /                 \\\r\n        ▀▀▀▀█████▌ ▀▐▄ ▀▐█ |   Gotta go fast!  |\r\n      ▀▀█████▄▄ ▀██████▄██ | _________________/\r\n      ▀▄▄▄▄▄  ▀▀█▄▀█════█▀ |/\r\n           ▀▀▀▄  ▀▀███ ▀       ▄▄\r\n        ▄███▀▀██▄████████▄ ▄▀▀▀▀▀▀█▌\r\n      ██▀▄▄▄██▀▄███▀ ▀▀████      ▄██\r\n   ▄▀▀▀▄██▄▀▀▌████▒▒▒▒▒▒███     ▌▄▄▀\r\n   ▌    ▐▀████▐███▒▒▒▒▒▐██▌\r\n   ▀▄▄▄▄▀   ▀▀████▒▒▒▒▄██▀\r\n             ▀▀█████████▀\r\n           ▄▄██▀██████▀█\r\n         ▄██▀     ▀▀▀  █\r\n        ▄█             ▐▌\r\n    ▄▄▄▄█▌              ▀█▄▄▄▄▀▀▄\r\n   ▌     ▐                ▀▀▄▄▄▀\r\n    ▀▀▄▄▀\r\n‹/pre›\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/QtXUwEQS2pg/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=QtXUwEQS2pg",
        "original_url": "https://www.youtube.com/watch?v=QtXUwEQS2pg"
    },
    {
        "index": 29,
        "title": "Building Rest API with Django Rest Framework",
        "url": "https://www.youtube.com/watch?v=S6J5WH0_JRA",
        "video_id": "S6J5WH0_JRA",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2369,
        "view_count": 1087,
        "like_count": 11,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "JoseMachava"
        ],
        "categories": [
            "Education"
        ],
        "description": "Jose Machava\n\nhttps://2018.za.pycon.org/talks/57-building-rest-api-with-django-rest-framework/\n\nMost of web applications  provide an rest API to connect with other application that need to access a specific information  and django rest framework is a powerful way for django developers to create robust rest API,  I'll demonstrate the process of creating a complex API using django rest framework.\r\n\r\n\r\nThis talk is intended for beginner who have some familiar with python and want a web framework to create rest API to connect with a mobile application.\r\n\r\nContent which will be covered  are as follows:\r\n‹ul›\r\n‹li›HTTP methods‹/li›\r\n‹li›Django Models‹/li›\r\n‹li›Request & Response‹/li›\r\n‹li›Status Codes‹/li›\r\n‹li›Serializers‹/li›\r\n‹li›Viewsets and Routers‹/li›\r\n‹/ul›\r\n‹strong›Prerequisites:‹/strong›\r\n‹ol›\r\n    ‹li›Some experience with Django‹/li›\r\n    ‹li›Basic python concepts‹/li›\r\n    ‹li›Knowledge about HTTP and web development‹/li›\r\n\r\n‹/ol›\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/S6J5WH0_JRA/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=S6J5WH0_JRA",
        "original_url": "https://www.youtube.com/watch?v=S6J5WH0_JRA"
    },
    {
        "index": 30,
        "title": "My Journey into Artificial Intelligence",
        "url": "https://www.youtube.com/watch?v=e3ciEYh1-vM",
        "video_id": "e3ciEYh1-vM",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 2061,
        "view_count": 857,
        "like_count": 72,
        "comment_count": 21,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "BlessingMalumi"
        ],
        "categories": [
            "Education"
        ],
        "description": "Blessing Malumi\n\nhttps://2018.za.pycon.org/talks/56-my-journey-into-artificial-intelligence/\n\nThe buzzword in recent times has been AI, what is AI? how can I learn AI? What is the usefulness of AI? How would it impact my business? Why should I learn AI? The questions just keep coming. This talk is supposed to present in practical terms how a young African girl got her start in AI, the journey so far, where she is now, and the possibilities of a future in AI.\r\n\r\nIt will also explain in details, the resources and materials she utilized in her learning with Python being the most resourceful, it will explain python's many functionalities and tools which she has found and used, most especially in it's application to data science and artificial intelligence, projects she has worked on, of which an image classifier was one of them. She would also talk about the mistakes she made, the successes she attained, the lessons she learned and finally the BIG PICTURE of her AI dream.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/e3ciEYh1-vM/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=e3ciEYh1-vM",
        "original_url": "https://www.youtube.com/watch?v=e3ciEYh1-vM"
    },
    {
        "index": 31,
        "title": "Fast random number generation in Python and NumPy",
        "url": "https://www.youtube.com/watch?v=jWXZ07YBsPM",
        "video_id": "jWXZ07YBsPM",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181012",
        "duration": 2372,
        "view_count": 1388,
        "like_count": 9,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "BernardtDuvenhage"
        ],
        "categories": [
            "Education"
        ],
        "description": "Bernardt Duvenhage\n\nhttps://2018.za.pycon.org/talks/53-fast-random-number-generation-in-python-and-numpy/\n\nA fast Random Number Generator (RNG) is key to doing Monte Carlo simulations, efficiently initialising machine learning models, shuffling long sequences of numbers and many tasks in scientific computing. CPython and NumPy use implementations of the Mersenne Twister RNG and rejection sampling to generate random numbers in an interval. The NumPy implementation trades more samples for cheaper division by a power of two. The implementation is very efficient when the random interval is a power of two, but on average generate many more samples compared to the GNU C or Java algorithms. The Python RNG uses an algorithm similar to GNU C.\r\n\r\nA recent paper by Daniel Lemire (https://arxiv.org/abs/1805.10941) discusses an efficient division light method to generate uniform random numbers in an interval. This method is apparently used in the Go language. On 64-bit platforms there are also fast alternative RNGs that perform comparatively on statistical examinations passing tests like BigCrush. The splitmix64 (part of the standard Java API) and lehmer64 RNGs, for example, require approximately 1.5 cycles to generate 32 random bits (without using SIMD) while the 32-bit Mersenne Twister requires approximately 10 cycles per 32 bits.\r\n\r\nThis talk will discuss the inclusion of Lemire's method in NumPy as an alternative to the current rejection sampling implementation. My implementation results in a 2x - 3x improvement in the performance of generating a sequence of random numbers. Using splitmix64 or lehmer64 RNGs in NumPy instead of the Mersenne Twister results in a further 2x performance improvement.\r\n\r\nThe random module in Python does not do the rejection sampling in C like NumPy does. Much of the time to get a random number is therefore spent in the Python code. This talk will also discuss a fast random Python module that implements Lemire's method instead of the current rejection sampling, provides alternative RNGs and moves more of the code into C. \r\n\r\nI'm considering doing pull requests for both the NumPy modification and the Python fast random module and will present a detailed analysis of the proposed modifications.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/jWXZ07YBsPM/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=jWXZ07YBsPM",
        "original_url": "https://www.youtube.com/watch?v=jWXZ07YBsPM"
    },
    {
        "index": 32,
        "title": "Python as a tool to boost productivity in (electronic) product and system development.",
        "url": "https://www.youtube.com/watch?v=1gawSOnw1dI",
        "video_id": "1gawSOnw1dI",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2573,
        "view_count": 208,
        "like_count": 2,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "JohanHartman"
        ],
        "categories": [
            "Education"
        ],
        "description": "Johan Hartman\n\nhttps://2018.za.pycon.org/talks/21-python-as-a-tool-to-boost-productivity-in-electronic-product-and-system-development/\n\nThe general take away from this talk will be to motivate the use of Python not only as the implementation language to develop your application, but also to use Python to develop your own automation tools that fit your development process. By doing this, you will be able to implement faster, more accurate, have a better tested result and along the way derive many benefits that you won’t foresee when you start. \r\n\r\nAlthough my talk will speak from an embedded engineering point of view and not an IT or web development point of view, I belief the principles applies generally. Over many years and through the life cycle of many products I have evolved a development methodology that uses Python as the language of choice to develop my own tools for code generation (for ‘C’ and Python), software and firmware test automation, systems compliance testing and hardware manufacturing test automation. \r\n\r\nMy process is that I start a project by defining XML object definitions for all instances of configuration, data or communication objects. From the XML, on the embedded firmware side, I generate ‘C’ structures, enum’s and prototype function bodies to use in my coding. On the PC or server side, I generate Python data object definitions from the XML. These are imported into Python programs that are written to operate on the object definitions, giving me free reuse of all the interfacing, testing, visualization etc. code that I have developed in the past.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/1gawSOnw1dI/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=1gawSOnw1dI",
        "original_url": "https://www.youtube.com/watch?v=1gawSOnw1dI"
    },
    {
        "index": 33,
        "title": "Insight into Customer Segmentation",
        "url": "https://www.youtube.com/watch?v=KOW4ecqnTow",
        "video_id": "KOW4ecqnTow",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2238,
        "view_count": 6749,
        "like_count": 138,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "CorneliavanderWalt"
        ],
        "categories": [
            "Education"
        ],
        "description": "Cornelia van der Walt\n\nhttps://2018.za.pycon.org/talks/67-insight-into-customer-segmentation/\n\nIn retail, understanding your customer is all, and when you do not have a brick and mortar storefront to attract new shoppers, it is even more important to get insight into the array of visitors who frequent your site. You need an idea of who they are, what they want and how to attract them. This is a universal truth of all businesses and the lessons learned here could be easily applied to other industries.\r\n\r\nEnter data science and the ability to segment your customers. What is customer segmentation? What types of segmentation are there? What models could you use? How do you do it? What is it good for? Having done it a few times, first for Superbalist, then for the Spree customers during the Superbalist/Spree merger, I might have a few tricks and tips to share. \r\n\r\nThe talk will look at a high-level overview of clustering, then deep-dive into the code a bit before coming up at the end with a few use cases and conclusions. I'll discuss a few potential model algorithms we investigated, but focus mostly on the K-Means clustering model. \r\n\r\nIf you have some data science experience it would be helpful, but the talk should provide interesting information for everyone. The talk aims to leave you with a solid idea of how to build a customer segmentation model of your own. Come discover the joys of classification models with me!\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/KOW4ecqnTow/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=KOW4ecqnTow",
        "original_url": "https://www.youtube.com/watch?v=KOW4ecqnTow"
    },
    {
        "index": 34,
        "title": "Parallel Programming with (Py)OpenCL for Fun and Profit",
        "url": "https://www.youtube.com/watch?v=hqieYt9sXPU",
        "video_id": "hqieYt9sXPU",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2290,
        "view_count": 7609,
        "like_count": 153,
        "comment_count": 6,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "GordonInggs"
        ],
        "categories": [
            "Education"
        ],
        "description": "Gordon Inggs\n\nhttps://2018.za.pycon.org/talks/40-parallel-programming-with-pyopencl-for-fun-and-profit/\n\n## Overview\r\nIt's never been easier to use all manner of interesting computing devices such as multicore CPUs, GPUs and FPGAs using [OpenCL](https://www.khronos.org/opencl/), an open heterogeneous computing standard, supported by major hardware vendors: [Intel](https://software.intel.com/en-us/articles/opencl-drivers), [NVIDIA](https://developer.nvidia.com/opencl), [AMD](https://www.amd.com/en-us/solutions/professional/hpc/opencl), [ARM](https://developer.arm.com/graphics/resources/tutorials/opencl-tutorials), etc. And it's never been easier to use OpenCL via the excellent Python bindings, [PyOpenCL](https://documen.tician.de/pyopencl/).\r\n\r\nIn this talk, I will introduce the basics of the OpenCL programming and runtime APIs, using examples run in Jupyter notebooks on a variety of devices. I will also help identify the situations where it makes sense to accelerate portions of a codebase.\r\n\r\n## Audience\r\nThis talk is aimed at anyone who loves the expressiveness of Python, but has bumped into its performance limitations. I assume no background in HPC and/or heterogeneous computing, and will be using simple, yet hopefully relevant examples such as fundamental linear algebra and analysis applications.\r\n\r\nBy the end of the talk, provided it isn't a post-lunch slot, the audience should be ready to identify the hotspots in their code, and start accelerating using the CPUs, GPUs and FPGAs in their laptops and favourite public clouds such as AWS, Azure and GCE.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/hqieYt9sXPU/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=hqieYt9sXPU",
        "original_url": "https://www.youtube.com/watch?v=hqieYt9sXPU"
    },
    {
        "index": 35,
        "title": "Custom metadata plugins for Calibre: cataloguing an old paper library",
        "url": "https://www.youtube.com/watch?v=UF6HAn5-YD0",
        "video_id": "UF6HAn5-YD0",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181015",
        "duration": 1305,
        "view_count": 2324,
        "like_count": 28,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "AdriannaPińska"
        ],
        "categories": [
            "Education"
        ],
        "description": "Adrianna Pińska\n\nhttps://2018.za.pycon.org/talks/79-custom-metadata-plugins-for-calibre-cataloguing-an-old-paper-library/\n\nCalibre is a cross-platform program for managing an e-book library: organising the books, annotating them with metadata, converting them between different formats and moving them between devices. Its organisation and metadata functionality can also be used to catalogue a collection of paper books.\r\n\r\nBy default, Calibre fetches its metadata from a few large, popular online sources which focus on recently published English-language books, and often have little to no information about older editions or books in other languages. However, there are many user-created custom metadata plugins which make it possible to integrate Calibre with more specialised book databases. Calibre is written in Python, and so are the plugins!\r\n\r\nIn this talk I will give an overview of how to find resources to help you start writing your own plugin, and describe how I forked and re-wrote a plugin for downloading metadata from the Internet Speculative Fiction Database.\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/UF6HAn5-YD0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=UF6HAn5-YD0",
        "original_url": "https://www.youtube.com/watch?v=UF6HAn5-YD0"
    },
    {
        "index": 36,
        "title": "Friday Lightning Talks",
        "url": "https://www.youtube.com/watch?v=0YUbxZUaIJE",
        "video_id": "0YUbxZUaIJE",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 2354,
        "view_count": 229,
        "like_count": 6,
        "comment_count": null,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "VariousSpeakers"
        ],
        "categories": [
            "Education"
        ],
        "description": "Various Speakers\n\nhttps://2018.za.pycon.org/news/friday-lightning-talks/\n\nFriday Lightning Talks\r\n======================\r\n\r\n* Christian Christelis: \"How much architecting does your project need and when?\"\r\n* Sheena O'Connell: \"GraphQL vs REST\"\r\n* Whitney Tennant: \"The photon - what this particle has to do with building better software and living the good life.\"\r\n\r\n\r\nSee ‹a href=\"/news/lightning-talks\"›Lightning Talks‹/a› for details of how to submit a talk\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/0YUbxZUaIJE/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=0YUbxZUaIJE",
        "original_url": "https://www.youtube.com/watch?v=0YUbxZUaIJE"
    },
    {
        "index": 37,
        "title": "Machine Learning in Real Life",
        "url": "https://www.youtube.com/watch?v=YBfSfhhywsc",
        "video_id": "YBfSfhhywsc",
        "uploader": "PyCon South Africa",
        "uploader_id": "@pyconza",
        "uploader_url": "https://www.youtube.com/@pyconza",
        "upload_date": "20181013",
        "duration": 3136,
        "view_count": 2431,
        "like_count": 30,
        "comment_count": 1,
        "tags": [
            "pyconza",
            "pyconza2018",
            "python",
            "JadeAbbott"
        ],
        "categories": [
            "Education"
        ],
        "description": "Jade Abbott\n\nhttps://2018.za.pycon.org/talks/23-machine-learning-in-real-life/\n\nThanks to the openness of the machine learning community, any developer with an interest in machine learning these days, can get up a model to recognise characters or generate Trump-like tweets in a couple of hours. But what happens when we need to train a model to do a customer facing task, that we trust enough to deploy to a production system? And how do we get that model into production and maintain it once it is there? \r\n\r\nMy talk aims to share some of the struggles, trade-offs and strategies from the trenches of training and building the infrastructure for a complex deep learning model for production use.\r\n\r\nThe talk is aimed at tech leads and developers who are interested in machine learning and are working on training their own models that they'd like to deploy\n\npyconza2018\n\npython",
        "thumbnail": "https://i.ytimg.com/vi_webp/YBfSfhhywsc/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=YBfSfhhywsc",
        "original_url": "https://www.youtube.com/watch?v=YBfSfhhywsc"
    }
]