[
    {
        "index": 1,
        "title": "PyCon.DE 2018: Keynote - Peter Weibel",
        "url": "https://www.youtube.com/watch?v=Xpg2Zc9L_4I",
        "video_id": "Xpg2Zc9L_4I",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2482,
        "view_count": 770,
        "like_count": 1,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/Xpg2Zc9L_4I/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Xpg2Zc9L_4I",
        "original_url": "https://www.youtube.com/watch?v=Xpg2Zc9L_4I"
    },
    {
        "index": 2,
        "title": "PyCon.DE 2018: Keynote - Wes McKinney",
        "url": "https://www.youtube.com/watch?v=uETG3bn4kow",
        "video_id": "uETG3bn4kow",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 3236,
        "view_count": 1435,
        "like_count": 24,
        "comment_count": 2,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/uETG3bn4kow/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=uETG3bn4kow",
        "original_url": "https://www.youtube.com/watch?v=uETG3bn4kow"
    },
    {
        "index": 3,
        "title": "PyCon.DE 2018: Keynote - Emmanuelle Gouillart",
        "url": "https://www.youtube.com/watch?v=P5kQXwmAYSY",
        "video_id": "P5kQXwmAYSY",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 3538,
        "view_count": 248,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/P5kQXwmAYSY/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=P5kQXwmAYSY",
        "original_url": "https://www.youtube.com/watch?v=P5kQXwmAYSY"
    },
    {
        "index": 4,
        "title": "PyCon.DE 2018: Deep Learning With PyTorch For More Fun And Profit (Part II) - Alexander CS Hendorf",
        "url": "https://www.youtube.com/watch?v=yB1rUfPILFY",
        "video_id": "yB1rUfPILFY",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2671,
        "view_count": 364,
        "like_count": 3,
        "comment_count": null,
        "tags": [
            "PyTorch",
            "Deep Learning",
            "AI in production",
            "Style Transfer",
            "Tacotron2",
            "NLP"
        ],
        "categories": [
            "Education"
        ],
        "description": "There are all these great blog posts about Deep Learning describing all that awesome stuff. - Is it all that easy? Let's check! This is part 2 of on ongoing series of adventures in Deep Learning for fun, research and business.\n\nAlexander' professional career was always about digitalisation: starting from vinyl records in the nineties to to advanced data analytics nowadays. He's program chair of Europe's main Python conference EuroPython, one of the 25 mongoDB masters, organiser of PyConDE and a regular contributor to the tech community. He has spoken at many international conferences in Silicon Valley, New York, London, Florence or Paris. He's a partner at Königsweg (http://koenigsweg.com) consultancy for digitalisation, high-tech and data science where he consults enterprises on data matters and trains individuals in Python and AI.\n \nThis talk covers style transfer (making a picture look like painting), speech generation (like Siri or Alexa) and text generation (writing a story). In this talk describes the whole journey: A fun ride from the idea to the very end including all the struggles, failures and successes. \n\nSteps covered:\n\n- The data challenge: get the data ready\n- Have it run on your Mac with PyTorch and an eGPU\n- Creating a character-level language models with an Recurrent Neural Network\n- Creating a text generator\n- Creating artwork\n- Data challenges and solutions in the non English NLP space\n\nSlides: http://bit.ly/deep-learning-fun-profit-pyconde18\n\nAlexander on \nTwitter: https://twitter.com/hendorf\nLinked In: https://www.linkedin.com/in/hendorf/",
        "thumbnail": "https://i.ytimg.com/vi_webp/yB1rUfPILFY/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=yB1rUfPILFY",
        "original_url": "https://www.youtube.com/watch?v=yB1rUfPILFY"
    },
    {
        "index": 5,
        "title": "PyCon.DE 2018: 3D Graphics in Python with Ratcave and Pyglet - Nicholas A. Del Grosso",
        "url": "https://www.youtube.com/watch?v=Sl2SZEFWh_E",
        "video_id": "Sl2SZEFWh_E",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2508,
        "view_count": 4359,
        "like_count": 80,
        "comment_count": 3,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Python has some great graphics packages! in this talk, I'll introduce the fundamentals of 3D graphics and demonstrate how to load 3D models, created in Blender3D, into an OpenGL window using Pyglet and the Ratcave extension.",
        "thumbnail": "https://i.ytimg.com/vi_webp/Sl2SZEFWh_E/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Sl2SZEFWh_E",
        "original_url": "https://www.youtube.com/watch?v=Sl2SZEFWh_E"
    },
    {
        "index": 6,
        "title": "PyCon.DE 2018: Build Text Classification Models With FastText In Python - Kajal Puri",
        "url": "https://www.youtube.com/watch?v=Za_0tVI1YSQ",
        "video_id": "Za_0tVI1YSQ",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2576,
        "view_count": 4216,
        "like_count": 28,
        "comment_count": 3,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "FastText has been open-sourced by Facebook in 2016 and with its release, it became the fastest and most accurate library in Python for text classification and word representation. It is to be seen as a substitute for gensim package's word2vec. It includes the implementation of two extremely important methodologies in NLP i.e Continuous Bag of Words and Skip-gram model. Fasttext performs exceptionally well with supervised as well as unsupervised learning.\n\nThe tutorial will be divided in following four segments :\n\n0-10 minutes: The talk will begin with explaining the difference between word embeddings generated by word2vec, Glove, Fasttext and how FastText beats all the other libraries with better accuracy and in lesser time.\n\n10-25 minutes: The code will be shown and explained line by line for both the models (CBOW and Skip-gram) on a standard textual labeled dataset with the tips on hyper-parametric tuning to get the best possible results.\n\n25-40 minutes: How to use the pre-trained word embeddings released by FastText on various languages and where to use them. Various use cases of what kind of problems can be solved using FastText in python.\n\n40-45 minutes: For QA session.",
        "thumbnail": "https://i.ytimg.com/vi_webp/Za_0tVI1YSQ/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Za_0tVI1YSQ",
        "original_url": "https://www.youtube.com/watch?v=Za_0tVI1YSQ"
    },
    {
        "index": 7,
        "title": "PyCon.DE 2018: Suggestions From Python And Solr - Jonathan Oberländer and Patrick Schemitz",
        "url": "https://www.youtube.com/watch?v=Z17JLncewyo",
        "video_id": "Z17JLncewyo",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1816,
        "view_count": 556,
        "like_count": 11,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "When a user types a query into the search box of our price comparison website, we try to figure out what they search, and provide suggestions as they type along. What product, what brand, from which categories? Solr provides a SuggestComponent that is a good start, but in a lot of situations we need fallback strategies: what should we show to a user searching for just a brand name? Or for a singular offer we can't actually show them? What alternatives can we dig up? And behind all this backfill logic lurks that dreaded question: what amount of irrelevant garbage is worse than the horror vacui of an empty result set?",
        "thumbnail": "https://i.ytimg.com/vi_webp/Z17JLncewyo/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Z17JLncewyo",
        "original_url": "https://www.youtube.com/watch?v=Z17JLncewyo"
    },
    {
        "index": 8,
        "title": "PyCon.DE 2018: Insights Into Modern Remote Sensing Research - Felix M. Riese and Jens Leitloff",
        "url": "https://www.youtube.com/watch?v=tKRoMcBeWjQ",
        "video_id": "tKRoMcBeWjQ",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1734,
        "view_count": 2482,
        "like_count": 52,
        "comment_count": 4,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "The largest earth observation programme Copernicus (http://copernicus.eu) makes it possible to perform terrestrial observations providing data for all kinds of purposes. One important objective is to monitor the land-use and land-cover changes with the Sentinel-2 satellite mission. These satellites measure the sun reflectance on the earth surface with multispectral cameras (13 channels between 440 nm to 2190 nm). Machine learning techniques like convolutional neural networks (CNN) are able to learn the link between the satellite image (spectrum) and the ground truth (land use class). In this talk, we give an overview about the state-of-the-art land-use classification with CNNs based on an open dataset.\n\nThe EuroSAT benchmark dataset (http://madm.dfki.de/downloads) is freely provided by German Research Center for Artificial Intelligence (DFKI). It consists of 27.000 image patches for ten different land use/cover classes, e.g. industrial and residential areas, different crop and vegetation types and forests. All samples have 64 by 64 pixel dimension and include either only the RGB images or all 13 bands.\n\nWe will use different out-of-box CNNs for the Keras deep learning library (https://keras.io/). All networks are either included in Keras itself or are available from Github repositories. We will show the process of transfer learning for the RGB datasets. Furthermore, the minimal changes required to apply commonly used CNNs to multispectral data are demonstrated. Thus, the interested audience will be able to perform their own classification of remote sensing data within a very short time. Results of different network structures are visually compared. Especially the differences of transfer learning and learning from scratch are demonstrated. This also includes the amount of necessary training epochs, progress of training and validation error and visual comparison of the results of the trained networks.\n\nFinally, we give a quick overview about the current research topics including recurrent neural networks for spatio-temporal land-use classification and further applications of multi- and hyperspectral data, e.g. for the estimation of water parameters and soil characteristics. Additionally, we provide links to the code and dataset used in this talk.",
        "thumbnail": "https://i.ytimg.com/vi_webp/tKRoMcBeWjQ/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=tKRoMcBeWjQ",
        "original_url": "https://www.youtube.com/watch?v=tKRoMcBeWjQ"
    },
    {
        "index": 9,
        "title": "PyCon.DE 2018: Combining PyTorch And TensorFlow For Deep Learning - Marcel Kurovski",
        "url": "https://www.youtube.com/watch?v=vO3LB_-dQOM",
        "video_id": "vO3LB_-dQOM",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2339,
        "view_count": 930,
        "like_count": 11,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Despite the many deep learning frameworks out in the wild few have achieved widespread adoption. Two of them are TensorFlow and PyTorch. Where PyTorch relies on a dynamic computation graph TensorFlow goes for a static graph. Where TensorFlow shows greater adoption and additional useful extensions with TensorFlow Serving and TensorBoard, Pytorch proves useful trough its easy and more pythonic API.\n\nData scientists are confronted with explorative challenges, but also need to be aware of model deployment and production. Do we need to single out frameworks until we end up with the only one or is there a case for joint usage of two deep learning frameworks? Can we leverage the strengths of the frameworks for different tasks along the path from exploration to production?\n\nIn my talk, I want to present a case combining the benefits of PyTorch and TensorFlow using the first for explorative and latter for deployment tasks. Therefore, I will choose a common deep learning challenge and discuss the strengths and weaknesses of both frameworks along a demo that brings a model from development into production.",
        "thumbnail": "https://i.ytimg.com/vi_webp/vO3LB_-dQOM/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=vO3LB_-dQOM",
        "original_url": "https://www.youtube.com/watch?v=vO3LB_-dQOM"
    },
    {
        "index": 10,
        "title": "PyCon.DE 2018: Concurrency In Python Concepts, Frameworks And Best Practices - Stefan Schwarzer",
        "url": "https://www.youtube.com/watch?v=Do7JtnPh1Mg",
        "video_id": "Do7JtnPh1Mg",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2661,
        "view_count": 1679,
        "like_count": 17,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Have you run in situations where concurrent execution could speed up your Python code? Are you using a GUI toolkit?\n\nThis talk gives you the background to use concurrency in your code without shooting yourself in the foot - which is quite easy if you don't understand how concurrent execution differs from linear execution!\n\nThe presentation starts with explaining some concepts like concurrency, parallelism, resources, atomic operations, race conditions and deadlocks.\n\nThen we discuss the commonly-used approaches to concurrency: multithreading with the threading module, multiprocessing with the multiprocessing module, and event loops (which include the asyncio framework). Each of these approaches has its typical use cases, which are explained.\n\nYou can implement concurrency on a number of abstraction levels. The lowest level consists of primitives like locks, events, semaphores and so on. A higher abstraction level is using queues, typically with worker threads or processes. Even higher abstraction levels are active objects (hiding primitives or queues behind an API; this includes \"actors\" if you heard of them), the thread and process pools in concurrent.futures and the asyncio framework. Finally, you can \"outsource\" concurrency by leaving it to a message broker, which is a distinct process that receives and distributes messages.\n\nThe talk closes with some tips and best practices, mainly:\n\nDon't use concurrency if you don't have to.\n\nKeep it simple. \"Simple\" usually doesn't mean using primitives like locks, but rather using higher abstractions if you can.\n\nOperations that look atomic may not be atomic. For example, if descriptors are used, an \"attribute access\" may do arbitrarily complex things. If there's any doubt, assume an operation is not atomic.\n\nTry to hide concurrency behind an API. In particular, serialize accesses to a resource by using a single thread or process (if you use threads and processes) for this resource.\n\nDefects in concurrent code are often difficult to expose. If your code seems to work, it doesn't mean it will work on a different computer, on a complex network, under high load etc. Think about what you're doing and what could go wrong. (Of course, this applies to coding in general, but even more so to concurrent code.)",
        "thumbnail": "https://i.ytimg.com/vi_webp/Do7JtnPh1Mg/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Do7JtnPh1Mg",
        "original_url": "https://www.youtube.com/watch?v=Do7JtnPh1Mg"
    },
    {
        "index": 11,
        "title": "PyCon.DE 2018: Strongly Typed Datasets In A Weakly Typed World - Marco Neumann",
        "url": "https://www.youtube.com/watch?v=wtpQTWROPc0",
        "video_id": "wtpQTWROPc0",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1239,
        "view_count": 162,
        "like_count": 1,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "We at Blue Yonder use Pandas quite a lot during our daily data science and engineering work. This choice, together with Python as an underlying programming language gives us flexibility, a feature-rich interface, and access to a large community and ecosystem. When it comes to preserving the data and exchanging it with different software stacks, we rely on Parquet Datasets / Hive Tables. During the write process, there is a shift from a rather weakly typed world to a strongly typed one. For example, Pandas may convert integers to floats for many operations without asking, but parquet files and the schema information stored alongside them dictate very precise types. The type situation may get even more \"colorful\", when datasets are written by multiple code versions or different software solutions over time. This then results in important questions regarding type compatibility.\n\nThis talk will first represent an overview on types at different layers (like NumPy, Pandas, Arrow and Parquet) and the transition between this layers. The second part of the talk will present examples of type compatibility we have seen and why+how we think they should be handled. At the end there will be a Q+A, which can be seen as the start of a potentially longer RFC process to align different software stacks (like Hive and Dask) to handle types in a similar way.",
        "thumbnail": "https://i.ytimg.com/vi_webp/wtpQTWROPc0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=wtpQTWROPc0",
        "original_url": "https://www.youtube.com/watch?v=wtpQTWROPc0"
    },
    {
        "index": 12,
        "title": "PyCon.DE 2018: Prototyping To Tested Code - Christopher Prohm",
        "url": "https://www.youtube.com/watch?v=8fg7AkvG-Oc",
        "video_id": "8fg7AkvG-Oc",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1656,
        "view_count": 430,
        "like_count": 7,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Jupyter notebooks are a great environment to prototype solutions and explore their design. Turning these solutions into reusable components usually requires moving them out of the notebook environment into external python packages. Often, at this stage, the code is refactored and test are written.\n\nIn this talk, I will demo ipytest, a small tool to run tests inside notebooks. It supports pytest as well as the standard unittest framework. It allows to start prototypes in a notebook and to develop the tests with the code in an highly interactive environment. As the code grows, it can be transparently moved outside notebooks and transformed into reusable components. By bringing support for tests to the notebook environment, ipytest bridges the artificial gap between notebooks and reusable components.",
        "thumbnail": "https://i.ytimg.com/vi_webp/8fg7AkvG-Oc/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=8fg7AkvG-Oc",
        "original_url": "https://www.youtube.com/watch?v=8fg7AkvG-Oc"
    },
    {
        "index": 13,
        "title": "PyCon.DE 2018: Cython to speed up your Python code - Stefan Behnel",
        "url": "https://www.youtube.com/watch?v=zx0wMxuh-wk",
        "video_id": "zx0wMxuh-wk",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2857,
        "view_count": 1106,
        "like_count": 15,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Cython is not only a very fast and comfortable way to talk to native code and libraries, it is also a widely used tool for speeding up Python code. The Cython compiler translates Python code to C or C++ code, and applies many static optimisations that make Python code run visibly faster than in the interpreter. But even better, it supports static type annotations that allow direct use of C/C++ data types and functions, which the compiler uses to convert and optimise the code into fast, native C. The tight integration of all three languages, Python, C and C++, makes it possible to freely mix Python features like generators and comprehensions with C/C++ features like native data types, pointer arithmetic or manually tuned memory management in the same code.\n\nThis talk by a core developer introduces the Cython compiler by interactive code examples, and shows how you can use it to speed up your real-world Python code. You will learn how you can profile a Python module and use Cython to compile and optimise it into a fast binary extension module. All of that, without losing the ability to run it through common development tools like code checkers or coverage test tools.",
        "thumbnail": "https://i.ytimg.com/vi/zx0wMxuh-wk/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=zx0wMxuh-wk",
        "original_url": "https://www.youtube.com/watch?v=zx0wMxuh-wk"
    },
    {
        "index": 14,
        "title": "PyCon.DE 2018: Building Your Own Conversational AI With Open Source Tools - Justina Petraitytė",
        "url": "https://www.youtube.com/watch?v=vVco861PUJo",
        "video_id": "vVco861PUJo",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2612,
        "view_count": 3737,
        "like_count": 63,
        "comment_count": 7,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Conversational AI is far from being a solved problem, but you don’t need to rely on third-party APIs to build great chat and voice apps.\n\nIn this talk we will live-code a useful, engaging conversational AI bot based entirely on machine learning. We’ll be using Rasa NLU & Rasa Core, which are open source libraries for building machine learning-based chatbots and voice assistants. We will teach our system how to hold multi-turn conversations by creating some initial training data, and then refine its behaviour by interacting with the system and providing feedback. We will cover the fundamentals of conversational AI, including the most important algorithms for intent classification, entity extraction, and dialogue management.\n\nWhat will attendees learn:\n\n- fundamentals of natural language understanding and dialogue management for building intelligent assistants.\n- deep dive into the open source libraries Rasa NLU and Rasa Core.\n- open challenges.",
        "thumbnail": "https://i.ytimg.com/vi_webp/vVco861PUJo/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=vVco861PUJo",
        "original_url": "https://www.youtube.com/watch?v=vVco861PUJo"
    },
    {
        "index": 15,
        "title": "PyCon.DE 2018: Enabling The Chip Technologies Of Tomorrow: How Python Helps Us - Tim Hoffmann",
        "url": "https://www.youtube.com/watch?v=XWmJlTIJ7OA",
        "video_id": "XWmJlTIJ7OA",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1929,
        "view_count": 207,
        "like_count": 1,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Carl Zeiss SMT GmbH is the leading manufacturer of lithography optics. Our optics allow chipmakers to produce smaller, faster and more energy efficient computer chips. As we move to smaller and smaller structures, the necessary optics grow more and more complex. Customized simulations and data analytics by highly qualified technical domain experts are essential. These people are not experienced software developers. However, with Python and the right support, we can give them powerful tools to accomplish their task efficiently.\n\nPioneering Python in a larger enterprise can be challenging. At present, we use Python in selected areas of our product development and production processes. We'd like to share our challenges and solutions with using Python in a heterogeneous company environment. In particular, how can we make Python accessible to non-programmers? How do we ensure consistent development? How do we embed in the non-Python ecosystem of the company?",
        "thumbnail": "https://i.ytimg.com/vi_webp/XWmJlTIJ7OA/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=XWmJlTIJ7OA",
        "original_url": "https://www.youtube.com/watch?v=XWmJlTIJ7OA"
    },
    {
        "index": 16,
        "title": "PyCon.DE 2018: Grammar Of Graphics In Python - Malte Harder",
        "url": "https://www.youtube.com/watch?v=SNaWwk_HzK0",
        "video_id": "SNaWwk_HzK0",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1825,
        "view_count": 706,
        "like_count": 15,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "A grammar is, according to Wikipedia, the set of structural rules governing the composition of clauses, phrases, and words in any given natural language. A grammar of graphics is then the set of structural rules governing the composition of visual elements. Transforming data into visual representations using composition is quite powerful and allows to create complex visualisations with simple building blocks.\n\nWhile the ideas behind the grammar of graphics date back well into the 80s, as a Python developer it is only quite recently that we can make use of it. Altair, backed by the vega specification, is one of the few plotting libraries in Python that provide such a declarative and compositional API.\n\nIn this talk I will give an introduction to the core concepts behind the grammar of graphics as well as practical examples how to use altair API in Python to create vega plots.",
        "thumbnail": "https://i.ytimg.com/vi_webp/SNaWwk_HzK0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=SNaWwk_HzK0",
        "original_url": "https://www.youtube.com/watch?v=SNaWwk_HzK0"
    },
    {
        "index": 17,
        "title": "PyCon.DE 2018: Python Decorators: Gift Or Poison? - Anastasiia Tymoshchuk",
        "url": "https://www.youtube.com/watch?v=VEexfP68LJs",
        "video_id": "VEexfP68LJs",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1958,
        "view_count": 2335,
        "like_count": 24,
        "comment_count": 5,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Why would you ever need to use decorators in Python? Have you ever had the task when you need to use one function in few places and you really wanted to avoid of code duplicating? For example to add some logging into functions or timers, etc. Decorators in Python are super powerful with these tasks, but at the same time they are super complicated, sometimes even magical. When I started learning Python, Decorators were really like a magic: how to use them, how are they working, lots of questions. The goal is to make the things easier and clear to answer a question: to use or not to use Decorators in your project.",
        "thumbnail": "https://i.ytimg.com/vi_webp/VEexfP68LJs/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=VEexfP68LJs",
        "original_url": "https://www.youtube.com/watch?v=VEexfP68LJs"
    },
    {
        "index": 18,
        "title": "PyCon.DE 2018: Sprint Orientation - Various",
        "url": "https://www.youtube.com/watch?v=iGB8JSmeMjA",
        "video_id": "iGB8JSmeMjA",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 608,
        "view_count": 62,
        "like_count": 0,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/iGB8JSmeMjA/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=iGB8JSmeMjA",
        "original_url": "https://www.youtube.com/watch?v=iGB8JSmeMjA"
    },
    {
        "index": 19,
        "title": "PyCon.DE 2018: Bonobo, Airflow And Grafana To Visualize Your Business - Romain Dorgueil",
        "url": "https://www.youtube.com/watch?v=UUrk1K45Euw",
        "video_id": "UUrk1K45Euw",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2424,
        "view_count": 741,
        "like_count": 9,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Zero-to-one hands-on introduction to building a business dashboard using Bonobo ETL, Airflow, and a bit of Grafana (because graphs are cool). Although the opposite is better, there is no need of prior knowledge about any of those tools.\n\nAfter a short introduction about the tools, we'll go through the following topics, using the real data of a small SaaS software:\n\nPlan (What data do we need to see?)\nImplement (How do we quickly get those graphs up?)\nMonitor (Are you sure your data's still there?)\nIterate (How do we move on from there?)\nOne can expect to be able to build a similar system at the end of the talk in a few days (of course, the implementation is only a small part of this process, data is what really matters).\n\n«Metrics you watch tend to improve over time»",
        "thumbnail": "https://i.ytimg.com/vi_webp/UUrk1K45Euw/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=UUrk1K45Euw",
        "original_url": "https://www.youtube.com/watch?v=UUrk1K45Euw"
    },
    {
        "index": 20,
        "title": "PyCon.DE 2018: Python With And Without Pants - Stephan Erb",
        "url": "https://www.youtube.com/watch?v=6T8MjdWmVaQ",
        "video_id": "6T8MjdWmVaQ",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1683,
        "view_count": 1531,
        "like_count": 20,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "What is the best outfit for comfortable, but highly productive programming at home? While this is definitely an important question, this talk will focus on a topic that is slightly more controversial: monorepos and their build tools. Specifically, the talk will have a closer look at Pants (https://www.pantsbuild.org).\n\nPants is a build system for large or rapidly growing code bases. It supports all stages of a typical build ( bootstrapping, dependency resolution, compilation, linting, ...) and allows users to organize their code via targets for binaries, libraries, and tests. For Python programmers, pants is especially interesting, as it makes the manipulation and distribution of hermetically sealed Python environments painless - so called PEXes.\n\nThe talk will motivate Pants and its usage in the context of a large company-wide monorepo. It will then focus on important Python-centric features, and shortly explain how those work under the hood. The talk will conclude with a discussion of usecases for Pants outside of a monorepo, i.e. for the rest of us.",
        "thumbnail": "https://i.ytimg.com/vi_webp/6T8MjdWmVaQ/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=6T8MjdWmVaQ",
        "original_url": "https://www.youtube.com/watch?v=6T8MjdWmVaQ"
    },
    {
        "index": 21,
        "title": "PyCon.DE 2018: What's New In Python 3.7? - Stephane Wirtel",
        "url": "https://www.youtube.com/watch?v=hnjX858YhFk",
        "video_id": "hnjX858YhFk",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1808,
        "view_count": 1897,
        "like_count": 16,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Scheduled for release in mid-June after the conference, Python 3.7 is shaping up to be a feature-packed release! This talk will cover all the new features of Python 3.7, including the Data Classes and the Context Variables for the asynchronous programming with asyncio.",
        "thumbnail": "https://i.ytimg.com/vi_webp/hnjX858YhFk/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=hnjX858YhFk",
        "original_url": "https://www.youtube.com/watch?v=hnjX858YhFk"
    },
    {
        "index": 22,
        "title": "PyCon.DE 2018: Python On The Blockchain: The Ups And Downs In A Crypto Startup - Daniel And Lorb",
        "url": "https://www.youtube.com/watch?v=6y75iiTzRPc",
        "video_id": "6y75iiTzRPc",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2429,
        "view_count": 151,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "While many cryptographic components of blockchain protocols can be extremely complex, blockchain systems themselves are relatively easy to understand when viewed from a distance. To take the example of Bitcoin, users store digital currency in hardware or software wallets, and use private keys to sign and broadcast transactions. Broadcasted transactions are grouped together into a block through a cryptographic process known as mining, with miners rewarded through the collection of transaction fees and the issuance of new coins. The mined block of transactions is appended to the existing chain, and verified by a global network of nodes. This process repeats in perpetuity, with each newly added block adding to the trustedness and security of data stored on the chain.\n\nIncreased interest in and demand for cryptocurrencies has brought about a need for places where digital assets can easily be bought, sold or traded. Our platform, Bitpanda, accomplishes this with a backend written in Python, and relying heavily on Django and MySQL databases. In our presentation, we begin by providing a brief overview of how blockchains work. Following this, we describe the Python architecture that (e.g.) generates cryptocurrency wallets, builds, signs and sends transactions, and monitors blockchains for new, relevant data. Key challenges, solutions and failures encountered during the development of the system, and growth of our team, are presented.\n\nThroughout our talk, we also highlight a number of broader social implications of blockchains, and our work with them. More specifically, we describe the need for open-innovation based approaches to blockchain development, the value of open-source within the blockchain community, and the current lack of critical discourse surrounding the potential uses of blockchains as mechanisms of surveillance and control.",
        "thumbnail": "https://i.ytimg.com/vi_webp/6y75iiTzRPc/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=6y75iiTzRPc",
        "original_url": "https://www.youtube.com/watch?v=6y75iiTzRPc"
    },
    {
        "index": 23,
        "title": "PyCon.DE 2018: Keeping Your Data Secure While Learning From It - Andreas Dewes and Katharine Jarmul",
        "url": "https://www.youtube.com/watch?v=i-embbaJX_A",
        "video_id": "i-embbaJX_A",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1909,
        "view_count": 177,
        "like_count": 2,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "We will discuss anonymization and pseudonymization techniques that you can apply to your data to keep it secure and comply with the law(s) while still being able to gain useful insights from it.\n\nWhy protect data?\nPseudonymization vs. anonymization: What's the difference?\nPseudonymization: Techniques & real-world examples\nProblems and risks when pseudonymizing data\nAnonymization: Approaches & real-world examples\nProblems and risks when anyonymizing data\nTakeaways and summary\nWe will show concrete Python implementations of various techniques and use example data sets to show how applying pseudonymization and anonymization will affect our ability to do machine learning / data science.",
        "thumbnail": "https://i.ytimg.com/vi_webp/i-embbaJX_A/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=i-embbaJX_A",
        "original_url": "https://www.youtube.com/watch?v=i-embbaJX_A"
    },
    {
        "index": 24,
        "title": "PyCon.DE 2018: Put Your Data On A Map - Alex Vykaliuk",
        "url": "https://www.youtube.com/watch?v=CdgI-TUv5z0",
        "video_id": "CdgI-TUv5z0",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1013,
        "view_count": 230,
        "like_count": 4,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "When you're working with geo data I found that putting it all on a map helps a lot to see and understand it. I will go over few of the tools I use on a day to day basis that allow you to draw a map. It will include few common scenarios and examples.",
        "thumbnail": "https://i.ytimg.com/vi_webp/CdgI-TUv5z0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=CdgI-TUv5z0",
        "original_url": "https://www.youtube.com/watch?v=CdgI-TUv5z0"
    },
    {
        "index": 25,
        "title": "PyCon.DE 2018: Creating An Inclusive Corporate Culture - Yenny Cheung",
        "url": "https://www.youtube.com/watch?v=nwyiiB1NK3w",
        "video_id": "nwyiiB1NK3w",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1726,
        "view_count": 236,
        "like_count": 5,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Having a tech career as a minority is challenging. It could mean being the only one to speak against the popular opinion, or becoming more visible to get the same level of recognition. What can we do on the corporate level to make sure everyone feels welcome and retain these talents? Creating an inclusive corporate culture helps us achieve just that. This talk shares concrete steps that employees and employers can take to improve minorities in tech’s sense of belonging and engagement:\n\nTop down approach: establish an Executive Diversity Council that makes up of influential company leaders who deeply care about diversity and inclusion\nBottom up approach: get involved in a minority in engineering employee resource group\nStart mentorship programs\nForm diverse recruitment panels\nOrganize ally trainings",
        "thumbnail": "https://i.ytimg.com/vi_webp/nwyiiB1NK3w/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=nwyiiB1NK3w",
        "original_url": "https://www.youtube.com/watch?v=nwyiiB1NK3w"
    },
    {
        "index": 26,
        "title": "PyCon.DE 2018: Where The Heck Is My Memory? - Florian Jetter",
        "url": "https://www.youtube.com/watch?v=C-1XWTgFo5g",
        "video_id": "C-1XWTgFo5g",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 962,
        "view_count": 196,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Memory management is something the common Python user doesn’t need to bother with because the gory details of it are hidden deep within the interpreter itself. The garbage collector takes out the trash and we can spend our precious time bothering with more important things on our minds. Living in this encapsulated utopia is nice but sometimes it is worth it to peak behind the curtains to unleash the full power of your application. In this talk I want to show you when it is necessary to face this harsh world and convince you that it is in fact not as scary as it may seem. Using real life examples, I’m going to show you how to use the garbage collector and open source tooling to get control over the memory you might not even know you had at your disposal.",
        "thumbnail": "https://i.ytimg.com/vi_webp/C-1XWTgFo5g/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=C-1XWTgFo5g",
        "original_url": "https://www.youtube.com/watch?v=C-1XWTgFo5g"
    },
    {
        "index": 27,
        "title": "PyCon.DE 2018: Reproducibility, And Selection Bias In Machine Learning - Valerio Maggio",
        "url": "https://www.youtube.com/watch?v=MOBs6MNepDk",
        "video_id": "MOBs6MNepDk",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2070,
        "view_count": 574,
        "like_count": 10,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Reproducibility - the ability to recompute results — and replicability— the chances other experimenters will achieve a consistent result[1]- are among the main important beliefs of the scientific method.\n\nSurprisingly, these two aspects are often underestimated or not even considered when setting up scientific experimental pipelines. In this, one of the main threat to replicability is the selection bias, that is the error in choosing the individuals or groups to take part in a study. Selection bias may come in different flavours: the selection of the population of samples in the dataset (sample bias); the selection of features used by the learning models, particularly sensible in case of high dimensionality; the selection of hyper parameter best performing on specific dataset(s). If not properly considered, the selection bias may strongly affect the validity of derived conclusions, as well as the reliability of the learning model.\n\nIn this talk I will provide a solid introduction to the topics of reproducibility and selection bias, with examples taken from the biomedical research, in which reliability is paramount.\n\nFrom a more technological perspective, to date the scientific Python ecosystem still misses tools to consolidate the experimental pipelines in in research, that can be used together with Machine and Deep learning frameworks (e.g. sklearn and keras). In this talk, I will present reproducible-lern, a new Python frameworks for reproducible research to be used for machine and deep learning.\n\nDuring the talk, the main features of the framework will be presented, along with several examples, technical insights and implementation choices to be discussed with the audience.\n\nThe talk is intended for intermediate PyData researchers and practitioners. Basic prior knowledge of the main Machine Learning concepts is assumed for the first part of the talk. On the other hand, good proficiency with the Python language and with scientific python libraries (e.g. numpy, sklearn) are required for the second part.",
        "thumbnail": "https://i.ytimg.com/vi_webp/MOBs6MNepDk/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=MOBs6MNepDk",
        "original_url": "https://www.youtube.com/watch?v=MOBs6MNepDk"
    },
    {
        "index": 28,
        "title": "PyCon.DE 2018: Data Science Complexity And Solutions In Real Industrial Projects - Artur Miller",
        "url": "https://www.youtube.com/watch?v=bmtGr0LSb_Y",
        "video_id": "bmtGr0LSb_Y",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1712,
        "view_count": 216,
        "like_count": 3,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "As data scientists we usually like to apply fancy machine learning models to well-groomed datasets. Everyone working on industrial problems will eventually learn, that this does not reflect reality. The amount of time spent on modeling is small compared to data gathering, -warehousing and -cleaning. Even after training and deployment of the model, the work is not done. Continuous monitoring of the performance and input data is still necessary.\n\nIn this talk I discuss how important data handling is for successful data science projects. Each milestone, from finding the business case to continuously monitoring the performance of the solution, is addressed. This is exemplary shown on a project, with the goal of improving a productive system.",
        "thumbnail": "https://i.ytimg.com/vi_webp/bmtGr0LSb_Y/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=bmtGr0LSb_Y",
        "original_url": "https://www.youtube.com/watch?v=bmtGr0LSb_Y"
    },
    {
        "index": 29,
        "title": "PyCon.DE 2018: PyTorch As A Scientific Computing Library: Past, Present And Future - Adam Paszke",
        "url": "https://www.youtube.com/watch?v=0Y4kY6PnYfM",
        "video_id": "0Y4kY6PnYfM",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2674,
        "view_count": 2125,
        "like_count": 42,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Python is very well known for its ecosystem of mature scientific computing packages. Despite that, the rapidly rising popularity of deep learning resulted in creation of a number of new libraries, including PyTorch. Although originally they were meant to provide better support for those domain specific use cases, one can come to a conclusion, that they can actually have wider applications.\n\nIn this talk, I’ll showcase the main ideas behind PyTorch - a relatively new library focusing on usability and good integration with other Python packages. I’ll cover some interesting use cases, ranging from ones more specific to machine learning, to those more generally applicable in other scientific computing areas. I’ll also cover some recently added features, and talk a bit about our future roadmap.",
        "thumbnail": "https://i.ytimg.com/vi_webp/0Y4kY6PnYfM/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=0Y4kY6PnYfM",
        "original_url": "https://www.youtube.com/watch?v=0Y4kY6PnYfM"
    },
    {
        "index": 30,
        "title": "PyCon.DE 2018: Fulfilling Apache Arrow's Promises: Pandas On JVM Memory Without A Copy - Uwe L. Korn",
        "url": "https://www.youtube.com/watch?v=xW7IOaQvDsU",
        "video_id": "xW7IOaQvDsU",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1577,
        "view_count": 591,
        "like_count": 4,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Apache Arrow established a standard for columnar in-memory analytics to redefine the performance and interoperability of most Big Data technologies in early 2016. Since then implementations in Java, C++, Python, Glib, Ruby, Go, JavaScript and Rust have been added. Although Apache Arrow (pyarrow) is already known to many Python/Pandas users for reading Apache Parquet files, its main benefit is the cross-language interoperability. With feather and PySpark, you can already benefit from this in Python and R/Java via the filesystem or network. While they improve data sharing and remove serialization overhead, data still needs to be copied as it is passed between processes.\n\nIn the 0.23 release of Pandas, the concept of ExtensionArrays was introduced. They allow the extension of Pandas DataFrames and Series with custom, user-defined typed. The most prominent example is cyberpandas which adds an IP dtype that is backed by the appropriate representation using NumPy arrays. These ExtensionArrays are not limited to arrays backed by NumPy but can take an arbitrary storage as long as they fulfill a certain interfaces. Using Apache Arrow we can implement ExtensionArrays that are of the same dtype as the built-in types of Pandas but memory management is not tied to Pandas' internal BlockManager. On the other hand Apache Arrow has a much more wider set of efficient types that we can also expose as an ExtensionArray. These types include a native string type as well as a arbitrarily nested types such as list of … or struct of (…, …, …).\n\nTo show the real-world benefits of this, we take the example of a data pipeline that pulls data from a relational store, transforms it and then passes it into a machine learning model. A typical setup nowadays most likely involves a data lake that is queried with a JVM based query engine. The machine learning model is then normally implemented in Python using popular frameworks like CatBoost or Tensorflow.\n\nWhile sometimes these query engines provide Python clients, their performance is normally not optimized for large results sets. In the case of a machine learning model, we will do some feature transformations and possibly aggregations with the query engine but feed as many rows as possible into the model. This will lead then to result sets that have above a million rows. In contrast to the Python clients, these engines often come with efficient JDBC drivers that can cope with result sets of this size but then the conversion from Java objects to Python objects in the JVM bridge will slow things down again. In our example, we will show how to use Arrow to retrieve a large result in the JVM and then pass it on to Python without running into these bottlenecks.",
        "thumbnail": "https://i.ytimg.com/vi_webp/xW7IOaQvDsU/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=xW7IOaQvDsU",
        "original_url": "https://www.youtube.com/watch?v=xW7IOaQvDsU"
    },
    {
        "index": 31,
        "title": "PyCon.DE 2018: How To Teach Space Invaders To Your Computer - David Wölfle",
        "url": "https://www.youtube.com/watch?v=2KfyvrEn8p8",
        "video_id": "2KfyvrEn8p8",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1603,
        "view_count": 177,
        "like_count": 1,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "First things first: playing good old Atari games might be cool but why should I write a program for doing it? Well teaching a computer to play a game means teaching it to develop strategies and use foresight planning to solve a certain problem. The tools you gather while solving i.e. space invaders are the same you may use to solve any problem which requires a sequential set of decisions in order to find an optimal solution to some problem, like i.e. controlling a robot that collects garbage. Furthermore, there is a lot of scientific research on reinforcement learning that focuses on solving Atari games which makes it a good starting point, as large amounts of publications and open source code already exists.\n\nWhat to expect from this talk? At first there will be a very short introduction to reinforcement learning theory, just the very basics, common applications and some references for further reading. Next points are, how to run Atari games from inside python for a learning task (with OpenAI's gym), and where to find an algorithm for the actual learning problem. Finally it will be shown how to build it all together in a jupyter notebook and let the algorithm play the game. Et voilà that's your computer beating you in space invaders.",
        "thumbnail": "https://i.ytimg.com/vi_webp/2KfyvrEn8p8/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=2KfyvrEn8p8",
        "original_url": "https://www.youtube.com/watch?v=2KfyvrEn8p8"
    },
    {
        "index": 32,
        "title": "PyCon.DE 2018: Driving Sim And DA Of Magnetic Nanostructures Through Jupyter Notebook - Hans Fangohr",
        "url": "https://www.youtube.com/watch?v=ZrpJ_H0LCOA",
        "video_id": "ZrpJ_H0LCOA",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1392,
        "view_count": 793,
        "like_count": 16,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "We present ongoing work from a project that makes a particular computer simulation (implemented in C++ and Tk/Tcl) accessible through a Python interface, and through the Jupyter Notebook. The talk describes the motivation and current status of the project.\n\nIn more detail, the computer simulation in question is the Object Oriented Micromagnetic Modelling Framework (OOMMF) which is likely the most widely used micromagnetic simulation package. It can be driven through a graphical (Tk) user interface or through a configuration file that defines a simulation run.\n\nIn this talk, we first show a Python interface to OOMMF that allows the driving of OOMMF simulations from a Python program or interpreter prompt. This way we embed a widely used scientific code from 1990s in a general purpose programming language [1] and enable the full use of the ecosystem of scientific libraries available for Python. For example, design optimisation, specialised post-processing, and the creation of figures can all be carried out using a single script; making the work more easily reproducible.\n\nSecond, we integrate the Python interface to OOMMF into a Jupyter notebook, so that all existing benefits of using Jupyter are inherited for the use in computational micromagnetics, which is the reason we named our code Jupyter-OOMMF (JOOMMF). A JupyterHub installation of the tool reduces barriers in uptake, and all the code is on github.\n\nWe discuss the benefits of driving computer simulation and data analysis through Jupyter Notebooks.\n\nThis project is a part of the Jupyter-OOMMF (JOOMMF) activity in the OpenDreamKit project and we acknowledge financial support from Horizon 2020 European Research Infrastructures project (676541). The work is also supported by the EPSRC CDT in Next Generation Computational Modelling EP/L015382/1, and the EPSRC grants EP/M022668/1 and EP/N032128/1.\n\nFor additional context: micromagnetic modelling is a key research method in academia and industry to support development of high-capacity magnetic storage devices that are cheap, fast, and reliable, and to enable research into future alternative storage and processing technologies such as spintronics. The OOMMF modelling package has been used in over 2500 publications since 1999.\n\n[1] Beg, M., Pepper, R. A., and Fangohr, H. User interfaces for computational science: A domain specific language for OOMMF embedded in Python. AIP Advances 7, 056025 (2017), https://doi.org/10.1063/1.4977225",
        "thumbnail": "https://i.ytimg.com/vi_webp/ZrpJ_H0LCOA/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=ZrpJ_H0LCOA",
        "original_url": "https://www.youtube.com/watch?v=ZrpJ_H0LCOA"
    },
    {
        "index": 33,
        "title": "PyCon.DE 2018: Cloud Chat Bot For Lazy People - Björn Meier",
        "url": "https://www.youtube.com/watch?v=oLCy7UrD-gU",
        "video_id": "oLCy7UrD-gU",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 924,
        "view_count": 104,
        "like_count": 1,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "At work we established Slack years ago as our chat application and by now quite a percentage of communication goes through it. As a result it got much easier to contact one person or a group simultaneously. And this is good as we can share our knowledge save each other time. But it also introduced a category of questions in the chat which only require simple tedious tasks to get the answer and then post it as a response. One possibility is to educate and point others to the place where they can find the answer or what tasks they have to do. The other one is use a chat bot for this. Both ways have advantages and for the bot it is that you can import a specific type of response more easily into a conversation without first gathering the information and copy and paste it. I am a developer and service operator and one category of questions which fits this is the category of service health questions, like \"Does service X has a problem right now?\". Hence, I will use a bot to answer them. First I will show you how you can create a python bot for the Azure bot service. With it the questioner then can either directly use the bot to answer his question or you can just create the response for him without going to the service health monitoring. In this case the service health information has to be obtained from a Prometheus monitoring service and then transformed into a chat message.",
        "thumbnail": "https://i.ytimg.com/vi_webp/oLCy7UrD-gU/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=oLCy7UrD-gU",
        "original_url": "https://www.youtube.com/watch?v=oLCy7UrD-gU"
    },
    {
        "index": 34,
        "title": "PyCon.DE 2018: Salabim, Discrete Event Simulation In Python - Ruud Van Der Ham",
        "url": "https://www.youtube.com/watch?v=I74j2KtGouA",
        "video_id": "I74j2KtGouA",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 312,
        "view_count": 3213,
        "like_count": 44,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/I74j2KtGouA/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=I74j2KtGouA",
        "original_url": "https://www.youtube.com/watch?v=I74j2KtGouA"
    },
    {
        "index": 35,
        "title": "PyCon.DE 2018: MoinMoin Wiki - Thomas Waldmann",
        "url": "https://www.youtube.com/watch?v=W9eGJQoWB6A",
        "video_id": "W9eGJQoWB6A",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 160,
        "view_count": 1087,
        "like_count": 10,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/W9eGJQoWB6A/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=W9eGJQoWB6A",
        "original_url": "https://www.youtube.com/watch?v=W9eGJQoWB6A"
    },
    {
        "index": 36,
        "title": "PyCon.DE 2018: Python & Javascript = Transcrypt - Andreas Bunkahle",
        "url": "https://www.youtube.com/watch?v=gL4df19JNPU",
        "video_id": "gL4df19JNPU",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 212,
        "view_count": 2692,
        "like_count": 21,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/gL4df19JNPU/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=gL4df19JNPU",
        "original_url": "https://www.youtube.com/watch?v=gL4df19JNPU"
    },
    {
        "index": 37,
        "title": "PyCon.DE 2018: GeoPython 2019 - Martin Christen",
        "url": "https://www.youtube.com/watch?v=kxMUDnQpfy8",
        "video_id": "kxMUDnQpfy8",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 124,
        "view_count": 323,
        "like_count": 3,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/kxMUDnQpfy8/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=kxMUDnQpfy8",
        "original_url": "https://www.youtube.com/watch?v=kxMUDnQpfy8"
    },
    {
        "index": 38,
        "title": "PyCon.DE 2018: HyperLog Log - Robin Roth",
        "url": "https://www.youtube.com/watch?v=jD2d7jr7z1Q",
        "video_id": "jD2d7jr7z1Q",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 315,
        "view_count": 4091,
        "like_count": 71,
        "comment_count": 5,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/jD2d7jr7z1Q/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=jD2d7jr7z1Q",
        "original_url": "https://www.youtube.com/watch?v=jD2d7jr7z1Q"
    },
    {
        "index": 39,
        "title": "PyCon.DE 2018: Why Should You Consider Working For A Startup? - Sepideh Ebrahimi",
        "url": "https://www.youtube.com/watch?v=k0wGVq8llMU",
        "video_id": "k0wGVq8llMU",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 313,
        "view_count": 96,
        "like_count": 0,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/k0wGVq8llMU/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=k0wGVq8llMU",
        "original_url": "https://www.youtube.com/watch?v=k0wGVq8llMU"
    },
    {
        "index": 40,
        "title": "PyCon.DE 2018: Announcement: PyData MeetUp Prague - Jiri Bajer",
        "url": "https://www.youtube.com/watch?v=k4wOkZSsLv4",
        "video_id": "k4wOkZSsLv4",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 64,
        "view_count": 105,
        "like_count": 0,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/k4wOkZSsLv4/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=k4wOkZSsLv4",
        "original_url": "https://www.youtube.com/watch?v=k4wOkZSsLv4"
    },
    {
        "index": 41,
        "title": "PyCon.DE 2018: PewPew - Radomir Dopieralski",
        "url": "https://www.youtube.com/watch?v=6tAxzpBaGHw",
        "video_id": "6tAxzpBaGHw",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 317,
        "view_count": 144,
        "like_count": 5,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/6tAxzpBaGHw/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=6tAxzpBaGHw",
        "original_url": "https://www.youtube.com/watch?v=6tAxzpBaGHw"
    },
    {
        "index": 42,
        "title": "PyCon.DE 2018: Let's Play Testing - Johannes Lippmann",
        "url": "https://www.youtube.com/watch?v=Smr9xFc-jns",
        "video_id": "Smr9xFc-jns",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 273,
        "view_count": 104,
        "like_count": 5,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/Smr9xFc-jns/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Smr9xFc-jns",
        "original_url": "https://www.youtube.com/watch?v=Smr9xFc-jns"
    },
    {
        "index": 43,
        "title": "PyCon.DE 2018: Introduction And Practical Experience About Quantum Computing - Dr. Andreas Riegg",
        "url": "https://www.youtube.com/watch?v=dDPSmTGVvZE",
        "video_id": "dDPSmTGVvZE",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2581,
        "view_count": 325,
        "like_count": 3,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "As publicly announced in early 2018, Daimler AG has started cooperations with IBM and Google on Quantum Computing. When doing concrete experiments with the Quantum Computing cloud based offerings, two different Python libraries provided by IBM and Google are used. They are named QISKIT in the case of IBM and CIRQ in the case of Google. The experiments with both libraries are handled using appropriate Jupyter Notebooks. This talk gives a brief introduction on Quantum Computing, specifically on Quantum Computers based on transmon-based QBits. This is followed by an introduction of the both Python libraries that are used. Then some details about the Jupyter notebooks that are used are given. The talk will finish with some demos and an overview about the most important practical experiences with both Quantum Computing offerings.",
        "thumbnail": "https://i.ytimg.com/vi_webp/dDPSmTGVvZE/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=dDPSmTGVvZE",
        "original_url": "https://www.youtube.com/watch?v=dDPSmTGVvZE"
    },
    {
        "index": 44,
        "title": "PyCon.DE 2018: Selinon - Dynamic Distributed Task Flows - Fridolín Pokorný",
        "url": "https://www.youtube.com/watch?v=UDr9Lp_0rp0",
        "video_id": "UDr9Lp_0rp0",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2727,
        "view_count": 299,
        "like_count": 1,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Have you ever tried to define and process complex workflows for data processing? If the answer is yes, you might have struggled to find the right framework for that. You've probably came across Celery - popular task flow management for Python. Celery is great, but it does not provide enough flexibility and dynamic features needed badly in complex flows. As we discovered all the limitations, we decided to implement Selinon.\n\nHave you ever tried to define and process complex workflows for data processing? If the answer is yes, you might have struggled to find the right framework for that. You've probably came across Celery - popular task flow management for Python. Celery is great, but it does not provide enough flexibility and dynamic features needed badly in complex flows. As we discovered all the limitations, we decided to implement Selinon.\n\nSelinon enhances Celery task flow management and allows you to create and model task flows in your distributed environment that can dynamically change behavior based on computed results in your cluster, automatically resolve tasks that need to be executed in case of selective task runs, automatic tracing mechanism and many others.",
        "thumbnail": "https://i.ytimg.com/vi_webp/UDr9Lp_0rp0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=UDr9Lp_0rp0",
        "original_url": "https://www.youtube.com/watch?v=UDr9Lp_0rp0"
    },
    {
        "index": 45,
        "title": "PyCon.DE 2018: Achieving Resilient Code With Integration Tests - Alexandre Figura",
        "url": "https://www.youtube.com/watch?v=qRJ5qhblXV8",
        "video_id": "qRJ5qhblXV8",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1862,
        "view_count": 172,
        "like_count": 0,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "You are maybe like me: I never learned at school how to write tests. My teachers gave me at first a broad overview of computer history. Then, they explained me some basic design patterns. And to finish, I often had to write more or less basic programs, to validate and demonstrate my skills. Not the kind of code I would be really proud of today: the procrastinator monkey living in my head at this time was more thinking about planning my summer holidays, rather than writing Ninja code!\n\nAnd to make things worse, my studies focused on network and system engineering. Not software architecture. Funny story, because I decided to become programmer a couple of years later…\n\nWhat I realize now is that I don’t have as much time as before to learn. And in a world driven by business, where time is money, and where tradeoffs are the rule, there is rarely enough money to write both shiny new features and a complete test suite.\n\nPeople who practice Test-Driven Development know how complicated it can be to write proper tests. TDD is often discouraging at first: the learning curve is steep. But this problem also exists in the testing world in general. Because writing good tests is hard, many beginners get headaches trying to reach this goal. How to convince project managers to have more time for writing tests in these conditions…\n\nBut “le jeu en vaut la chandelle” as we say in French (\"the juice is worth the squeeze\"). Well tested applications are not only easier to maintain and extend. They also have in general a better API. That’s what we will see in this talk, by focusing on how to write integration tests. Our journey will begin with a presentation of different testing strategies. We will then jump to the practical part, using Pytest, interface testing , dependency injections and stubs, amongst many others. And because we want to add nice buzzwords on our resume after PyConDE, we will finish this talk by automating the whole with Docker Compose.",
        "thumbnail": "https://i.ytimg.com/vi_webp/qRJ5qhblXV8/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=qRJ5qhblXV8",
        "original_url": "https://www.youtube.com/watch?v=qRJ5qhblXV8"
    },
    {
        "index": 46,
        "title": "PyCon.DE 2018: Testing In Python - The Big Picture - Niklas Meinzer",
        "url": "https://www.youtube.com/watch?v=8JtLzYdXba0",
        "video_id": "8JtLzYdXba0",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1865,
        "view_count": 774,
        "like_count": 10,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Any team developing and maintaining software - be it free and open source or commercial - employs one form of software testing or another. But what are the different kinds of tests in our tool boxes? And how are they best used? In this talk we'll take a look around and try to answer these questions.\n\nFirst, we'll examine the basic concepts of testing: Everyone has probably at least heard about unit tests, but are they all you need? Performance tests can help you find out how well your product performs under load and detect bottle necks early on. Manual testing is often looked down upon, since it's not automated, but is it always a bad idea? And what even is mutation testing?\n\nWe'll also get to know a lot of the amazing testing tools from the Python ecosystem. Find out what the best test runner is (Spoiler alert: it's pytest). Learn how to make writing test more fun and less work using tools like mock, Faker and factory_boy. Measure the quality of your test suite using coverage.py.\n\nBut no tool is the right one for any situation. We'll also talk about when and how to use each of the tools, while debunking common misconceptions and demonstrating best practices.",
        "thumbnail": "https://i.ytimg.com/vi_webp/8JtLzYdXba0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=8JtLzYdXba0",
        "original_url": "https://www.youtube.com/watch?v=8JtLzYdXba0"
    },
    {
        "index": 47,
        "title": "PyCon.DE 2018: About Going Open-Source - Tim",
        "url": "https://www.youtube.com/watch?v=A_UtST302Og",
        "video_id": "A_UtST302Og",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 883,
        "view_count": 1498,
        "like_count": 14,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "I will start of talking about why \"working for free\" became an important part of the developer culture all around the world and talk about why companies should try to share as many tools as possible. I'll give some examples of tools that were open sourced and got immense traction leading to the projects growing with an intense speed. I'll try to take away the \"fear\" of open sourcing tools that cost ten of thousands of dollars to create. Then I'll describe how my journey with open source looks like and start talking about how you can get your feet into contributing to known projects. After that I will close off with some hints on doing and contributing to open source projects that worked out great for me. They will also get an impression on what opportunities will show up if they put some of their time into doing OS.\n\nThe audience can be mixed, but it's way more interesting for people that are either new to programming or have never worked with open source.\n\nIn a perfect world, some of the listeners would leave the presentation with the motivation and hard goal to start with OS as soon as possible.",
        "thumbnail": "https://i.ytimg.com/vi_webp/A_UtST302Og/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=A_UtST302Og",
        "original_url": "https://www.youtube.com/watch?v=A_UtST302Og"
    },
    {
        "index": 48,
        "title": "PyCon.DE 2018: Reticulate: R Interface To Python - Jens Bruno Wittek",
        "url": "https://www.youtube.com/watch?v=EJxQSa9lwfM",
        "video_id": "EJxQSa9lwfM",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2577,
        "view_count": 2517,
        "like_count": 25,
        "comment_count": 2,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Python and R are the preferred languages for data science. In 2018, RStudio introduced its package reticulate and clearly demonstrates that it favours to join forces. Both languages have strengths and weaknesses. Tools to combine the strengths will enable easier collaboration in projects and more possibilities to succeed. Using Python from R gives R users wider access to functions and makes it easier for Python beginners to just run scripts and being able to collaborate in Python projects. The talk will show the possibilities of reticulate: The main part starts with demonstrating the Python interpreter within R. It will show how to source Python scripts as well as install and import modules. Then it will deal with the most important types of Python objects, how they are represented in R and how to further manipulate them. Thereby, a special focus is on using Python for data science. In addition, it will be presented how Conda environments can be created and used from R. A further application will be the creation of reports with Markdown and LaTeX where R and Python can be used within one document and share objects. A last topic is about showing the possibilities for easier development in RStudio (help regarding Python functions, auto completion).",
        "thumbnail": "https://i.ytimg.com/vi_webp/EJxQSa9lwfM/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=EJxQSa9lwfM",
        "original_url": "https://www.youtube.com/watch?v=EJxQSa9lwfM"
    },
    {
        "index": 49,
        "title": "PyCon.DE 2018: IoT Using Python On Linux: Lessons Learned - Thomas Keppler and Matthias Schmidt",
        "url": "https://www.youtube.com/watch?v=M4cmKMxvYKE",
        "video_id": "M4cmKMxvYKE",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2538,
        "view_count": 308,
        "like_count": 3,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/M4cmKMxvYKE/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=M4cmKMxvYKE",
        "original_url": "https://www.youtube.com/watch?v=M4cmKMxvYKE"
    },
    {
        "index": 50,
        "title": "PyCon.DE 2018: Script, Library, Or Executable: You Can Have It All! - Luke Lee",
        "url": "https://www.youtube.com/watch?v=7jpM1Iw3OKk",
        "video_id": "7jpM1Iw3OKk",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1870,
        "view_count": 705,
        "like_count": 19,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "I will describe one possible way to achieve this using the following features:\n\n* Argparse based CLI script\n* Using Gooey to wrap CLI API for a GUI\n* Pyinstaller to package with no external dependencies\nPackage goals\nWe want to create a package layout that can support a CLI interface, an importable library, and a GUI all while sharing as much code as possible.\n\nAlthough text and graphical interfaces are very different we can provide a consistent API with careful consideration. This way users can easily use our library or either interface without starting all over again.\n\nAPI guidelines\n- Use the same terminology in each entry point (CLI/GUI)\n- Allow all the same inputs to be passed to a single functional-entry point when imported as a library\nStep 1: CLI\nFirst we will layout a single-file CLI script using argparse similar to the Unix wc tool that takes a text file and outputs the following information:\n\n1. Number of words\n2. Number of lines\n3. Rough estimate of reading time\nWe'll discuss the __name__ == __main__ Python idiom, separating the argument parsing from the main function, and why keeping as little as possible in __main__ is better for reusability.\n\nThere are several pros and cons to providing others with a single-file script. It's easy to develop and simple to read, but it requires any user to have the correct version of Python installed. It's also difficult for other developers to reuse the code in their own projects or deploy to PyPI.\n\nStep 2: Add library interface\nNext we'll take our single-file script and expand it into a basic Python package using a main folder, init.py, and a cli.py script to expose the same CLI as before.\n\nWe'll discuss how to restructure the main and parsing functions from step 1 into an public API defined by the init.py that exposes the same CLI functionality as a library.\n\nWe won't dive into setup.py at all, but there will be links and a brief description on the various tools to layout a package such as cookiecutter and setup.py.\n\nStep 3: Add Gooey interface\nThe Gooey project can easily expose a CLI as GUI with a few decorators. We'll discuss briefly how to use Gooey and some of the extra functionality it provides to create more advanced GUIs.\n\nWe'll also give a simple mental model for how it maps argparse argument types to GUI widgets.\n\nStep 4: PyInstaller\nUntil step 3 all we required of users was a working Python 3 installation. However, adding Gooey requires users to have a working Python installer, the Gooey library, and wxPython. Typically GUIs are meant for higher-level users so asking them to install all of this to benefit from our little app is too much.\n\nInstead we'll see how we run PyInstaller on our entry script to package up all our dependencies including Python itself into a simple executable. We'll briefly discuss the build and dist output folders from PyInstaller along with the ability to use it to package all sorts of complicated Python applications using Qt, Numpy, etc.\n\nEnd-users in management don't even have to know we used Python!",
        "thumbnail": "https://i.ytimg.com/vi_webp/7jpM1Iw3OKk/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=7jpM1Iw3OKk",
        "original_url": "https://www.youtube.com/watch?v=7jpM1Iw3OKk"
    },
    {
        "index": 51,
        "title": "PyCon.DE 2018: Productionizing Your ML Code Seamlessly - Lauris Jullien",
        "url": "https://www.youtube.com/watch?v=M0A8GaT5qns",
        "video_id": "M0A8GaT5qns",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1897,
        "view_count": 233,
        "like_count": 5,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Data science and Machine Learning are hot topics right now for Software Engineers and beyond. There are a lot of python tools that allow you to hack together a notebook to quickly get insight on your data, or train a model to predict or classify. Or you might have inherited some data wrangling and modeling {Jupyter/Zeppelin} notebook code from someone else, like the resident data scientist.\n\nThe code works on test data, when you run the cells in the right order (skipping cell 22), and you believe that the insight gained from this work would be a valuable game changer. But now how do you take this experimental code into production, and keep it up-to-date with a regular retraining schedule? And what do you need to do after that, to ensure that it remains reliable and brings value in the long term?\n\nThese will be the questions this talk will answer, focusing on 2 main themes: What does running an ML model in production involve? How to improve your development workflow to make the path to production easier?\n\nThis talk will draw examples from real projects at Yelp, like migrating a pandas/sklearn classification project into production with pyspark, while aiming to give advice that is not dependent on specific frameworks, or tools, and is useful for listeners from all backgrounds.",
        "thumbnail": "https://i.ytimg.com/vi_webp/M0A8GaT5qns/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=M0A8GaT5qns",
        "original_url": "https://www.youtube.com/watch?v=M0A8GaT5qns"
    },
    {
        "index": 52,
        "title": "PyCon.DE 2018: Scalable Scientific Computing Using Dask (Workshop) - Uwe L. Korn",
        "url": "https://www.youtube.com/watch?v=OhstDq8l3OM",
        "video_id": "OhstDq8l3OM",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 4618,
        "view_count": 364,
        "like_count": 3,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Pandas and NumPy are great tools to dive through data, do analysis and train machine learning models. They provide intuitive APIs and superb performance. Sadly they are both restricted to the main memory of a single machine and mostly also to a single CPU. Once our code reaches these boundaries, we can utilize Dask to scale our code to multiple CPUs or even across a cluster.\n\nDask provides high-level Array, Bag, and DataFrame implementations that mimic the NumPy, lists, and Pandas APIs but operate in parallel on data that doesn't need to fit into main memory. In the low level, Dask provides dynamic task schedulers that execute task graphs in parallel. These execution engines power the high-level collections mentioned above but can also power custom, user-defined workloads.\n\nIn the workshop, we want to show how to turn typical Pandas and NumPy code into parallel/distributed code using dask.array and dask.dataframe. We will highlight things that can easily be transformed into dask code and other things that need a bit more thought. In addition, we will show the utilities that Dask provides us to inspect the execution graphs and the behaviour of our distributed code.",
        "thumbnail": "https://i.ytimg.com/vi_webp/OhstDq8l3OM/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=OhstDq8l3OM",
        "original_url": "https://www.youtube.com/watch?v=OhstDq8l3OM"
    },
    {
        "index": 53,
        "title": "PyCon.DE 2018: How Type Annotations Make Your Code Better - Igor Davydenko",
        "url": "https://www.youtube.com/watch?v=hHxZkdDA-l0",
        "video_id": "hHxZkdDA-l0",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1218,
        "view_count": 211,
        "like_count": 1,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Type annotations still not received that amount of popularity, that should. People still finding them hard and sometimes ambiguous to use. But if you start new project in Python in 2018 you should consider using type annotations in your code and this short talk describes why.\n\nI'll go over examples, where type annotations helped my team to create less complex code, and how using type annotations changing your mind for projecting & implementing features for your project.",
        "thumbnail": "https://i.ytimg.com/vi_webp/hHxZkdDA-l0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=hHxZkdDA-l0",
        "original_url": "https://www.youtube.com/watch?v=hHxZkdDA-l0"
    },
    {
        "index": 54,
        "title": "PyCon.DE 2018: Applying CNNs For Classifying 2D Sensor Data - Matthias Peussner",
        "url": "https://www.youtube.com/watch?v=Td1iaz_ZouA",
        "video_id": "Td1iaz_ZouA",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1944,
        "view_count": 271,
        "like_count": 1,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/Td1iaz_ZouA/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Td1iaz_ZouA",
        "original_url": "https://www.youtube.com/watch?v=Td1iaz_ZouA"
    },
    {
        "index": 55,
        "title": "PyCon.DE 2018: Understanding Agent Connections Using NetworkX - Cheuk Ting Ho",
        "url": "https://www.youtube.com/watch?v=h_nYy9XEPvY",
        "video_id": "h_nYy9XEPvY",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1763,
        "view_count": 355,
        "like_count": 3,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Network analysis is getting more and more attention in Business Intelligence, people hope to get information out of the structure of an organization or a communication network. In this talk, we use the hotel room search requests from travel agents, including online public website, B2C, B2B and B2B2C, to build a relational network among them. By using this network as an example, we demonstrate how insights can be extract by studying network properties.\n\nIn the first half of the talk, we will explain how the network is built using NetworkX, an open-source python library that is designed for the creation, manipulation, and study of the structure, dynamics, and functions of complex networks. When 2 agents are making the same search at the same time , a link ( or an “edge” in network analysts terms) is made pointing form the initial searcher to the subsequent searcher. Using a list of these searches, a directed graph is built. We will also demonstrate how to pick the biggest connected component out form the graph. In the second half, with the graphs created, we show how different functions of NetworkX can be used to study the graphs. By compare the graph properties of our graph to the other popular network graphs, we can get the insight of how the network was created. Also by studying the graphs, we can understand the behavior of the agents and can even figure out which agents are acting as main hubs in the network.\n\nThis talk is for people who are interested in network analysis and would like to see how it can be used in a business case. Audiences with any level of python experience can learn some basic concept of network analysis work and how it can be applied to provide business insights.",
        "thumbnail": "https://i.ytimg.com/vi_webp/h_nYy9XEPvY/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=h_nYy9XEPvY",
        "original_url": "https://www.youtube.com/watch?v=h_nYy9XEPvY"
    },
    {
        "index": 56,
        "title": "PyCon.DE 2018: Binder - Lowering The Bar To Sharing Interactive Software - Tim Head",
        "url": "https://www.youtube.com/watch?v=TQY_fVPEWTw",
        "video_id": "TQY_fVPEWTw",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1833,
        "view_count": 75,
        "like_count": 1,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "The Binder project drastically lowers the bar to sharing and re-using software. As a user wanting to try out someone else’s work I only have to click a single link. As the author preparing a binder-ready project is much easier than having to support many different platforms and for many projects involves little additional work.\n\nIn this talk I will introduce the audience to the concepts and ideas behind the Binder project. I will showcase examples from the community to illustrate use-cases and show off the power of Binder.\n\nThree pieces of software power Binder: repo2docker, BinderHub and JupyterHub. Using an example repository I will go through the steps required to make a repository binder-ready and what happens when a user launches it. At each step I will illustrate the role that each of the three software components play and how they interact.\n\nBinder is a project created by its community. I will present pathways for getting involved with the community.\n\nTo wrap up I will highlight plans for future developments and features of Binder.",
        "thumbnail": "https://i.ytimg.com/vi_webp/TQY_fVPEWTw/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=TQY_fVPEWTw",
        "original_url": "https://www.youtube.com/watch?v=TQY_fVPEWTw"
    },
    {
        "index": 57,
        "title": "PyCon.DE 2018: Pyccel, A Fortran Static Compiler For Scientific HP Computing - Ratnani Ahmed",
        "url": "https://www.youtube.com/watch?v=79FhJgy27bU",
        "video_id": "79FhJgy27bU",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 934,
        "view_count": 902,
        "like_count": 18,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Pyccel is a new static compiler for Python that uses Fortran as backend language while enabling High-Performance Computing HPC capabilities.\n\nFortran is a computer language for scientific programming that is tailored for efficient run-time execution on a wide variety of processors. Even if the 2003 and 2008 standards added major improvements like OOP, Coarrays, Submodules, do concurrent, etc ... they are not covered by all available compilers. Moreover, the Fortran developer still suffers from the lack of meta-programming compared to C++ ones. Therefore, it is more and more difficult for applied mathematicians and computational physicists to write applications at the state of art (targeting CPUs, GPUs, MICs) while implementing complicated algorithms or numerical schemes.\n\nPyccel can be used in two cases:\n\naccelerate Python code by converting it to Fortran and calling f2py,\ngenerate portable HPC Fortran codes from a DSL using the Python syntax.\nIn order to achieve the second point, we developed an internal DSL for types and macros. The later is used to map sentences based on mpi4py, scipy.linalg.blas or lapack onto the appropriate calls in Fortran. Moreover, two parsers, for OpenMP and OpenACC, were added too, allowing for explicit parallelism through the use of pragmas.\n\nLast but not least, Pyccel is an extension of Sympy. Actually, it converts a Python code to symbolic expressions/trees, from a Full Syntax Tree (RedBaron), then annotates the new AST using types or different settings provided by the user.\n\nIn this talk, after a brief description of Pyccel, I will show different applications including Finite Elements (1d, 2d, 3d), Semi-Lagrangian schemes (4d), Kronecker linear solvers, diagnostics for 5D kinetic simulations and Machine Learning for Partial Differential Equations.",
        "thumbnail": "https://i.ytimg.com/vi_webp/79FhJgy27bU/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=79FhJgy27bU",
        "original_url": "https://www.youtube.com/watch?v=79FhJgy27bU"
    },
    {
        "index": 58,
        "title": "PyCon.DE 2018: How To Deploy ML Models As APIs Without Going Nuts - Anand Chitipothu",
        "url": "https://www.youtube.com/watch?v=zud6CTR1NLk",
        "video_id": "zud6CTR1NLk",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2448,
        "view_count": 182,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Often, the most convenient way to deploy a machine model is an API. It allows accessing it from various programming environments and also decouples the development and deployment of the models from its use.\n\nHowever, building an good API is hard. It involves many nitty-gritties and many of them need to repeated everytime an API is built. Also, it is very important to have a client library so that the API can be easily accessed. If you every plan to use it from Javascript directly, then you need to worry about cross-origin-resource-sharing etc. All things add up and building APIs for machine very tedious.\n\nIn this talk demonstrates how deploying machine learning models an APIs can be made fun by using right programming abstractions. This presents couple of opensource libraries firefly and rorolite which are built for this very purpose.",
        "thumbnail": "https://i.ytimg.com/vi_webp/zud6CTR1NLk/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=zud6CTR1NLk",
        "original_url": "https://www.youtube.com/watch?v=zud6CTR1NLk"
    },
    {
        "index": 59,
        "title": "PyCon.DE 2018: Satellite Image Segmentation Photovoltaic Potential Estimation - Johannes Oos",
        "url": "https://www.youtube.com/watch?v=SoJuk08u0DI",
        "video_id": "SoJuk08u0DI",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1561,
        "view_count": 1248,
        "like_count": 12,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "The used technologies are python based and include: MongoDB tensorflow Flask google.cloud python API\n\nA dataset of labelled satellite images is created. Several networks are trained and tested on this dataset. The network is deployed on a production server.\n\nThe results of the classification/segmentaion are used to feed python based photovotlaic simulation libaries. The output is displayed and the results (the potential) evaluated.",
        "thumbnail": "https://i.ytimg.com/vi_webp/SoJuk08u0DI/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=SoJuk08u0DI",
        "original_url": "https://www.youtube.com/watch?v=SoJuk08u0DI"
    },
    {
        "index": 60,
        "title": "PyCon.DE 2018: Quantifying Hidden Variables Using Bayesian Inference - Omer Yuksel",
        "url": "https://www.youtube.com/watch?v=HAGDgA6WAQg",
        "video_id": "HAGDgA6WAQg",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1116,
        "view_count": 208,
        "like_count": 3,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Technology-driven trading is a field with many challenges, and performance and availability of the network communication is essential to the business. To have a good understanding on the performance and availability, we monitor certain metrics - however not every interesting metric is readily available to measure. Some of these have to be inferred from the data we see in production by incorporating our own knowledge. What complicates this further is that the relationship between the hidden variables and the output data is not a deterministic one, as we are often dealing with a stochastic system.\n\nBayesian inference is a suitable way to tackle this issue - it allows encoding our knowledge as a prior distribution of the model parameters. Here we will go through real-world uses of Bayesian inference at IMC, using PyMC3 to make an estimate for the hidden metrics in the network traffic.\n\nKnowledge: No prior knowledge of PyMC3 is required. Since this is a short presentation, the talk with approach the problem and the solution at a high level instead of implementation details.",
        "thumbnail": "https://i.ytimg.com/vi_webp/HAGDgA6WAQg/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=HAGDgA6WAQg",
        "original_url": "https://www.youtube.com/watch?v=HAGDgA6WAQg"
    },
    {
        "index": 61,
        "title": "PyCon.DE 2018: Introduction To Docker For Pythonistas - Jan Wagner",
        "url": "https://www.youtube.com/watch?v=Fqq6F68SQFY",
        "video_id": "Fqq6F68SQFY",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1906,
        "view_count": 457,
        "like_count": 5,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "My Talk aims to introduce you to Docker and how it works, how you can use prebuild Images from the Docker-Hub and how you can make your own Images.\nIn more Detail, the following Points will be covered:\n\nWhat is Docker\nClassic Virtualization vs. Container Virtualization\nThe Docker-Hub / Using prebuild Images\nYou need a local MongoDB/MySQL/whatever? No Problem!\nMake your own Image a.k.a. “The Dockerfile”\nBuild and Ship your Flask-App without “But it works on my machine!” – Problems\nBuild and Ship your Data Science – Environment, reproducibility for the win!\n… The other Side of the Medal …\nMore to read and watch!",
        "thumbnail": "https://i.ytimg.com/vi_webp/Fqq6F68SQFY/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Fqq6F68SQFY",
        "original_url": "https://www.youtube.com/watch?v=Fqq6F68SQFY"
    },
    {
        "index": 62,
        "title": "PyCon.DE 2018: Python Birdies: Codegolfing For Better Understanding (And Fun) - Jonathan Oberländer",
        "url": "https://www.youtube.com/watch?v=DPKSSxtVXuY",
        "video_id": "DPKSSxtVXuY",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 822,
        "view_count": 1693,
        "like_count": 61,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Codegolfing means taking a programming task and trying to answer it with a byte-minimal correct solution. Such an answer often takes shortcuts, is horribly inefficient, and definitely violates almost 100% of PEP 8. Like any playful interaction with a subject, it can however improve your understanding of it, as well as teach you about weird interactions regarding operator precedence, lexer quirks and more.\n\nAfter going over basic definitions, I will take a small number of well-known or straightforward programming tasks and go through the act of golfing an answer together step by step.",
        "thumbnail": "https://i.ytimg.com/vi_webp/DPKSSxtVXuY/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=DPKSSxtVXuY",
        "original_url": "https://www.youtube.com/watch?v=DPKSSxtVXuY"
    },
    {
        "index": 63,
        "title": "PyCon.DE 2018: Big Data Systems Performance: The Little Shop Of Horrors - Jens Dittrich",
        "url": "https://www.youtube.com/watch?v=FLTC2N3xrug",
        "video_id": "FLTC2N3xrug",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2581,
        "view_count": 286,
        "like_count": 5,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "The confusion around terms such as like NoSQL, Big Data, Data Science, Spark, SQL, and Data Lakes often creates more fog than clarity. However, clarity about the underlying technologies is crucial to designing the best technical solution in any field relying on huge amounts of data including data science, machine learning, but also more traditional analytical systems such as data integration, data warehousing, reporting, and OLAP.\n\nIn my presentation, I will show that often at least three dimensions are cluttered and confused in discussions when it comes to data management: First, buzzwords (labels & terms like \"big data\", \"AI\", \"data lake\"); second, data design patterns (principles & best practices like: selection push-down, materialization, indexing); and Third, software platforms (concrete implementations & frameworks like: Python, DBMS, Spark, and NoSQL-systems).\n\nOnly by keeping these three dimensions apart, it is possible to create technically-sound architectures in the field of big data analytics.\n\nI will show concrete examples, which through a simple redesign and wise choice of the right tools and technologies, run thereby up to 1000 times faster. This in turn triggers tremendous savings in terms of development time, hardware costs, and maintenance effort.",
        "thumbnail": "https://i.ytimg.com/vi_webp/FLTC2N3xrug/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=FLTC2N3xrug",
        "original_url": "https://www.youtube.com/watch?v=FLTC2N3xrug"
    },
    {
        "index": 64,
        "title": "PyCon.DE 2018: ZODB: The Graph Database For PythonDevelopers - Christopher Lozinski",
        "url": "https://www.youtube.com/watch?v=tcYyiqbUdKI",
        "video_id": "tcYyiqbUdKI",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1627,
        "view_count": 918,
        "like_count": 8,
        "comment_count": 2,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "You can see the current version of the slides at https://pythonlinks.info/presentations/zodbtalk.pdf\n\nI invite you to first watch the full but slightly earlier version of the talk at PythonLinks.info/zodb\n\nAnd then read the following summary to see what else is being added to the talk.\n\nThe ZODB is a mature graph database written in Python and optimized in C. Just subclass off of class Persistent Object and Persistent Container, and your objects, graphs and applications become persistent.\n\nThe market for Graph Databases has recently exploded, as evidenced by over $200 Million invested in graph database companies. Most of the graph databases are written in Java.\n\nIf you are a Python developer, you will find much greater productivity using a graph database written in Python, than one written in statically bound Java. You cannot add or remove an attribute to an object at run-time in a statically typed language. Furthermore, the major Java databases constrain you to one of several persistent data types. Persistent Python, supported by the ZODB allows you to make any Python data structure persistent. Publishing JSON, YAML and Pickles are well supported. GraphQL is conceptually very close to the ZODB schema approach.\n\nOkay, the ZODB is interesting, but is it risky? The ZODB is mature, rock solid and well supported. The ZODB is quite heavily used in the Plone world. Just the government of Brazil has over 100 websites using the ZODB. That includes the President's office, parliament and many other governmet offices. Recently the ZODB has been reengineered. It now supports thousands of write transactions per second.\n\nThe major applications of graph databases are fraud detection, social networks and computer networks. NLP is an interesting application area.\n\nThe talk reviews the basic concepts of traversal and views on objects.\n\nIt is important to understand the basics of how objects are stored on disk. Objects are pickled. There are multiple ways to store those pickles. When using File Storage, the objects in a transaction are appended to he end of the database files. When using relstorage, a record is created with the object id, the version number, and the pickle. The talk reviews how objects are distributed across multiple Python processes. With ZEO the pickles are served across the network. Connections are encrypted. The talk also discusses how to build real-time (chat and iOT) applications using the MQTT message broker with the ZODB.\n\nPerformance, scalability, and number of objects, are all discussed. Comparisons are made to traditional relational databases.\n\nThe ZODB Demo makes it very easy to start building your own applications on top of the ZODB. You can start by customizing the TreeLeaf, TreeBranch and TreeRoot classes and their templates. You get CRUD for free.\n\nThe demo includes traditional relational CRUD, Create, Read, Update, and Delete. But it also includes the extended graph CRUD. Rename a Leaf or Branch. Cut and paste leaves or branches, copy and paste leaves or branches. View and restore historic versions are demonstrated.\n\nOf course the real reason to use a graph database is to improve the user experience. A basic concept in human factors is to limit lists to 7 items. That is why librarians use hierarchy. The Panama Papers journalists said a graph database was more intuitive. Have you ever selected your country from a list of 150 countries. Much better to use a hierarchical list. Have you ever used a Google map with thousands of pins. Much better to have one page for each city.\n\nAnd of course the most important reason for using a graph database is not what the software does, but how it changes how we humans think about our problems, and how we make decisions. Graph databases enable a different approach to distributing applications across the network. They encourage a different approach to managing the git development process. They enable a different set of decisions to be made.\n\nBy the end of this talk, readers should have a much better appreciation for the rich but little known and under appreciated ZODB ecosystem.",
        "thumbnail": "https://i.ytimg.com/vi_webp/tcYyiqbUdKI/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=tcYyiqbUdKI",
        "original_url": "https://www.youtube.com/watch?v=tcYyiqbUdKI"
    },
    {
        "index": 65,
        "title": "PyCon.DE 2018: Interactive Visualization Of Traffic Data Using Bokeh - Dr. Patrik Hlobil",
        "url": "https://www.youtube.com/watch?v=GOE__moR0eo",
        "video_id": "GOE__moR0eo",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1812,
        "view_count": 2019,
        "like_count": 29,
        "comment_count": 5,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "This talk covers the creation of highly interactive and dynamic visualization (as HTML) using Python, that can still be opened with any modern browser. Using real-world examples we will show our usual workflow for processing and creating visualizations using Bokeh. The following topics will be covered:\n\nQuick Introduction into Transport Modelling\nPerforming GIS Data Analysis and Processing with GeoPandas, Pandas and Dask\nPlotting Points, Lines and Polygons on Geographic Maps using Bokeh\nHow to use Javascript-Callbacks to make the plot interactive and dynamic, but still exportable to static HTML\nVisualizing huge amounts of data on a map with DataShader",
        "thumbnail": "https://i.ytimg.com/vi_webp/GOE__moR0eo/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=GOE__moR0eo",
        "original_url": "https://www.youtube.com/watch?v=GOE__moR0eo"
    },
    {
        "index": 66,
        "title": "PyCon.DE 2018: Advanced Analytics Today - Martin Schütz",
        "url": "https://www.youtube.com/watch?v=SXaZYSZk6Bg",
        "video_id": "SXaZYSZk6Bg",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2377,
        "view_count": 97,
        "like_count": 0,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "The times when a single statistician in companies created analytical models and put them into production in person as a whole, have long been a thing of the past. Today, our customers are facing important challenges: the interaction of SAS data scientists and open source programmers in solving a technical problem and the orderly and regulated transfer of analytical models to production. The talk will show how SAS 'analytical platform covers the entire spectrum, from modeling through different types of users to the direct operationalization of models.",
        "thumbnail": "https://i.ytimg.com/vi_webp/SXaZYSZk6Bg/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=SXaZYSZk6Bg",
        "original_url": "https://www.youtube.com/watch?v=SXaZYSZk6Bg"
    },
    {
        "index": 67,
        "title": "PyCon.DE 2018: Processing Geodata Using Python - Martin Christen",
        "url": "https://www.youtube.com/watch?v=49QwoR2aG74",
        "video_id": "49QwoR2aG74",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1723,
        "view_count": 605,
        "like_count": 8,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "There is a large amount of Python modules available suitable for spatial data processing. In this talk, it is shown how to analyze, manipulate and visualize geospatial data by using open source modules. The following modules will be introduced:\n\nShapely - Manipulation and analysis of geometric objects\nFiona - The pythonic way to handle vector data\nrasterio - The pythonic way to handle raster data\npyproj - transforming spatial reference systems\nGeoPandas - Geospatial analysis\nFolium - Creating maps",
        "thumbnail": "https://i.ytimg.com/vi_webp/49QwoR2aG74/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=49QwoR2aG74",
        "original_url": "https://www.youtube.com/watch?v=49QwoR2aG74"
    },
    {
        "index": 68,
        "title": "PyCon.DE 2018: Stretchy - NoSQL Database Behind REST API - Artur Scholz",
        "url": "https://www.youtube.com/watch?v=FzXejIzMQ30",
        "video_id": "FzXejIzMQ30",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 970,
        "view_count": 170,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Stretchy is built as a microservice that provides a simple and intuitive REST API with a NoSQL database as backend. No need for database migrations or upfront schema design. The basic CRUD (create, read, update, delete) operations are available for getting data in and out from the database.\n\nStretchy is free and open source software built with Python 3, using Flask web framework. It currently uses MongoDB as its backend database. Since it is interfaced through the REST API however, Stretchy is technology agnostic and developers can create bindings to other databases, including SQL databases.\n\nThis presentation reviews the reasons for creating Stretchy, its current applications, an short tutorial on how to use it, and tips on how to deploy it.",
        "thumbnail": "https://i.ytimg.com/vi_webp/FzXejIzMQ30/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=FzXejIzMQ30",
        "original_url": "https://www.youtube.com/watch?v=FzXejIzMQ30"
    },
    {
        "index": 69,
        "title": "PyCon.DE 2018: Observe All Your Applications - Christoph Heer",
        "url": "https://www.youtube.com/watch?v=F6-nvgnlr9Y",
        "video_id": "F6-nvgnlr9Y",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1708,
        "view_count": 331,
        "like_count": 7,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "You just deployed your new version of an application or micro-service; how do you know everything works as expected? You run your comprehensive test suite to verify functional correctness for known scenarios and performance tests before deploying, but does your application really work at the moment or is it just responding with error messages to all incoming requests?\n\nI’m part of the team that runs a huge infrastructure for the SAP HANA development. This infrastructure is vital for nearly all development & testing activities of SAP HANA. As this infrastructure is powered by multiple in-house developed applications, we immediately want to know if an application starts to fail and we need to be able to quickly diagnose what caused the failure.\n\nThis talk will give you an overview how we monitor our full stack from the 2000 physical machines up to the 10,000 parallel running Python application processes, micro-service instances and batch processing jobs. It includes a review about the used tools, bad and good examples of instrumentation in Python code, the resulting visualisation and an outlook on upcoming improvements.",
        "thumbnail": "https://i.ytimg.com/vi_webp/F6-nvgnlr9Y/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=F6-nvgnlr9Y",
        "original_url": "https://www.youtube.com/watch?v=F6-nvgnlr9Y"
    },
    {
        "index": 70,
        "title": "PyCon.DE 2018: Solving Data Science Probs With A Jupyter Notebook And SAP HANA's Libs - F. Gottfried",
        "url": "https://www.youtube.com/watch?v=iHCxCgjbmW8",
        "video_id": "iHCxCgjbmW8",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1750,
        "view_count": 440,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Companies store their data in databases with highly restricted access regulations. The latest regulatorily changes enforces the need to work on the datasets in this controlled environment without created additional external copies. However Data Scientists prefer to work with tools they are most familiar like Python, R and Jupyter Notebooks using to a large amount of open-source packages (numpy, matplotlib, pandas, ..). SAP HANA provides highly optimized in-database machine learning libraries. In this talk we will present how a Data Scientist can work in an environment he/she is most familiar with and access the data stored in SAP HANA using SAP HANA machine learning libraries with a scikit-learn type interface. Data will remain in the database and will be exposed as dataframes (similar to Pandas dataframes). We will explain the software architecture and present a complete end-to-end use case by using a Jupyter Notebook.",
        "thumbnail": "https://i.ytimg.com/vi_webp/iHCxCgjbmW8/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=iHCxCgjbmW8",
        "original_url": "https://www.youtube.com/watch?v=iHCxCgjbmW8"
    },
    {
        "index": 71,
        "title": "PyCon.DE 2018: Microservices From The Trenches: How We Deliver Sofas Across Europe - Christian Barra",
        "url": "https://www.youtube.com/watch?v=9hu95HDngO0",
        "video_id": "9hu95HDngO0",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1083,
        "view_count": 88,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "At made.com we use micro-services written in Python to power our entire backend system and deliver an incredible amount of orders each week. During this presentation I will explain what are micro-services and compare them to monolith applications. By analysing what are the differences between micro-services and monolith applications I will show why you need them and for which situations they are extremely useful. I will also talk about what you need on different levels regarding infrastructure, knowledge and experience to get the most out of a micro-services architecture. The last part of the presentation is dedicated to the drawbacks of running a micro-services architecture and sharing some solutions. I will conclude sharing some useful resources about micro services and taking some questions.\"",
        "thumbnail": "https://i.ytimg.com/vi_webp/9hu95HDngO0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=9hu95HDngO0",
        "original_url": "https://www.youtube.com/watch?v=9hu95HDngO0"
    },
    {
        "index": 72,
        "title": "PyCon.DE 2018: Python And PostgreSQL - Stephane Wirtel",
        "url": "https://www.youtube.com/watch?v=D_08fKBYfdY",
        "video_id": "D_08fKBYfdY",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1893,
        "view_count": 602,
        "like_count": 7,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/D_08fKBYfdY/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=D_08fKBYfdY",
        "original_url": "https://www.youtube.com/watch?v=D_08fKBYfdY"
    },
    {
        "index": 73,
        "title": "PyCon.DE 2018: Developing Ecommerce Platform With Django Oscar - Alexander Gaevsky",
        "url": "https://www.youtube.com/watch?v=7b8r1eioNPY",
        "video_id": "7b8r1eioNPY",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2201,
        "view_count": 5770,
        "like_count": 65,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Modern technologies has changed the way how we buy and sell in the Internet nowadays. Thus, we also constantly evolve the way how we build projects to sell and buy goods using our technologies of choice - Python and Django. Ease of customization and flexibility made Oscar application of my choice for building custom ecommerce platforms on top of Django, allowing to satisfy client requirements without necessity of implementing solution from scratch, since Oscar have ready-made applications for basket, checkout, shipping etc, available for the further tweak and refinement.\n\nI’ve been using and contributing to Django Oscar since 2015, designed and supported various ecommerce projects in different fields (food, accessories, shoes) and sizes during this time. In this talk I’m going to share some of the experience and conclusions about building complex ecommerce platform using Django, and eventually, Django Oscar.",
        "thumbnail": "https://i.ytimg.com/vi_webp/7b8r1eioNPY/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=7b8r1eioNPY",
        "original_url": "https://www.youtube.com/watch?v=7b8r1eioNPY"
    },
    {
        "index": 74,
        "title": "PyCon.DE 2018: Your First NLP Project: Peaks And Pitfalls Of Unstructured Data - Anna Widiger",
        "url": "https://www.youtube.com/watch?v=bf2hISLgK84",
        "video_id": "bf2hISLgK84",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2138,
        "view_count": 377,
        "like_count": 7,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Natural Language Processing improves the quality of your text data for future analysis and increases the accuracy of your machine learning model. It’s important to know what goes into the bag of words and what are some potential do's and don'ts of text pre-processing. Which text normalization steps are necessary and which ones are “nice-to-have”? Why is classic NLP still relevant in the age of Deep Learning? What metrics can be used to compare word frequencies and what can machine learning algorithms do with those numbers? This NLP talk provides answers to these questions and more! You'll see three examples of NLP pipelines using spaCy: sentiment analysis and emoji in tweets, named entity recognition in Yelp reviews, and multilingual topic modeling for news articles.",
        "thumbnail": "https://i.ytimg.com/vi_webp/bf2hISLgK84/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=bf2hISLgK84",
        "original_url": "https://www.youtube.com/watch?v=bf2hISLgK84"
    },
    {
        "index": 75,
        "title": "PyCon.DE 2018: Germany's Next Topic Model - Thomas Mayer",
        "url": "https://www.youtube.com/watch?v=sI7VpFNiy_I",
        "video_id": "sI7VpFNiy_I",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2025,
        "view_count": 836,
        "like_count": 10,
        "comment_count": 2,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Identifying topic models for user generated content like hotel reviews turns out to be difficult with the standard approach of LDA (Latent Dirichlet Allocation; Blei et al., 2003). Hotel review texts usually don't differ as much in the topics that are covered as is typical with other genres such as Wikipedia or newsgroup articles where there is commonly only a very small set of topics present in each document.\n\nTo this end, we developed our own approach to topic modeling that is especially tailored to non-edited texts like hotel reviews. The approach can be divided into three major steps. First, using the concept of second-order cooccurrences we define a contextual similarity score that enables us to identify words that are similar with respect to certain topics. This score allows us to build up a topic network where nodes are words and edges the contextual similarity between the words. With the help of algorithms from graph theory, like the Infomap algorithm (Rosvall and Bergstrom, 2008), we are able to detect clusters of highly connected words that can be identified as topics in our review texts. In a further step, we use these clusters and the respective words to get a topic similarity score for each word in the network. In other words, we transform a hard clustering of words into topics into a probability score of how likely a certain word belongs to a given topic/cluster.\n\nThe presentation is structured as follows:\n\n- short overview of existing topic modeling approaches\n- shortcomings of these approaches with respect to our domain (hotel review texts)\n- explaining the contextual similarity score and its relationship to word embeddings\n- topic modeling step through community detection\n- turning the hard clustering into a fuzzy topic model\n\nReferences: David M. Blei, Andrew Y. Ng, Michael I. Jordan: Latent dirichlet allocation. In: Journal of Machine Learning Research, Jg. 3 (2003), S. 993–1022, ISSN 1532-4435 M. Rosvall and C. T. Bergstrom, Maps of information flow reveal community structure in complex networks, PNAS 105, 1118 (2008) http://dx.doi.org/10.1073/pnas.0706851105, http://arxiv.org/abs/0707.0609",
        "thumbnail": "https://i.ytimg.com/vi_webp/sI7VpFNiy_I/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=sI7VpFNiy_I",
        "original_url": "https://www.youtube.com/watch?v=sI7VpFNiy_I"
    },
    {
        "index": 76,
        "title": "PyCon.DE 2018: The Role Of Domain Specific Languages And Language Design In ML - Mattia Ferrini",
        "url": "https://www.youtube.com/watch?v=omcObOxAEdU",
        "video_id": "omcObOxAEdU",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1903,
        "view_count": 254,
        "like_count": 2,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "What programming language do you use to develop Machine Learning (ML) and Artificial Intelligence (AI) systems? This is one of the most frequently asked question about my work. The short answer: a mix of Scala, Python and F# The long answer: DSLs are a hot topic and play a crucial role in many of the tasks Machine Learning (ML) and Artificial Intelligence (AI) systems need to tackle. Expertise in DSLs is mission critical in ML and AI systems.",
        "thumbnail": "https://i.ytimg.com/vi_webp/omcObOxAEdU/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=omcObOxAEdU",
        "original_url": "https://www.youtube.com/watch?v=omcObOxAEdU"
    },
    {
        "index": 77,
        "title": "PyCon.DE 2018: Building Semi-supervised Classifiers When Labeled Data Is Unavailable - H. Niemeyer",
        "url": "https://www.youtube.com/watch?v=0efyjq5rWS4",
        "video_id": "0efyjq5rWS4",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 2793,
        "view_count": 5025,
        "like_count": 96,
        "comment_count": 3,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "In many situations large datasets are available but unfortunately labeling is expensive and time consuming. Active Learning is a concept for building classifiers by letting the algorithm choose the training data it uses. This achieves greater accuracy than just labeling a random subset of the available dataset.\n\nThe active learning algorithm selects some unlabeled data instances which are then labeled by a human annotator. Given this information a classifier is trained and new instances for the human annotator to label are selected. This iterative process tries to label as few instances as possible while achieving high classification accuracy.\n\nIn this talk I will give a general overview of the core concepts and techniques of active learning like algorithms for selecting the queries and convergence criteria.",
        "thumbnail": "https://i.ytimg.com/vi_webp/0efyjq5rWS4/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=0efyjq5rWS4",
        "original_url": "https://www.youtube.com/watch?v=0efyjq5rWS4"
    },
    {
        "index": 78,
        "title": "PyCon.DE 2018: A Day Has Only 24±1 Hours: Import Pytz - Miroslav Šedivý",
        "url": "https://www.youtube.com/watch?v=IRGKlwkio0Y",
        "video_id": "IRGKlwkio0Y",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1522,
        "view_count": 458,
        "like_count": 5,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "On the last Sunday of October “we get one more hour of sleep” but may spend much more time debugging code dealing with the timezones, daylight saving time shifts and datetime stuff in general.\n\nWe'll look at a few pitfalls you may encounter when working with datetimes in Python. We'll discover the pytz module and explain why pytz.all_timezones contains over 500 individual timezones. We'll also find the reason why pytz is not part of the standard Python, why it gets updated so often and why even that won't solve all your problems.",
        "thumbnail": "https://i.ytimg.com/vi_webp/IRGKlwkio0Y/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=IRGKlwkio0Y",
        "original_url": "https://www.youtube.com/watch?v=IRGKlwkio0Y"
    },
    {
        "index": 79,
        "title": "PyCon.DE 2018: Python Dependency Management - Patrick Muehlbauer",
        "url": "https://www.youtube.com/watch?v=pA4XriRWVxQ",
        "video_id": "pA4XriRWVxQ",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 1560,
        "view_count": 2843,
        "like_count": 39,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "For a long time there were pip and virtualenv which were used together with requirements.txt files to manage Python dependencies. Nowadays there are various other tools that help you improve the workflow.\n\nWe will have a look at popular projects like\n\n- pip-compile\n- hatch\n- poetry\n- Pipenv\n\nAfter the talk you will be able to decide for yourself which approach suits your usecases best and don't have to rely on rants postet on reddit.",
        "thumbnail": "https://i.ytimg.com/vi_webp/pA4XriRWVxQ/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=pA4XriRWVxQ",
        "original_url": "https://www.youtube.com/watch?v=pA4XriRWVxQ"
    },
    {
        "index": 80,
        "title": "PyCon.DE 2018: Distributed Hyperparameter Search With Sklearn And Kubernetes - Jakob Karalus",
        "url": "https://www.youtube.com/watch?v=blUc9w3QLuA",
        "video_id": "blUc9w3QLuA",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 950,
        "view_count": 197,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "While sklearn provides a good interface to do hyperparameter search on large & complex model (pipelines), doing these can take up a lot of time. The traditional way usually includes one beefy machine and a lot of waiting. In other cases, people tend to “manually” schedule parameter ranges between nodes, but that can also be problematic since these won't talk to each other. Kubernetes itself is currently the most prominent scheduler and shines at distributing task, but is a pretty complex system in itself.\n\nIn this talk, I will show how you can harness the scheduling of kubernetes for distributing hyperparameter search with sklearn onto a cluster of nodes. This can be achieved quite easily and with just a few changes to the original code, so the Data Scientist won't be bothered by complex kubernetes internals.",
        "thumbnail": "https://i.ytimg.com/vi_webp/blUc9w3QLuA/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=blUc9w3QLuA",
        "original_url": "https://www.youtube.com/watch?v=blUc9w3QLuA"
    },
    {
        "index": 81,
        "title": "PyCon.DE 2018 LT: Decrypting SSL With Python/Tshark - Johannes Frank",
        "url": "https://www.youtube.com/watch?v=F5DSt6YMib8",
        "video_id": "F5DSt6YMib8",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 213,
        "view_count": 1117,
        "like_count": 7,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/F5DSt6YMib8/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=F5DSt6YMib8",
        "original_url": "https://www.youtube.com/watch?v=F5DSt6YMib8"
    },
    {
        "index": 82,
        "title": "PyCon.DE 2018 LT: Python Is Slow, Right? - Stefan Nordhausen",
        "url": "https://www.youtube.com/watch?v=a579bDZl6o0",
        "video_id": "a579bDZl6o0",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 265,
        "view_count": 877,
        "like_count": 30,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/a579bDZl6o0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=a579bDZl6o0",
        "original_url": "https://www.youtube.com/watch?v=a579bDZl6o0"
    },
    {
        "index": 83,
        "title": "PyCon.DE 2018 LT: Repository Line Length Analysis - Peer Wagner",
        "url": "https://www.youtube.com/watch?v=_O59xhabEHA",
        "video_id": "_O59xhabEHA",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 255,
        "view_count": 94,
        "like_count": 0,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/_O59xhabEHA/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=_O59xhabEHA",
        "original_url": "https://www.youtube.com/watch?v=_O59xhabEHA"
    },
    {
        "index": 84,
        "title": "PyCon.DE 2018 LT: Prophet Fon Time Series: Do You Use It? - Gregory Wallace",
        "url": "https://www.youtube.com/watch?v=s9wolo6Xa1c",
        "video_id": "s9wolo6Xa1c",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 159,
        "view_count": 227,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/s9wolo6Xa1c/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=s9wolo6Xa1c",
        "original_url": "https://www.youtube.com/watch?v=s9wolo6Xa1c"
    },
    {
        "index": 85,
        "title": "PyCon.DE 2018 LT: The Best Python Videos - PythonLinks.info",
        "url": "https://www.youtube.com/watch?v=-qyIPWdaaAI",
        "video_id": "-qyIPWdaaAI",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 255,
        "view_count": 138,
        "like_count": 1,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/-qyIPWdaaAI/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=-qyIPWdaaAI",
        "original_url": "https://www.youtube.com/watch?v=-qyIPWdaaAI"
    },
    {
        "index": 86,
        "title": "PyCon.DE 2018 LT: Jupyter Notebook Best Practices",
        "url": "https://www.youtube.com/watch?v=Zrnr5-0Inns",
        "video_id": "Zrnr5-0Inns",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 325,
        "view_count": 2852,
        "like_count": 50,
        "comment_count": 3,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/Zrnr5-0Inns/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=Zrnr5-0Inns",
        "original_url": "https://www.youtube.com/watch?v=Zrnr5-0Inns"
    },
    {
        "index": 87,
        "title": "PyCon.DE 2018 LT: Python VR With RatCAVE - Nicholas Del Grosso",
        "url": "https://www.youtube.com/watch?v=so7bKzmPTIs",
        "video_id": "so7bKzmPTIs",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 169,
        "view_count": 1182,
        "like_count": 15,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/so7bKzmPTIs/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=so7bKzmPTIs",
        "original_url": "https://www.youtube.com/watch?v=so7bKzmPTIs"
    },
    {
        "index": 88,
        "title": "PyCon.DE 2018 LT: xtensor-python - The Fast, Universal, C++ ndarray - Wolf Vollprecht",
        "url": "https://www.youtube.com/watch?v=HbPBKqctDbw",
        "video_id": "HbPBKqctDbw",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 308,
        "view_count": 497,
        "like_count": 13,
        "comment_count": 1,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/HbPBKqctDbw/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=HbPBKqctDbw",
        "original_url": "https://www.youtube.com/watch?v=HbPBKqctDbw"
    },
    {
        "index": 89,
        "title": "PyCon.DE 2018 LT: PyComic Con - Alexander CS Hendorf",
        "url": "https://www.youtube.com/watch?v=y4SqSUJPUWA",
        "video_id": "y4SqSUJPUWA",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 154,
        "view_count": 68,
        "like_count": 0,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/y4SqSUJPUWA/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=y4SqSUJPUWA",
        "original_url": "https://www.youtube.com/watch?v=y4SqSUJPUWA"
    },
    {
        "index": 90,
        "title": "PyCon.DE 2018 LT: PyData Frankfurt - Alexander Bohn",
        "url": "https://www.youtube.com/watch?v=9to0C7J5m0Y",
        "video_id": "9to0C7J5m0Y",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 93,
        "view_count": 39,
        "like_count": 0,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/9to0C7J5m0Y/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=9to0C7J5m0Y",
        "original_url": "https://www.youtube.com/watch?v=9to0C7J5m0Y"
    },
    {
        "index": 91,
        "title": "PyCon.DE 2018 LT: Python Is For Everybody - Nick",
        "url": "https://www.youtube.com/watch?v=w4LKTNtr-fg",
        "video_id": "w4LKTNtr-fg",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 347,
        "view_count": 341,
        "like_count": 13,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/w4LKTNtr-fg/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=w4LKTNtr-fg",
        "original_url": "https://www.youtube.com/watch?v=w4LKTNtr-fg"
    },
    {
        "index": 92,
        "title": "PyCon.DE 2018 LT: Python AWS Dataclasses - Benjamin Weigel",
        "url": "https://www.youtube.com/watch?v=9hzD3GGZZE0",
        "video_id": "9hzD3GGZZE0",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 175,
        "view_count": 124,
        "like_count": 3,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/9hzD3GGZZE0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=9hzD3GGZZE0",
        "original_url": "https://www.youtube.com/watch?v=9hzD3GGZZE0"
    },
    {
        "index": 93,
        "title": "PyCon.DE 2018 LT: Hacktoberfest And You Can Have Pythin In Your Language - Cheuk",
        "url": "https://www.youtube.com/watch?v=oXlb4VG6nuc",
        "video_id": "oXlb4VG6nuc",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 176,
        "view_count": 27,
        "like_count": 0,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/oXlb4VG6nuc/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=oXlb4VG6nuc",
        "original_url": "https://www.youtube.com/watch?v=oXlb4VG6nuc"
    },
    {
        "index": 94,
        "title": "PyCon.DE 2018 LT: PyLadies - Jessica Greene and PyLadies Berlin",
        "url": "https://www.youtube.com/watch?v=SVf3KbROu8k",
        "video_id": "SVf3KbROu8k",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 234,
        "view_count": 175,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/SVf3KbROu8k/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=SVf3KbROu8k",
        "original_url": "https://www.youtube.com/watch?v=SVf3KbROu8k"
    },
    {
        "index": 95,
        "title": "PyCon.DE 2018 LT: Python On iOS - Ruud Van Der Ham",
        "url": "https://www.youtube.com/watch?v=htMH_b-Ofw0",
        "video_id": "htMH_b-Ofw0",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 174,
        "view_count": 133,
        "like_count": 1,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/htMH_b-Ofw0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=htMH_b-Ofw0",
        "original_url": "https://www.youtube.com/watch?v=htMH_b-Ofw0"
    },
    {
        "index": 96,
        "title": "PyCon.DE 2018 LT: Analyzing Twitter Data - Fabian Gebhart",
        "url": "https://www.youtube.com/watch?v=izjBxmmwgPw",
        "video_id": "izjBxmmwgPw",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 298,
        "view_count": 80,
        "like_count": 3,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/izjBxmmwgPw/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=izjBxmmwgPw",
        "original_url": "https://www.youtube.com/watch?v=izjBxmmwgPw"
    },
    {
        "index": 97,
        "title": "PyCon.DE 2018: Thunderbolt And Lightning Aren't Really Frightening Me - Jens Dittrich",
        "url": "https://www.youtube.com/watch?v=o0Uzd9asw_k",
        "video_id": "o0Uzd9asw_k",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 189,
        "view_count": 46,
        "like_count": 0,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/o0Uzd9asw_k/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=o0Uzd9asw_k",
        "original_url": "https://www.youtube.com/watch?v=o0Uzd9asw_k"
    },
    {
        "index": 98,
        "title": "PyCon.DE 2018: Closing Session - Pycon.DE Crew",
        "url": "https://www.youtube.com/watch?v=hBRzB6mwiZs",
        "video_id": "hBRzB6mwiZs",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 761,
        "view_count": 53,
        "like_count": 0,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/hBRzB6mwiZs/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=hBRzB6mwiZs",
        "original_url": "https://www.youtube.com/watch?v=hBRzB6mwiZs"
    },
    {
        "index": 99,
        "title": "PyCon.DE 2018 LT: PyRant - Valerio Maggio",
        "url": "https://www.youtube.com/watch?v=TVip0fYUEzA",
        "video_id": "TVip0fYUEzA",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 333,
        "view_count": 102,
        "like_count": 3,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/TVip0fYUEzA/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=TVip0fYUEzA",
        "original_url": "https://www.youtube.com/watch?v=TVip0fYUEzA"
    },
    {
        "index": 100,
        "title": "PyCon.DE 2018 LT: Generate Company Names With Neural Networks - Alexander Engelhardt",
        "url": "https://www.youtube.com/watch?v=1w3Q3CEldG0",
        "video_id": "1w3Q3CEldG0",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 303,
        "view_count": 754,
        "like_count": 14,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/1w3Q3CEldG0/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=1w3Q3CEldG0",
        "original_url": "https://www.youtube.com/watch?v=1w3Q3CEldG0"
    },
    {
        "index": 101,
        "title": "PyCon.DE 2018 LT: OCA: The Home Of One Of The Biggest Python OS Projects - Joe",
        "url": "https://www.youtube.com/watch?v=kNHtsMglQCw",
        "video_id": "kNHtsMglQCw",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 309,
        "view_count": 48,
        "like_count": 0,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/kNHtsMglQCw/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=kNHtsMglQCw",
        "original_url": "https://www.youtube.com/watch?v=kNHtsMglQCw"
    },
    {
        "index": 102,
        "title": "PyCon.DE 2018 LT: Let Me Take A Quick Look Into The Data - Sofia",
        "url": "https://www.youtube.com/watch?v=YZQpQAjd7Dw",
        "video_id": "YZQpQAjd7Dw",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 172,
        "view_count": 81,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/YZQpQAjd7Dw/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=YZQpQAjd7Dw",
        "original_url": "https://www.youtube.com/watch?v=YZQpQAjd7Dw"
    },
    {
        "index": 103,
        "title": "PyCon.DE 2018 LT: Let Me Just Explain Gravity - Peer Wagner",
        "url": "https://www.youtube.com/watch?v=ylKf5ZyExh8",
        "video_id": "ylKf5ZyExh8",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 213,
        "view_count": 95,
        "like_count": 0,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/ylKf5ZyExh8/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=ylKf5ZyExh8",
        "original_url": "https://www.youtube.com/watch?v=ylKf5ZyExh8"
    },
    {
        "index": 104,
        "title": "PyCon.DE 2018: Pizza - Christian Barra",
        "url": "https://www.youtube.com/watch?v=qzU5CRsoTTc",
        "video_id": "qzU5CRsoTTc",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 83,
        "view_count": 90,
        "like_count": 1,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/qzU5CRsoTTc/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=qzU5CRsoTTc",
        "original_url": "https://www.youtube.com/watch?v=qzU5CRsoTTc"
    },
    {
        "index": 105,
        "title": "PyCon.DE 2018: Notebooks As Scripts - Tim Head",
        "url": "https://www.youtube.com/watch?v=fEQKDUvB-Ro",
        "video_id": "fEQKDUvB-Ro",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 291,
        "view_count": 100,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/fEQKDUvB-Ro/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=fEQKDUvB-Ro",
        "original_url": "https://www.youtube.com/watch?v=fEQKDUvB-Ro"
    },
    {
        "index": 106,
        "title": "PyCon.DE 2018: ESA Summer Of Code In Space & Open Source Cubesat Workshop - Arthur",
        "url": "https://www.youtube.com/watch?v=FfXEXAQKUDw",
        "video_id": "FfXEXAQKUDw",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181105",
        "duration": 232,
        "view_count": 187,
        "like_count": 2,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi_webp/FfXEXAQKUDw/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=FfXEXAQKUDw",
        "original_url": "https://www.youtube.com/watch?v=FfXEXAQKUDw"
    },
    {
        "index": 107,
        "title": "PyCon.DE 2018: Building Your Own Data Science Platform With Python & Docker - Joshua Görner",
        "url": "https://www.youtube.com/watch?v=bl1XSZy11vQ",
        "video_id": "bl1XSZy11vQ",
        "uploader": "PyCon DE",
        "uploader_id": "@PyConDE",
        "uploader_url": "https://www.youtube.com/@PyConDE",
        "upload_date": "20181112",
        "duration": 2372,
        "view_count": 9815,
        "like_count": 289,
        "comment_count": null,
        "tags": [],
        "categories": [
            "Education"
        ],
        "description": "Interactive notebooks like Jupyter have become more and more popular in the recent past and build the core of many data scientist's workplace. Being accessed via web browser they allow scientists to easily structure their work by combining code and documentation.\n\nYet notebooks often lead to isolated and disposable analysis artefacts. Keeping the computation inside those notebooks does not allow for convenient concurrent model training, model exposure or scheduled model retraining.\n\nThose issues can be addressed by taking advantage of recent developments in the discipline of software engineering. Over the past years containerization became the technology of choice for crafting and deploying applications. Building a data science platform that allows for easy access (via notebooks), flexibility and reproducibility (via containerization) combines the best of both worlds and addresses Data Scientist's hidden needs.",
        "thumbnail": "https://i.ytimg.com/vi_webp/bl1XSZy11vQ/maxresdefault.webp",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "public",
        "webpage_url": "https://www.youtube.com/watch?v=bl1XSZy11vQ",
        "original_url": "https://www.youtube.com/watch?v=bl1XSZy11vQ"
    }
]