[
    {
        "index": 1,
        "title": "Ben Fagan &  Mikhail Medvedev: Building an expression parser in Python",
        "url": "https://www.youtube.com/watch?v=K3lu_HHObao",
        "video_id": "K3lu_HHObao",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241204",
        "duration": 1114,
        "view_count": 23,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Expression parsing involves analysing a string of characters to identify it's structure and meaning. This talk will cover what goes into (literally) seeing if 1 + 1 = 2.\n\nAmong the topics covered will be:\n- Options for parsing and execution of the resulting expression.\n- Understanding grammar using Lark, a Python parsing library where we define grammar rules and parse based on these.\n- What else Lark can do and how it can integrate with other tools. Lark can handle a wide variety of structures, making it ideal for more advance topics such as language interpreters.\n- Practical use cases for parsers like this, such as in data validation.",
        "thumbnail": "https://i.ytimg.com/vi/K3lu_HHObao/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=K3lu_HHObao",
        "original_url": "https://www.youtube.com/watch?v=K3lu_HHObao"
    },
    {
        "index": 2,
        "title": "Will Rogers: Cluid Housing: The evolution of a custom Python package in a complex data migration.",
        "url": "https://www.youtube.com/watch?v=5R3bGcfo2sU",
        "video_id": "5R3bGcfo2sU",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241204",
        "duration": 1861,
        "view_count": 11,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Clúid Housing is an award-winning, not-for-profit housing body providing over 11,000 affordable, high-quality homes to people in housing need. Recently Cluid's Data Engineering team played a big role in a complex data migration to a new Housing Management System in dynamics365.\n\nPython was a big part of this journey. Some simple custom classes evolved into a package that glued our migration together, all in one codebase. We'd like to share our experience, how it helped with collaboration and enabled us to iterate towards success. We'll cover:\n• A summary of the project including the data involved.\n• The constraints that directed us towards Python.\n• Using Pytest and Docker to test locally, without data!\n• The overall architecture of our solution including SQL server, Azure Synapse Analytics and Data Factory.\n• Simplifying SQL using custom dependencies.\n• The benefits of iteration!",
        "thumbnail": "https://i.ytimg.com/vi/5R3bGcfo2sU/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=5R3bGcfo2sU",
        "original_url": "https://www.youtube.com/watch?v=5R3bGcfo2sU"
    },
    {
        "index": 3,
        "title": "Dmitry Sorokin: End-to-end Machine Learning with open-source",
        "url": "https://www.youtube.com/watch?v=OiYFrrqPgns",
        "video_id": "OiYFrrqPgns",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241204",
        "duration": 1524,
        "view_count": 17,
        "like_count": 3,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "MLOps results from applying DevOps practices to ML and AI code. But getting started is hard, because there are hundreds of different overlapping libraries and frameworks, and you still have to stich them together!\n\nIn this talk we will guide you through building robust ML pipelines that cover every stage, from data ingestion to model deployment and monitoring. You will learn how you can write maintainable pipelines with Kedro, efficiently manage ML features with Feast feature store, orchestrate complex workflows using Airflow, and ensure reproducibility and tracking with MLFlow.\n\nOutline:\n1. What is MLOps? (5 minutes)\n2. Maintainable pipelines with Kedro (5 minutes)\n3. Feature stores with Feast (5 minutes)\n4. Experiment tracking with MLflow (5 minutes)\n5. Orchestration with Airflow (5 minutes)\n6. Conclusion (5 minutes)\n\nJoin us to learn how combining these open-source tools can transform your ML workflow into a streamlined, scalable, and maintainable MLOps ecosystem!",
        "thumbnail": "https://i.ytimg.com/vi/OiYFrrqPgns/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=OiYFrrqPgns",
        "original_url": "https://www.youtube.com/watch?v=OiYFrrqPgns"
    },
    {
        "index": 4,
        "title": "John Gill: Exploring the Milky Way with astropy, matplotlib and Gaia",
        "url": "https://www.youtube.com/watch?v=654X2twP0is",
        "video_id": "654X2twP0is",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241204",
        "duration": 1659,
        "view_count": 9,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "We are living at an incredible time for astronomy.\n\nSpace based telescopes are providing large amounts of wonderful open data.\n\npython is central to the complex data processing and analysis that is happening through huge collaborations.\n\nThe talk will focus on two personal python projects.\n\nThe first, blume, is a general toolkit I used to help me working with matplotlib. It actually began it's life here in Dublin some 20 years ago, and was part of my introduction to matplotlib.\n\nThe second is gotu, a project I started to help me explore the ideas in Professor Colin Rourke's book, The Geometry Of The Universe. It mostly consists of tools to visualise data with matplotlib and it uses blume.\n\nThree modules from gotu will be covered:\n\ngotu.jwst: a tool to download and view jwst data.\n\ngotu.gaia: a tool that downloads a subset of Gaia data and uses it to visualise the Milky Way's rotation curve: how the velocity of stars vary as you move out from the centre of the Milky Way.\n\ngotu.spiral: how the Sciama Principle and de Sitter Space can explain what we are seeing.",
        "thumbnail": "https://i.ytimg.com/vi/654X2twP0is/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=654X2twP0is",
        "original_url": "https://www.youtube.com/watch?v=654X2twP0is"
    },
    {
        "index": 5,
        "title": "Cosmin Marian Paduraru: Unlocking Visual Intelligence: Exploring Computer Vision with Python",
        "url": "https://www.youtube.com/watch?v=V4NzAENQj0Y",
        "video_id": "V4NzAENQj0Y",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241204",
        "duration": 1374,
        "view_count": 48,
        "like_count": 2,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Join me on a thrilling exploration of computer vision with Python. I've crafted innovative solutions like a bottle cap detection app and game objects identifier, employing advanced techniques such as SIFT and Hough Transform Circles. Let's delve into the captivating realm of image processing and Python wizardry, uncovering the secrets to building intelligent visual recognition systems together.\nDespite not working directly in computer vision roles, my passion for the field has been unwavering. I've dedicated my spare time to exploring its possibilities, diving into additional projects and even tackling assignments during my university years.",
        "thumbnail": "https://i.ytimg.com/vi/V4NzAENQj0Y/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=V4NzAENQj0Y",
        "original_url": "https://www.youtube.com/watch?v=V4NzAENQj0Y"
    },
    {
        "index": 6,
        "title": "Alistair Lynn: Exceptionally Tricky: Good errors in bad situations",
        "url": "https://www.youtube.com/watch?v=2ziiIu_Xl2o",
        "video_id": "2ziiIu_Xl2o",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241204",
        "duration": 1813,
        "view_count": 6,
        "like_count": 1,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "We often pay a lot more attention to how code works when things go well than how it works when things don't. It's very easy to have the error case be an afterthought, but bad errors can be a huge problem when you're on the receiving end.\n\nIn this talk I'll go through what makes good and bad errors, how to be kind to the people using your code (which may include you, some months down the line), and go through some worked examples.\n\nWe'll talk a bit about good and bad errors in major libraries, in the Python standard library, and even make a reference to Rust because the speaker knows the value of keyword stuffing in talk descriptions.\n\nWe'll be covering the full range from the importance of empathy to the structure of traceback frames.",
        "thumbnail": "https://i.ytimg.com/vi/2ziiIu_Xl2o/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=2ziiIu_Xl2o",
        "original_url": "https://www.youtube.com/watch?v=2ziiIu_Xl2o"
    },
    {
        "index": 7,
        "title": "John Curry: How to not Screw Up a Python Based Product Startup",
        "url": "https://www.youtube.com/watch?v=AW8ECG6cZKU",
        "video_id": "AW8ECG6cZKU",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241204",
        "duration": 2024,
        "view_count": 5,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "I've given talks before about how I set up a pretty successful AI consultancy called Last Mile AI. But you know what’s even more fun? Talking about the failures! In fact this one should be more fun for you than me.\nAs Peter Thiel wisely noted, most failures are over-determined, so it’s tough to pinpoint the main culprit. Still, some patterns do emerge. And yes, I may have been involved in a few... on *rare* occasions.\n\nSince this is a Python conference, we’ll focus on technical blunders—design, implementation, the whole mess. But we’ll touch on business mistakes too because… IT’S ALL CONNECTED!\n\nHere are the \"highlights\"—or should I say, lowlights:\n- Why deploying even moderately large AI models is a nightmare (spoiler: they're total drama queens).\n- How machine learning performance never quite translates into production (and no, more representative data isn’t always the magic fix despite what the textbooks say).\n- How premature abstraction—like an overuse of metaclasses—can wreck your dev cadence faster than spilling coffee on your keyboard.\n- How serverless moves logic from code to infra, where there are no safety nets (debugging in the cloud? Digital haystack. Needle? Gone.).\n- Why frontend dev seems easy to us Python folks but absolutely isn’t (spoiler: users!).\n- How DevOps can swallow 50% of your dev budget if you blink. Cloud? It’s already taken the other 50%.\n- How algorithmic thinking beats yet another framework.\n- How Agile theatre kills your cadence faster than a daily stand-up.\n- And more, if your stomach can handle it! (Sorry, antacids not provided.)\n\nBut we won’t just dwell on the pain. We'll also dive into solutions—like the ones that make things worse (hint: more microservices!) and the ones that actually work (hint: meet CDK, your new best friend).\n\nAfter this talk, you’ll either build a better startup product with Python or sprint towards a peaceful life of agriculture or pottery. Either way, you’ll be better off, making this talk absolutely unmissable.",
        "thumbnail": "https://i.ytimg.com/vi/AW8ECG6cZKU/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=AW8ECG6cZKU",
        "original_url": "https://www.youtube.com/watch?v=AW8ECG6cZKU"
    },
    {
        "index": 8,
        "title": "Mykalin Jones, Ellen Corbett: Creating a Substring Search Tool for the Irish Language",
        "url": "https://www.youtube.com/watch?v=FEP5L3hhkks",
        "video_id": "FEP5L3hhkks",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241205",
        "duration": 2184,
        "view_count": 7,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Taking the ‘-Deoir’ out of ‘Taighdeoir’: \nAs a result of a modern wave of revival efforts both at home and abroad, the Irish language has a number of comprehensive and up-to-date online learning tools, databases, and dictionaries. However, there was no way for Irish learners or users to search for specific substrings, despite their importance in Irish to denote number (singular or plural), gender, case, and noun declension (how a noun is conjugated or pluralised).\n\nThis talk will discuss the process of creating an application in Python to remedy this problem. We will present our solution, Míreadóir, a search tool for Irish-language substrings. It is hoped that this tool will benefit language teachers and learners, and every-day Irish users. With substrings also encompassing suffixes, it is also possible that this tool could act as a rhyming dictionary or support in creative writing. The talk will consider the collaboration between an Irish-language translator and scholar, and a data scientist and Irish-language learner; the implications of machine learning on language learning and translation; and offer a beginner-friendly discussion on web scraping, string processing, and creating a bilingual front-end for a data science project.",
        "thumbnail": "https://i.ytimg.com/vi/FEP5L3hhkks/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=FEP5L3hhkks",
        "original_url": "https://www.youtube.com/watch?v=FEP5L3hhkks"
    },
    {
        "index": 9,
        "title": "Build a Powerful Autonomous Assistant with AI - Mark Smith",
        "url": "https://www.youtube.com/watch?v=RgBVyGms95U",
        "video_id": "RgBVyGms95U",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241208",
        "duration": 1876,
        "view_count": 5,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Build a Powerful Autonomous Assistant with AI - Mark Smith\nRoom 2 Session 05\nMany of the latest LLMs now have the ability to use tools - functions you can write that the LLM can call if it needs more data, say from web search, or to execute a task, like sending an email. When combined with the ability to look up data from a vector database using unstructured inputs, that gives you inputs, outputs, memory, and a brain - everything I need to build a smart butler to make my life easier!\n\nI'll go through each of these systems to explain how they work, and then I'll put them together using the POLM stack (that's Python, OpenAI, LlamaIndex, & MongoDB).\n\nIf I have time, I'll also talk about some of the other things LLMs can do (like writing and executing code) that could be useful for an AI agent.\n\nIf everything goes to plan, I'll show you a system that can schedule tasks, tell me interesting things that are happening,\nand generally make me look like someone who know's what they're doing on a daily basis. Let's hope I don't accidentally unleash an unrestrained digital robot upon the Internet.",
        "thumbnail": "https://i.ytimg.com/vi/RgBVyGms95U/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=RgBVyGms95U",
        "original_url": "https://www.youtube.com/watch?v=RgBVyGms95U"
    },
    {
        "index": 10,
        "title": "Build a RAG to Brag About - Natan Mish",
        "url": "https://www.youtube.com/watch?v=8MMAWYWtwfA",
        "video_id": "8MMAWYWtwfA",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241207",
        "duration": 1699,
        "view_count": 4,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Build a RAG to Brag About - Natan Mish\nPyCon Ireland 2024\nRoom 2 Session 02\nAbstract:\nIn this talk, we will explore advanced techniques for enhancing Retrieval-Augmented Generation (RAG) applications. Designed for an audience with prior knowledge in Python, this session will delve into innovative methods to improve the efficiency, accuracy, and explainability of RAG systems. We will demonstrate using an example use-case and use open source tools such as ChromaDB vector database, the LangChain package and popular industry LLM providers such as OpenAI. Attendees will gain insights into cutting-edge practices such as Context Enrichment Techniques, Intelligent Reranking, Dynamic Chunk Sizing, Semantic Chunking, Explainable Retrieval, Ensemble Retrieval, and Knowledge Graph Integration.\n\nLearning Objectives:\n- Understand advanced techniques to improve RAG applications\n- Learn practical implementation strategies for each technique\n- Gain insights into the benefits and challenges of these methods\n\nTarget Audience: This talk is aimed at developers, data scientists, and researchers with a background in Python who are looking to dive deeper into the world of RAGs and LLMs for common use cases.\n\nDescription:\nWith the rapid adoption of LLMs across industries, the RAG framework has emerged as a powerful tool for building applications like customer support chatbots, virtual assistants, and search engines. By augmenting LLMs with external knowledge, RAG can significantly enhance performance and accuracy. However, developing a robust, reliable, and secure RAG application is challenging due to hurdles like unmet requirements, subpar performance, and cost constraints. This talk will equip you with the essential skills to build a RAG application you can be proud of.\nWe'll delve into various aspects of the RAG application lifecycle to optimize performance and reliability. From dynamically and semantically splitting long documents into smaller chunks to employing intelligent reranking and multi-source document retrieval, we'll explore practical techniques to improve search efficiency. To enhance user trust and understanding, we'll incorporate explainable AI methods. Finally, we'll demonstrate how to enrich prompt context with external information and knowledge graphs for more comprehensive and informative responses.\n\nOutline:\n\nIntroduction (5 minutes)\nContext Enrichment Techniques (4 minutes)\nIntelligent Reranking (4 minutes)\nDynamic Chunk Sizing (3 minutes)\nSemantic Chunking (3 minutes)\nExplainable Retrieval (3 minutes)\nEnsemble Retrieval (2 minutes)\nKnowledge Graph Integration (2 minutes)\nConclusion (2 minutes)\nQ&A (5 minutes)",
        "thumbnail": "https://i.ytimg.com/vi/8MMAWYWtwfA/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=8MMAWYWtwfA",
        "original_url": "https://www.youtube.com/watch?v=8MMAWYWtwfA"
    },
    {
        "index": 11,
        "title": "Python machine learning for understanding Irish accents in English - Peter Nolan",
        "url": "https://www.youtube.com/watch?v=8dNnQCEU8_0",
        "video_id": "8dNnQCEU8_0",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241207",
        "duration": 1689,
        "view_count": 18,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "How the Irish Speak English: Python machine learning for understanding Irish accents in English - Peter Nolan\nRoom 2 session 1 \nPyCon Ireland 2024\nUsing a canonical dataset of Irish people speaking English at locations all over the island, my research project is the first attempt to classify voice samples by the speaker's location using machine learning tools. Using logistic regression and deep learning models, I achieve significant accuracy (greater than 85%, greater than AUC  90%) in classification. Based on this, I propose a country-wide, crowd-sourced effort to gather voice samples to use for further research along these lines.",
        "thumbnail": "https://i.ytimg.com/vi/8dNnQCEU8_0/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=8dNnQCEU8_0",
        "original_url": "https://www.youtube.com/watch?v=8dNnQCEU8_0"
    },
    {
        "index": 12,
        "title": "Shekhar Koirala: Parallel Python: Embracing the Future with Sub-Interpreters and Free Threading",
        "url": "https://www.youtube.com/watch?v=9Tmzh5DY2-Y",
        "video_id": "9Tmzh5DY2-Y",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241204",
        "duration": 1679,
        "view_count": 7,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "We will start by examining the new per-interpreter GIL introduced in Python 3.12, which allows sub-interpreters to run Python code concurrently. We'll explore the enhancements in Python 3.13, which include support for sub-interpreters in the standard library, making parallel execution more accessible. Additionally, we will discuss the revolutionary NoGIL compile option, paving the way for Python threads to run truly in parallel, potentially becoming the default in the future.\n\nThe talk will cover the traditional multiprocessing approach, comparing it with the newer methods of sub-interpreters and free-threading. We will assess the pros and cons of each approach, considering their complexities and suitability for various types of problems, whether CPU/IO bound.\n\nThread safety remains a crucial aspect of parallel programming. We will address common pitfalls such as race conditions and provide practical solutions using synchronization primitives to ensure thread-safe code.\n\nLastly, we will explore a real-world application combining sub-interpreters and free-threading in a multi-worker, multi-thread ASGI web server, benchmarking its performance against traditional web server architectures.",
        "thumbnail": "https://i.ytimg.com/vi/9Tmzh5DY2-Y/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=9Tmzh5DY2-Y",
        "original_url": "https://www.youtube.com/watch?v=9Tmzh5DY2-Y"
    },
    {
        "index": 13,
        "title": "Scalable AI multi-agent collaboration with Langchain, Langgraph, Crew.AI, and RAG-Mihai Criveti",
        "url": "https://www.youtube.com/watch?v=lhKhQ80hYKk",
        "video_id": "lhKhQ80hYKk",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241207",
        "duration": 1873,
        "view_count": 6,
        "like_count": 2,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Building Scalable AI multi-agent collaboration with Langchain, Langgraph, Crew.AI, and RAG- Mihai Criveti\nRoom 2 Session 03\n\nA deep dive on multi-agent collaboration, ReAct Prompting and advanced LLM Techniques. Design and building safe, trusted GenAI application using multi-agent collaboration. Understanding how popular Agentic frameworks work, and can be combined: Langchain, Langgraph, Autogen, AutoGPT, Crew.AI and more.\n\nAgent orchestration using popular open source language models, model serving and function calling. Including Agentic Retrieval Augmented Generation with Vector Databases or Internet search results in your applications.\n\nText-to-sql, code generation techniques, and safe execution of AI Generated Code.",
        "thumbnail": "https://i.ytimg.com/vi/lhKhQ80hYKk/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=lhKhQ80hYKk",
        "original_url": "https://www.youtube.com/watch?v=lhKhQ80hYKk"
    },
    {
        "index": 14,
        "title": "Securing the Supply Chain  - Tom Doyle",
        "url": "https://www.youtube.com/watch?v=n7kr28HkrQ0",
        "video_id": "n7kr28HkrQ0",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241208",
        "duration": 1490,
        "view_count": 6,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "PyCon Ireland 2024\nRoom 2 Session 04\nSecuring the Supply Chain  - Tom Doyle\nFrom deliberate malicious changes in open source libraries to typo squatting on well known packages. How can we protect our software and our end users and ensure our supply chain is secure. This talk is about the risk management of a supply chain and techniques to limit the exposure of malicious changes in the supply chain.",
        "thumbnail": "https://i.ytimg.com/vi/n7kr28HkrQ0/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=n7kr28HkrQ0",
        "original_url": "https://www.youtube.com/watch?v=n7kr28HkrQ0"
    },
    {
        "index": 15,
        "title": "Dom Weldon: Who does Python trust, and why?",
        "url": "https://www.youtube.com/watch?v=nD27_o-ULVo",
        "video_id": "nD27_o-ULVo",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241204",
        "duration": 1976,
        "view_count": 3,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "We all know how important it is to make sure that you see the \"secure\" padlock icon when paying for something online. It's simple, easy to understand, and automatic.\n\nIs your code the same? How would you start to make sure it is? Let’s dive into those questions in this talk.\n\nFirst off, the basics: security is based on trust, but trust must be verified. This is especially true in the design of 'zero-trust' networks. Knowing who your code trusts, and how you verify that trust, is therefore essential.\n\nThis talk will briefly go through some of the basics, such public/private key cryptography, DNS, and x509 certificate signing, before examining some of the wider implementation and regulation of PKI (Public Key Infrastructure) online. We'll look at how python interfaces with this, along with some history, and look towards the future of important integrations like certifi and truststore.\n\nWe'll then look at the problems of Supply Chain Attacks and ask how much you should trust your dependencies, before looking at some of the other basic services your code relies on like DNS.\n\nWe’ll then see how you can leverage these trust mechanisms to your advantage to make your code as secure as possible, especially when working in your own cloud environment.\n\nHopefully, this talk will give you a headstart or a refresh on the knowledge required to have genuinely constructive paranoia when coding.\n\nFailing that, at the very least, I promise to make you the go-to expert on how your company's VPN and proxy cause headaches in python and how to fix them securely, rather than giving up and setting a \"trusted-host\". Hopefully you’ll come away having learned a new swear word that you’ll never type again:\n\npip config set global.verify_ssl false",
        "thumbnail": "https://i.ytimg.com/vi/nD27_o-ULVo/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=nD27_o-ULVo",
        "original_url": "https://www.youtube.com/watch?v=nD27_o-ULVo"
    },
    {
        "index": 16,
        "title": "Pythonising Government AI - Michael Dowling",
        "url": "https://www.youtube.com/watch?v=d-kodm3Y-qI",
        "video_id": "d-kodm3Y-qI",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241208",
        "duration": 1944,
        "view_count": 4,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Pythonising Government AI - Michael Dowling \nRoom 2 Session 06\nWe explore the implementation of Python-based AI coding to augment government policy making. Some of the unique challenges of policy making will be highlighted along with tools based on Generative AI that can help address these challenges. A big takeaway from the talk will be on finding the right mixture of prompt engineering and data provision. We'll finish by exploring the promise of large agent models, to solve some of the known drawbacks of large language models.",
        "thumbnail": "https://i.ytimg.com/vi/d-kodm3Y-qI/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=d-kodm3Y-qI",
        "original_url": "https://www.youtube.com/watch?v=d-kodm3Y-qI"
    },
    {
        "index": 17,
        "title": "Reducing Legacy Code's Carbon Footprint with AI - Olivier Bierlaire",
        "url": "https://www.youtube.com/watch?v=8A6TX9MZF20",
        "video_id": "8A6TX9MZF20",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241208",
        "duration": 1878,
        "view_count": 7,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Reducing Legacy Code's Carbon Footprint with AI - Olivier Bierlaire\nRoom 2 Session 07\nIs there anything worse than Lovecraft's creatures, worse than Cthulhu or the Shoggoths? No, it's not a forgotten bug; it's much worse: inefficient legacy code! Not only does maintaining it terrify us, but it also requires more and more resources to function and worsens our carbon footprint! What if AI could come to the rescue?\n\nIt is well known that some programming languages are much more energy-intensive than others. For example, Python is about 76 times more energy-intensive than Rust or C. So, how can AI help us convert an old legacy project into a less energy-intensive technology?\n\nWe will explore the environmental impact of legacy code and how AI can be used to optimize this code. We will examine concrete cases where AI can automatically convert inefficient code into optimized code. And of course, this must be done without regression and without compromising maintainability.\n\nMaybe for a small piece of code, but what about a large project? Let's discover autonomous AI agents, they will work together to help us!\n\nWe will also conduct a practical demonstration of converting legacy Python code to Rust, showing the gains in energy efficiency and reductions in CO2 emissions.\n\nGet ready to discover how AI can transform your legacy code into environmentally friendly code and take on the challenge of reducing the carbon footprint of digital technology!",
        "thumbnail": "https://i.ytimg.com/vi/8A6TX9MZF20/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=8A6TX9MZF20",
        "original_url": "https://www.youtube.com/watch?v=8A6TX9MZF20"
    },
    {
        "index": 18,
        "title": "GitHub Ecosystem for Python Projects: From Hello World to Docker Deployment-Tom Halpin, Eoin Halpin",
        "url": "https://www.youtube.com/watch?v=XBTHgwAwbEA",
        "video_id": "XBTHgwAwbEA",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241208",
        "duration": 1613,
        "view_count": 30,
        "like_count": 2,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Leveraging GitHub Ecosystem for Python Projects: From Hello World to Docker Deployment - Tom Halpin, Eoin Halpin\nRoom 2 Session 08\nThis session will only have some very basic Python code, instead it will cover how to harness the GitHub ecosystem for creating, managing and deploying Python projects. Starting from a simple \"Hello World\" application, this session will guide you through setting up a templated GitHub repository optimized for Continuous Integration (CI) and Continuous Deployment (CD).\n\nKey Points:\n\n- Template GitHub Repository:\n\nStructure a repository tailored for Python projects.\nUtilize issue templates to standardize and streamline issue tracking and resolution.\nCreate a Dockerfile to containerize the Python application.\nUse GitHub Actions to set up CD pipelines to build, scan, and push Docker images to a container registry.\n\n- CI:\n\nSpell Checking: Maintain documentation quality with codespell.\nLink Verification: Ensure valid URLs using lychee-action.\nLinting: Enforce coding standards with flake8 and pylint.\nUnit Testing: Verify code correctness with pytest.\nStatic Application Security Testing (SAST): Identify vulnerabilities with Bandit.\n\n- CD:\n\nDynamic Application Security Testing (DAST): Perform security testing with OWASP ZAP.\nContainer Security: Scan Docker images with Trivy.\nBuild and Deploy to Docker Hub: Automate Docker builds and push to Docker Hub.\nDeployment Automation: Deploy application as a Docker container to Docker Hub.\n\nThe session will showcase how leveraging the GitHub ecosystem can enhance and optimize your Python development workflow.",
        "thumbnail": "https://i.ytimg.com/vi/XBTHgwAwbEA/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=XBTHgwAwbEA",
        "original_url": "https://www.youtube.com/watch?v=XBTHgwAwbEA"
    },
    {
        "index": 19,
        "title": "Vector Voodoo: Unleashing the Magic of Vector Databases with Python -   Paul Minogue",
        "url": "https://www.youtube.com/watch?v=8G4cY4ufy_8",
        "video_id": "8G4cY4ufy_8",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241208",
        "duration": 2307,
        "view_count": 64,
        "like_count": 1,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Vector Voodoo: Unleashing the Magic of Vector Databases with Python   - Paul Minogue\nRoom 2 Session 09",
        "thumbnail": "https://i.ytimg.com/vi/8G4cY4ufy_8/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=8G4cY4ufy_8",
        "original_url": "https://www.youtube.com/watch?v=8G4cY4ufy_8"
    },
    {
        "index": 20,
        "title": "Designing modular services with a practical example in AI/ML model deployment - Florenz Hollebrandse",
        "url": "https://www.youtube.com/watch?v=g3j5BNQKpCk",
        "video_id": "g3j5BNQKpCk",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241208",
        "duration": 1711,
        "view_count": 7,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Designing modular services with a practical example in AI/ML model deployment - Florenz Hollebrandse\nRoom 2 Session 10\nIn this talk we will show how Python applications and services can be designed using a modular approach. We will explain how a simple plugin system can be used to decouple business logic from platform/deployment concerns. The talk will cover the Open Source framework \"pluggy\" (https://github.com/pytest-dev/pluggy).\n\nTo give the talk a practical focus we will walk through an Open Source AI/ML framework (\"inference-server\", https://github.com/jpmorganchase/inference-server) to deploy models to the cloud. Using this example, we will demonstrate how to apply abstractions at the right level, maximize code re-use and make local testing trivial.",
        "thumbnail": "https://i.ytimg.com/vi/g3j5BNQKpCk/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=g3j5BNQKpCk",
        "original_url": "https://www.youtube.com/watch?v=g3j5BNQKpCk"
    },
    {
        "index": 21,
        "title": "Quantifying uncertainty with stochastic and machine learning models - Juan Castillo del Río",
        "url": "https://www.youtube.com/watch?v=0YeadT_BAU4",
        "video_id": "0YeadT_BAU4",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241208",
        "duration": 1512,
        "view_count": 48,
        "like_count": 3,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Quantifying uncertainty with stochastic and machine learning models - Juan Castillo del Río\nRoom 2 Session 11\nUncertainty estimation is a game-changer in banking, trading, retail, and many other fields. The potential applications are endless, and new innovations are emerging across all sectors.\n\nTwo great examples of uncertainty estimation models are:\n\n- Financial risk models, which have been helping banks and trading firms navigate market volatility for years, preventing potential bankruptcies.\n\n- Demand forecasting models, which give valuable insights that allow companies to make better decisions, boosting their efficiency.\n\nThe best way to understand uncertainty estimation models is by seeing them in action. That’s why in this talk we will walk through some real-world risk estimation examples using Python. We’ll explore the pros and cons of various stochastic and machine learning models currently employed by leading companies.\n\nWhile there is no one-size-fits-all model for quantifying uncertainty, this conference will provide you with useful information to choose the best model for your specific use case.",
        "thumbnail": "https://i.ytimg.com/vi/0YeadT_BAU4/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=0YeadT_BAU4",
        "original_url": "https://www.youtube.com/watch?v=0YeadT_BAU4"
    },
    {
        "index": 22,
        "title": "Zoology 101: python, pandas, and duckdb - Jaroslav Bezdek",
        "url": "https://www.youtube.com/watch?v=ISuuiyP4WCs",
        "video_id": "ISuuiyP4WCs",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241209",
        "duration": 1526,
        "view_count": 14,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Zoology 101: python, pandas, and duckdb - Jaroslav Bezdek\nRoom 3 Session 01\nDive into the dynamic world of data wrangling with pandas, and duckdb! This talk unveils the strengths, differences, and ideal use cases of these tools, offering a guided tour through the diverse landscape of data processing in Python.",
        "thumbnail": "https://i.ytimg.com/vi/ISuuiyP4WCs/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=ISuuiyP4WCs",
        "original_url": "https://www.youtube.com/watch?v=ISuuiyP4WCs"
    },
    {
        "index": 23,
        "title": "E-ink dashboards everywhere  -  Marcel-Jan Krijgsman",
        "url": "https://www.youtube.com/watch?v=ulSu7QKkCrg",
        "video_id": "ulSu7QKkCrg",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241209",
        "duration": 1635,
        "view_count": 13,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "E-ink dashboards everywhere  -  Marcel-Jan Krijgsman\nRoom 3 Session 02\nPyCon Ireland 2024\nEver since I discovered that there are e-ink displays that you can attach to a Raspberry Pi and program with Python, my mind went racing. You could make anything and hang it on the wall.\n\nWhat can you do with them? Sure, you can photo stand with them. Or show a joke of the day. But there's so much more.\n\nAnd so I build a dashboard that shows my cycling statistics. And a display that shows my calendar for the upcoming days, so I don't forget my appointments. And I created a donation tracker that I used in the field during sponsoring events.\n\nFor the future I hope to see bigger and bigger e-ink displays that can replace posters.",
        "thumbnail": "https://i.ytimg.com/vi/ulSu7QKkCrg/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=ulSu7QKkCrg",
        "original_url": "https://www.youtube.com/watch?v=ulSu7QKkCrg"
    },
    {
        "index": 24,
        "title": "Descriptors in Python - Steve Holden",
        "url": "https://www.youtube.com/watch?v=zY_2wm63j24",
        "video_id": "zY_2wm63j24",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241209",
        "duration": 2136,
        "view_count": 2,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Descriptors in Python - Steve Holden\nPyCon Ireland  2024\nRoom 3 Session 03\nFrom the famous author of \"Python in a Nutshell\"!\n\nExplore the powerful descriptor protocol in Python, which underlies the functionality of properties, methods, and custom attribute management.\nLearn how to implement and use descriptors to control attribute access, validation, and behavior in your classes, unlocking deeper insights into Python's object model.",
        "thumbnail": "https://i.ytimg.com/vi/zY_2wm63j24/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=zY_2wm63j24",
        "original_url": "https://www.youtube.com/watch?v=zY_2wm63j24"
    },
    {
        "index": 25,
        "title": "Testable data pipelines -  Florian Stefan",
        "url": "https://www.youtube.com/watch?v=DwiXAA14O9M",
        "video_id": "DwiXAA14O9M",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241209",
        "duration": 1952,
        "view_count": 9,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Testable data pipelines - Lessons learned from writing modular SQL and Python models with DBT -  Florian Stefan\nRoom 3 Session 04\nThe \"data build tool\" (DBT) was designed to unlock software engineering best practices for SQL-based data pipelines: pipelines as version controlled directed acyclic graphs (DAGs) consisting of testable and reusable nodes. With the increasing number of cloud data warehouses and data lakehouses that allow the native execution of Python code, DBT also added support for Python models.\nIn this talk, I will explain how Flatiron Health uses DBT to improve and extend lives by learning from the experience of every person with cancer. We will discuss an example project setup that uses SQL as well as Python models. I will share our experiences with unit and data testing as well as with writing a reusable variable library.\nThe talk is well-suited for anyone with prior data warehouse or data lakehouse experience who is curious how they can leverage DBT to write test-driven and reusable data piplines. The example project will use SQL, Python and Snowflake.",
        "thumbnail": "https://i.ytimg.com/vi/DwiXAA14O9M/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=DwiXAA14O9M",
        "original_url": "https://www.youtube.com/watch?v=DwiXAA14O9M"
    },
    {
        "index": 26,
        "title": "Uncertainty and Causal Inference in Python with CausalPy - Nathaniel Forde",
        "url": "https://www.youtube.com/watch?v=-C4p4b2cUp8",
        "video_id": "-C4p4b2cUp8",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241209",
        "duration": 1760,
        "view_count": 88,
        "like_count": 4,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Uncertainty and Causal Inference in Python with CausalPy - Nathaniel Forde Room 3 Session 05\nThere is more to causal inference in industry than A/B testing. Often you will want to assess process change where a control group split is wasteful or unethical. To accommodate these questions we can use quasi-experimental causal inference techniques of the kind implemented in CausalPy. CausalPy ensures that we incorporate uncertainty in the estimates of causal effects using Bayesian methods built on top of PyMC.\n\nWe will survey some recent additions to the package and highlight the centrality and use of causal inference in solving business problems.",
        "thumbnail": "https://i.ytimg.com/vi/-C4p4b2cUp8/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=-C4p4b2cUp8",
        "original_url": "https://www.youtube.com/watch?v=-C4p4b2cUp8"
    },
    {
        "index": 27,
        "title": "Building scalable GenAI Pipelines using Apache Beam - Oleksandr Saienko",
        "url": "https://www.youtube.com/watch?v=A7PxTtTQDlY",
        "video_id": "A7PxTtTQDlY",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241209",
        "duration": 1710,
        "view_count": 15,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Building scalable GenAI Pipelines using Apache Beam - Oleksandr Saienko Room 3 Session 07\nPyCon 2024\nWe will explore the process of creating scalable Generative AI (GenAI) pipelines using Apache Beam open-source framework (Python). Attendees will learn about the benefits of using Apache Beam for data processing, and best practices for building efficient and scalable pipelines. Will be demonstrated on how to leverage Apache Beam’s capabilities for LLMs integration to handle large-scale real-time streaming AI workloads. Real-world examples and case studies will illustrate the practical applications and performance benefits of this powerful combination.",
        "thumbnail": "https://i.ytimg.com/vi/A7PxTtTQDlY/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=A7PxTtTQDlY",
        "original_url": "https://www.youtube.com/watch?v=A7PxTtTQDlY"
    },
    {
        "index": 28,
        "title": "Simplifying Python Web App Operations: Automating K8s Ops with Open Source - David Andersson",
        "url": "https://www.youtube.com/watch?v=nWlewzU9Atw",
        "video_id": "nWlewzU9Atw",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241209",
        "duration": 1670,
        "view_count": 3,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Simplifying Python Web App Operations: Automating K8s Ops with Open Source - David Andersson \nRoom 3 Session 08\nAfter creating a great web app using Python such as with flask, the next hurdle to production is how to make it available to users and operate it. And not just your app, but also ingress, the database, observability and the list goes on. We will go through your options for simplifying the operations of your web app using open source tooling. This will include using k8s directly, helm charts, IaaC using pulumi and new tooling developed by Canonical using juju. By the end of the talk you will have seen the benefits and drawbacks of each which will help you make an informed decision on which tool best suits your needs!",
        "thumbnail": "https://i.ytimg.com/vi/nWlewzU9Atw/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=nWlewzU9Atw",
        "original_url": "https://www.youtube.com/watch?v=nWlewzU9Atw"
    },
    {
        "index": 29,
        "title": "Django Performance Optimization using Django Debug Toolbar  - Velda Kiara",
        "url": "https://www.youtube.com/watch?v=mVg3pKEV75M",
        "video_id": "mVg3pKEV75M",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241209",
        "duration": 1824,
        "view_count": 3,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Django Performance Optimization using Django Debug Toolbar  - Velda Kiara\nRoom 3 Session 09\nPyCon Ireland 2024 \nThis talk is tailored to show you how to identify and fix performance issues in Django using Django Debug Toolbar(DJDT). During the talk we will look into the DJDTfeatures, pinpoint bottlenecks, and explore strategies to make your application faster.\n\nDetails of the particular items of the talk include:\n- Introduction of the toolbar, purpose, feature and functionality as well as the benefits in terms of development. (2 min)\n- Highlight the installation and configuration of the DJDT to enable the toolbar in development environment (2min)\n- Go through the keys-panels and their use cases like SQL, Templates, Cache, and Signals. (2min)\n- Identify common performance issues in Django applications and how to use Django Debug Toolbar to detect slow queries, inefficient templates, and other bottlenecks(5 min)\n- How to optimize database queries using the SQL panel (5 min)\n- How to boost template rendering performance with the toolbar(5min)\n- Importance of caching in Django applications and using the Cache panel to monitor cache usage (4min)\n- Optimizing middleware performance by using the Signals panel to track signal usage (3min)\n- Questions(2min)\n\nI will also be having code samples for better description and understanding on the different concepts highlighted above.\n\nThe target audience of the talk are Django developers at all levels who want to:\n- Improve their application's performance\n- Learn how to use the Django Debug Toolbar effectively\n- Gain insights into the inner workings of their applications.",
        "thumbnail": "https://i.ytimg.com/vi/mVg3pKEV75M/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=mVg3pKEV75M",
        "original_url": "https://www.youtube.com/watch?v=mVg3pKEV75M"
    },
    {
        "index": 30,
        "title": "Python Interface for the High-Performance C++ Library, Done the Right Way    Alex Andreev",
        "url": "https://www.youtube.com/watch?v=DjnXowmxguo",
        "video_id": "DjnXowmxguo",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241209",
        "duration": 1629,
        "view_count": 3,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Python Interface for the High-Performance C++ Library, Done the Right Way    Alex Andreev\nPyCon Ireland 2024\nRoom 3 Session 10\nWriting extensively used low-level building blocks in languages other than native Python and exposing them through an interface is a common practice in HPC/ML/AI Python ecosystems to ensure the highest possible performance of a workflow.\n\nThis talk will demonstrate how to design an efficient Python interface for a high-performance library, using the development history of the Intel® Extension for Scikit-learn (sklearnex) as an example. This framework provides a user-friendly Python interface for the oneAPI Data Analytics Library (oneDAL), a collection of accelerated classical machine learning building blocks written in C++.\n\nIn this talk, we will focus on the following details:\n* Tools for interconnectivity between C++ and Python\n* Balancing maintainability, usability, and performance in the Python interface\n* How the existing Python ML ecosystem affects the design of the interface",
        "thumbnail": "https://i.ytimg.com/vi/DjnXowmxguo/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=DjnXowmxguo",
        "original_url": "https://www.youtube.com/watch?v=DjnXowmxguo"
    },
    {
        "index": 31,
        "title": "How I use Python to prepare my astronomy podcast - Marcel-Jan Krijgsman",
        "url": "https://www.youtube.com/watch?v=WsoLPRvXpNo",
        "video_id": "WsoLPRvXpNo",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241209",
        "duration": 1690,
        "view_count": 4,
        "like_count": 1,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "How I use Python to prepare my astronomy podcast - Marcel-Jan Krijgsman\nPyCon Ireland 2024\nRoom 3 Session 11\nI like to keep track of everything happening in the solar system, and talk about it in my (Dutch) podcast. Only there's so much going on. I was looking for a way to keep track of it all.\n\nSo I build a Python \"pipeline\" that uses ChatGPT to categorise the astronomy and space news for me, so I can more quickly find it. I store all the results in an Elasticsearch index. And I created my first frontend app with Streamlit to help me search the results.\n\nAnd sure, AI can do my podcast now, but were's the fun in that?",
        "thumbnail": "https://i.ytimg.com/vi/WsoLPRvXpNo/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=WsoLPRvXpNo",
        "original_url": "https://www.youtube.com/watch?v=WsoLPRvXpNo"
    },
    {
        "index": 32,
        "title": "A Journey into Regular Expressions - Vishal Vatsa, Mykalin Jones",
        "url": "https://www.youtube.com/watch?v=iX85mQ7lVh0",
        "video_id": "iX85mQ7lVh0",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20250326",
        "duration": 1430,
        "view_count": 3,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "A Journey into Regular Expressions - Vishal Vatsa, Mykalin Jones\nPyCon Ireland 2024\nIn this talk we will talk about how Regexs have gotten a bad wrap over the years and how this powerful tool is not being used appropriately.\n\nWe will define Regex while providing some use cases, explore the history of Regex, from Kleene star, a brief mention of Chomsky, Regular, Non-Regular languages and an introduction to Finite State Machine, which we will use to construct our very own simple regex engine in python.\n\nWhile we don't expect the audience to have a Computer Science background, some ability to code will be a plus.\n\nThis will be a fun journey into the how and why of Regular Expressions, made accessible with Python.",
        "thumbnail": "https://i.ytimg.com/vi/iX85mQ7lVh0/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=iX85mQ7lVh0",
        "original_url": "https://www.youtube.com/watch?v=iX85mQ7lVh0"
    },
    {
        "index": 33,
        "title": "Lightning Talks - Pycon 2024",
        "url": "https://www.youtube.com/watch?v=SmmJaBz56OM",
        "video_id": "SmmJaBz56OM",
        "uploader": "Python Ireland",
        "uploader_id": "@PythonIreland",
        "uploader_url": "https://www.youtube.com/@PythonIreland",
        "upload_date": "20241209",
        "duration": 1824,
        "view_count": 2,
        "like_count": 0,
        "comment_count": null,
        "tags": [
            "Python"
        ],
        "categories": [
            "Science & Technology"
        ],
        "description": "Lightning Talks - Pycon 2024",
        "thumbnail": "https://i.ytimg.com/vi/SmmJaBz56OM/maxresdefault.jpg",
        "age_limit": 0,
        "is_live": false,
        "was_live": false,
        "availability": "unlisted",
        "webpage_url": "https://www.youtube.com/watch?v=SmmJaBz56OM",
        "original_url": "https://www.youtube.com/watch?v=SmmJaBz56OM"
    }
]